[
    {
      "නම": "විජය රජ",
      "රාජ්‍ය සමය": "ක්‍රි.පූ. 543 - 505",
      "විවාහයන්": "කුවේණි කුමරිය, විජායි කුමරිය",
      "මරණය": -505,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "රජරට රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "බම්බා රජ",
      "අනුප්‍රාප්තිකයා": "උපතිස්ස ඇමති",
      "විස්තර": "විජය රජු ලංකාවට පැමිණි ආක්‍රමණිකයෙකි. ඔහු ලංකාව යටත් කරගෙන ක්‍රි.පූ. 543 සිට කි.පූ. 504 දක්වා ලංකාව පාලනය කළහ.ශ්‍රී ලංකාවේ මහාවංශය ඔහු පිළිබඳව කරුණු සොයාගත හැකි ප්‍රාථමික මුලාශ්‍රයයි. විජය රජ මුලින්ම ලංකාවට පැමිණ පය තැබූයේ තම්බපන්නිය ටයි. මහාවංශයට අනුව විජය රජුගේ මිත්තණිය වංග හා කාලිංග වංශික කුමරියකි. ඇය විවාහ වන්නේ සිංහයෙකු සමඟිනි. ඇය එම සිංහයාට දාව දරුවන් දෙදෙනෙකු වදන අතර සිංහයා විසින් මෙම තිදෙනා ව කැලයේ තිබෙන ගල් ගුහාවක සිර කොට තබයි. දිනක් මෙම තිදෙනා ගල් ගුහාවෙන් පැන යන අතර පසුව කුමරියගේ පුත් සිංහබාහු විසින් තම පියා වන සිංහයා ව මරා දමයි. අනතුරුව සිංහබාහු විසින් සිංහපුර නව රාජධානියක් පිහිට වනු ලබයි. එම රාජධානියේ යුවරජු බවට පත් වන්නේ විජය කුමරු යි. නමුත් ඔහුගේ වැරදි ක්‍රියා පිළිවෙත හේතුවෙන් ඔහු ඇතුළු ඔහුගේ අනුගාමිකයන් 700 දෙනෙකුට තම මව් රටින් පිටුවහල් වීමට සිදු වෙයි. අනතුරුව ශ්‍රී ලංකාවට ගොඩ බසින විජය ඇතුළු පිරිසට කුවේණි නම් යක්කනිය මුණ ගැසෙයි. විජයට පහර දුන් කුවේණිය ඔහුගේ පිරිස බිං ගෙයක සිරකර දැමුවාය. තම පිරිස ආපසු නුදුනහොත් කුවේණිය මරා දමන බවට විජය තර්ජනය කළ විට ඇය ඔවුනට ආහාර හා ඇඳුම් ද සපයා දුන්නාය. ඉන්පසු කුවේනිය අවුරුදු 16 ක පමණ වයසැති තරුණියකගේ ස්වරූපයක් ගෙන විජය සමග විවාහ විය. ඉන්පසු ඇගේ සහය ඇති ව විජය යක්කයින් පරාජය කොට ලක්දිව රජ වෙයි."
    },
    {
      "නම": "උපතිස්ස රජ",
      "රාජ්‍ය සමය": "ක්‍රි.පූ. 505 - 504",
      "විවාහයන්": null,
      "මරණය": -504,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "රජරට රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "විජය රජ",
      "අනුප්‍රාප්තිකයා": "පණ්ඩුවාසදේව රජ",
      "විස්තර": "මහාවංසයට අනූව, උපතිස්ස රජ යනු විජය රජුගේ ප්‍රධාන රාජකීය ඇමතිවරයෙකු ලෙස කටයුතු කල අයෙකු වෙයි. උපතිස්සගම ඔහු විසින් ඉදිකරන ලද්දකි."
    },
    {
      "නම": "පණ්ඩුවාසදේව රජ",
      "රාජ්‍ය සමය": "ක්‍රි.පූ. 504 - 474",
      "විවාහයන්": "භද්දකච්චානා",
      "මරණය": -474,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "රජරට රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "උපතිස්ස රජ",
      "අනුප්‍රාප්තිකයා": "අභය රජ",
      "විස්තර": "පඬුවස්දෙව් කුමාරයා, ක්‍රිපූ 504 සිට ක්‍රිපූ 474 දක්වා උපතිස්ස නුවර (වර්තමාන මල්වතු ඔය ආශ්‍රිත ප්‍රදේශයක්) රජු විය. විජය රජුගෙන් පසු ලක්දිව රාජ්‍යත්වයට කුමාරයෙකු නොමැතිවිය. ඒ නිසා විජය රජු තම සොහොයුරා වූ සුමිත්තටහට රාජ්‍ය භාර ගැනීමට ආරාධනා කළේය. නමුත් සුමිත්තද මහළු වියේ සිටි නිසා ඒ සඳහා ඔහුගේ පුත් පණ්ඩුවාසදේව එවීය. ඔහු පැමිණීමට පෙර විජය රජු මියගිය නිසා එතෙක් රාජ්‍ය පාලනය උපතිස්ස භාරකාර රජු (උපතිස්ස ඇමති) ගෙන ගියේය. පසුව ලක්දිව පාලන බලය ලබාගත් පණ්ඩුවාසදේව රජු භද්දකච්චායනා කුමරිය නම් ශාක්‍ය වංශික කුමරියක් බිසව කරගත්තේය. ඇගෙන් ඔහුට අභය,තිස්ස,උත්තිය,තිස්සා,අසේල,විහාන,රාම,ශිව,මත්තකාල,මත්තක, යනුවෙන් පුතුන් 10 දෙනෙකු සහ චිත්‍රා (උන්මාද චිත්‍රා) යනුවෙන් දියණියක්ද විය."
    },
    {
      "නම": "අභය රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 474 -454",
      "විවාහයන්": null,
      "මරණය": -454,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "රජරට රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පඬුවස්දෙව් රජ",
      "අනුප්‍රාප්තිකයා": "තිස්ස රජ",
      "විස්තර": "අභය රජ යනු උපතිස්ස නුවර රජ ලෙසින්, ක්‍රිපූ 474 සිට ක්‍රිපූ 454 දක්වා රාජ්‍ය පාලනය කළ රජෙකි. ඔහුගේ සොහොයුරන් විසින් ඔවුන් අතුරින් උපතිස්ස නුවර මීළඟ රජ වීමට සුදුසුතම වැඩිමහලා බවට තෝරා ගැනීම නිසා, ඔහුගේ පියාවූ පඞුවස්දෙව් රජුගේ අනුප්‍රාප්තිකයා ලෙසින් ඔහු රජ විය"
    },
    {
      "නම": "තිස්ස රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 454 - 437",
      "විවාහයන්": null,
      "මරණය": -437,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "රජරට රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "අභය රජ",
      "අනුප්‍රාප්තිකයා": "පණ්ඩුකාභය රජ",
      "විස්තර": "තිස්ස යනු උපතිස්ස නුවර රජ ලෙසින්, ක්‍රිපූ 454 සිට ක්‍රිපූ 437 දක්වා රාජ්‍ය පාලනය කළ රජෙකි. ඔහුගේ වැඩිමහළු සොහොයුරු අභය රජුගේ අනුප්‍රාප්තිකයා ලෙසින් හෙතෙම සිංහාසනාරූඨ වූයේ සොහොයුරාගේ නෙරපීම හා සමගය. ඔහුගේ බාල සොහොයුරන් අට දෙනා විසින් අභය උපරාජයා ලෙසින් පත් කළේ, ඔහුගේ බෑණා වූ පණ්ඩුකාභය රජ අත්‍යන්තයෙන් පරාජය කළ විට ඔහු රාජාභිෂේක කරනු ලබන බවට එකඟ වෙමිනි. කෙසේවෙතත් පණ්ඩුකාභය විසින් ඔහු සිහසුනෙන් නෙරපන ලදි."
    },
    {
      "නම": "පණ්ඩුකාභය රජ",
      "රාජ්‍ය සමය": "ක්‍රි:පූ 437 - 367",
      "විවාහයන්": "ස්වර්ණපාලි කුමරිය",
      "මරණය": -367,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "අභය රජ",
      "අනුප්‍රාප්තිකයා": "මුටසීව රජ",
      "විස්තර": "පණ්ඩුකාභය ( ක්‍රි:පූ 437 - 367 ) යනු, ලංකාවේ සිටි ශ්‍රේෂ්ඨ රජකෙනෙකි. ඔහු ආර්යයන් පරදා රට එක් සෙසත් කළ මුල්ම ස්වදෙශික පාලකයාය. එතුමා විසින් අනුරාධපුරය අගනුවරක් ලෙසින් දියුණු කළේය. මහාවංශයට අනුව පඩුවස්දෙව් රජුට හා භද්දකච්චායනා බිසවට දාව පුතුන් දසදෙනෙකු සහ දියණියක මෙළොවට බිහිවිය. වැඩිමහල් පුතු අභය වූ අතර බාලම දියණිය චිත්‍රා විය. අනාගතයෙ රාජ්‍යය නිසා චිත්‍රා කුමරියගේ පුත්‍රයා ඔහුගේ මාමාවරු මරාදමන බවට නෙයිමිත්තක කරුවන් ප‍‍්‍රකාශ කළේය. ඒ අසා නැගනියන් මරන්නෙමුයි චිත්‍රා කුමරියගේ සොහොයුරන් තීරණය කළහ. නමුත් වැඩිමහල් අභය කුමරු එය වැළකිය. ඉන්පසු ඔවුන් එක්ටැම් ගෙයක් තනවා සියලූ රැකවල් යොදා දාසියක සමග චිත්‍රා කුමරියව බොහෝ කලක් රදවා තබන ලදී. දුටුවන් උමතු කරවන තරම් රුවක් චිත්‍රා හ‍ට තිබූ නිසා ඇය උන්මාද චිත්‍රා ලෙසද හදුන්වන ලදී. භද්දකච්චායනා කුමරිය ලක්දිවට පැමිණි බව අසා ඇගේ සොයුරන් හයදෙනා වු රාම, උරුවෙල, අනුරාධ, විජිත, දීඝායු සහ රෝහණ ද ලක්දිවට පැමිණයහ. ඔවුන් පැමිණ ලංකාවේ නොයෙක් තැන්වල ජනාවාස පිහිටුවීය. රාම කුමරු විසූ තැන රාමගොණයයි කියනු ලැබේ. උරුවෙල හා අනුරාධ යන දෙදෙනාගේ වාසස්ථාන උරුවෙලය, අනුරාධයයි කියනු ලැබේ. එසේම විජිත, දිර්ඝායු සහ රොහණ යන මොවුන්ගේ වාසස්ථානද විජිතග්‍රාම, දිර්ඝායුග්‍රාම සහ රොහණයයි කියනු ලැබේ. අනුරාධ කුමරු දකුණු දිගින් වැවක් කරවිය. ඉන් ඉක්බිතිව රජගෙයක් කරවා එහි වාසය කළේය. පඬුවස්දෙව් මහරජ සිය දෙටු පිත් අභය කුමරු සුදුසු කල උපරජ තනතුරෙහි අභිෂේක කෙළේය. දීඝායු කුමරුගේ පුත්‍රයා වන්නේ දීඝගාමිණී කුමරුය. දීඝගාමිණී කුමරු චිත්‍රා කුමරිය ගැන අසා ඇය ගැන කැමැත්තක් ඇතිවී උපතිස්ස ග්‍රාමයට ගියහ. ඉන්පසු දීඝගාමිණී කුමරු හා චිත්‍රා කුමරිය අප්‍රසිද්ධව ප්‍රේම සම්බන්ධයක් ගොඩනගා ගනියි. එහි ප්‍රතිඵලයක් ලෙසින් චිත්‍රා කුමරිය ගැබ් ගත්තාය. චිත්‍රා කුමරියගේ දාසිය මේ බව මවුබිසවට කීවාය. මවුබිසව රජුහට මේ බව සැල කළහ. රජු තම පුත්‍රයන් කැඳවා, චිත්‍රා කුමරියව අප විසින් රැකිය යුතුය. එමනිසා දීඝගාමිණී කුමරුටම ඇය දෙමුයි කීයේය. පුතෙක් ඉපදුණොත් මරමුයි සිතා දීඝගාමිණී කුමරුට චිත්‍රා කුමරියව විවාහ කර දුන්හ. චිත්‍රා කුමරිය දරුවා බිහි කිරීමට ආසන්න කාලයේදී,‍ රාජ කුමාරවරුන්ට රහසින් වෙනත් ගර්භනී කාන්තාවක්ව රැගෙනවිත් චිත්‍රා කුමරිය සමීපයේ තැබීය. සුදුසු කාලයේදී චිත්‍රා කුමරිය පුතෙකු වැදුවාය. අනෙක් කාන්තාව දුවෙකු වැදුවාය. ඒ කුමරුව පණ්ඩුකාභය යැයි නම් කළෝය. චිත්‍රා කුමරිය විසින් ඒ කාන්තාවට මසු දහසක් හා සිය පුතු දී, ඒ දියණියව රැගෙන ළඟ හොවාගත්තීය. චිත්‍රා කුමරියට දුවෙක් ඉපදුණායි සිතා රාජ කුමාරවරු සතුටු වූහ. චිත්‍රා කුමරියගේ නියමයෙන් එක් දාසියක් ළදරු කුමරහු කරඬුවක බහාගෙණ දොරමඩල නම් ගමට ගියාය. පණ්ඩුකාභය කුමරු පිළිබද තොරතුරු දැනගත් මාමාවරු කුමරු මැරීමට කිහිපවරක්ම උත්සාහ කළහ. නමුත් බල සම්පන්න දෛවයකට උරුමකම් කියූ පණ්ඩුකාභය කුමරු සියලු අනතුරු වලින් දිවි ගලවා ගත්‍හ. පසුව සොළොස් හැවරදි වූ කුමරු ශිල්ප හැදැරීම සදහා දකුණුදිග පණ්ඩුල නම් ගම විසූ පණ්ඩුල නම් බ්‍රාහ්මණයා වෙත යැවුයේය. කුමරු එහි ගොස් පණ්ඩුල බමුණ මුණගැසිණ. “දරුව ‍තෝ පණ්ඩුකාභය කුමරු දැයි” යි විචාරා “ඒසේය” යි කීකල ඔහුට සත්කාරකොට “දරුව තෝ රජ වන්නීය. සමසැත්තැවසක් රජය කරන්නෙහිය. ශිල්ප උගණුව.” යි කියා ශිල්ප ඉගැන්විය. පණ්ඩුල නම් බ්‍රාහ්මණයාගේ චන්දන නම් පුතු හා පණ්ඩුකාභය කුමරු වහා සිප් නිමවා පන්සියයක් පිරිවර සමග පණ්ඩුල ග්‍රාමයෙන් නික්ම කසගලට පැමිණියහ. එතැනින් සත්සියයක පිරිවර සමග ඉක්බිතිව එක්දහස් දෙසියයකින් සමන්විත පිරිවර ගිරිකණ්ඬසිව නම් කුමරුගේ දේශය වෙත ගියහ. ඉක්බිතිව පාණ්ඩුකාභය කුමරු ගඟින් එතර දොළුගලට ගියේය. එහි සතර අවුරුද්දක් වාසය කෙළේය. මාමාවරුන් එපවත් අසා පාණ්ඩුකාභය කුමරු සමඟ යුද පිණිස එළඹියෝය. මාමාවරුන් දුම්රක්ගල කඳවුරු පිහිටුවා බෑණ සමඟ යුධ කළෝය. මාමාවරුන්ව ගඟින් එතරට පළවා හැරි පණ්ඩුකාභය කුමරු ඒ කඳවුරෙහි දැවුරුද්දක් විසිය. දුම්රක්ගල වසන චෙතියා නම් යකින්න තිඹිරසඟන විලෙහි වෙළඹරුවින් ඇවිදින්නීය. සුදු සිරුර හා රන්පැහැති සිත්කලු ඒ වෙළඹ එකෙක් දැක “මෙහි මෙබඳු වෙළඹක් වසන්නීය” යි කුමරු හට දැන්විය. කුමරු රැහැණ ගෙණ ඇය අල්වා ගන්ට එළඹියේය. පසුපසින් ආවහු කුමරු දැක ඕතොමෝ භයවී අතුරුදහන්නොවි ඒ විල සිසාරා දිව්වාය. ඈහට “ති මරමි” කියා කඩුවු එසවිය. “ස්වාමිනි, ඔබට රජය ගෙණ දෙමි. මා නොමැරුව මැනව” යි ඇය කීවාය. ඔවුන් දුම්රක්ගලට ගොස් එහි සතර අවුරද්දක් වාසය කළේය. භටසේනා රිටිගලට අවුදින් යුධකාලය බලමින් එහි සත්අවුරුද්දක් වාසය කළේය. මාමාවරුන් දෙදෙනෙකු හැර ඔහුගේ සෙසු මාමාවරුන් අටදෙනා යුදයට සැරසුණෝය. ඔවුන් රිටිගල එළඹ (එහි පෙර පිහිටි) කුඩානුවර කඳවුරු පිහිටුවා ගෙණ සිවුරගසෙන් දි සෙනෙවියා යවා හාත්පසින් රිටිගල වට කළහ. පණ්ඩුකාභය කුමරු චෙතියා යකිනිය හා මන්ත්‍රණය කොට පණ්ඩුකාභය කුමරු යක්වෙළඹ පිට නැගි කුමාරයාගේ සේනාව මාමාවරුන් සමග යුද්ධයට එළඹුණාය. පණ්ඩුකාභය කුමාරයාගේ සේනාව, සියලුම පරසෙනාද මාමාවරුන් අටදෙනාද මරා යුද්ධය ජයග්‍රහණය කළෝය. ඉනපසු පණ්ඩුකාභය කුමාරු රාජ්‍යත්වයට පත්ව හැත්තෑ වසරක් රාජ්‍යය කළේය."
    },
    {
      "නම": "මුටසීව රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 367 - 307",
      "විවාහයන්": null,
      "මරණය":-307,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පණ්ඩුකාභය රජ",
      "අනුප්‍රාප්තිකයා": "දේවානම්පිය තිස්ස රජ",
      "විස්තර": "මුටසිව රජ යනු, පුරාතන අනුරාධපුර නගරය අගනුවර කරගෙන, ක්‍රිපූ 367 සිට ක්‍රිපූ 307 දක්වා රාජ්‍යය පාලනය කල, අනුරාධපුර රාජධානියෙහි මුල් රජ කෙනෙකි. පණ්ඩුකාභය රජුගේ පුත්‍රයා වූ ඔහුට, පුතුන් නව දෙනෙකු වූ අතර, දේවානම්පිය තිස්ස රජ, උත්තිය රජ, මහාසිව රජ සහ අසේල රජ වැනි, ඔවුන්ගෙන් සමහරුන් ඔහුගේ අනුප්‍රාප්තිකයෝ වූහ. මෙම රජු වසර හැටක් රාජ්‍යය කල අතර එම කාලය අත්‍යන්තයෙන් සාමකාමී යුගයක් විය. අනුරාධපුරයේ මහමෙවුනා උද්‍යානය ඔහුගේ නිර්මාණයක් වන අතර, ඔහුගේ කාර්ය ඵලයක් ලෙසින් ඓතිහාසික වාර්තා වල සඳහන් වන්නේ එපමණකි."
    },
    {
      "නම": "දේවානම්පිය තිස්ස රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 307 - 267",
      "විවාහයන්": null,
      "මරණය": -267,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "මුටසීව රජ",
      "අනුප්‍රාප්තිකයා": "උත්තිය රජ",
      "විස්තර": "මුලින් තිස්ස රජ නමින් රජවූ මෙතුමා පසුව දේවානම්පිය තිස්ස නමින් දෙවනවරට රාජාභිෂේකය ලැබීය. දේවානම්පියතිස්ස රජු අනුරාධපුරය මුලස්ථානය කරගෙන රජ කළ පැරණි රජවරුන්ගෙන් කෙනෙකි. ඔහුගේ රාජ්‍ය කාලය වැදගත් වන‍්නේ මෞර්ය වංශික අශෝක අධිරාජ්‍යයාගේ අනුග්‍රහය ඇතිව එම පාලන සමය තුළ ලංකාවට බුද්ධාගම පැමිණීම හේතුවෙනි. ඔහුගේ රාජ්‍ය කාලය ගැන මුල්ම තොරතුරු ලැබෙන්නේ මහාවංශයෙනි. එය ඊට වඩා පැරණි දීපවංශය මුලාශ්‍රය කොට ගත්තකි. ක්‍රිස්තු පූර්ව 247-207 ත් අතර වසර 40 ක රාජ්‍ය සමය. මෙරජුගේ රාජ්‍ය කාලය ලක්දිව ඉතිහාසයට බෙහෙවින්ම වැදගත් කාල වකවානුවකි.මෙම පාලන සමය දේශපාලන මෙන්ම ආගමික අතින්ද වැදගත් සන්ධිස්ථානයකි. අනුරාධපුරයේ රාජ්‍ය කල මුටසිව රජුගේ දෙවැනි පුත්‍රයා තිස්ස කුමරුය. මහාවංසයේ විස්තර වන ලෙස ඔහු අනෙකුත් සහෝදරයන් අතරින් බුද්ධිමත් හා යහපත් හැසිරීම් අතින් ශ්‍රේෂ්ටතම පුද්ගලයා ද වේ. තවද මෙරජුගේ පාලන සමයේ විදේශයන් සමඟ පැවැති සම්බන්ධතා මගින් ලංකාවට සුවිශේෂී දායාද රැසක් ලැබී ඇත. මෙතුමාගේ අසල්වැසි ඉන්දියාවේ මහා අධිරාජ්‍ය අශෝක අදිරාජ්‍යයා සමඟ පැවැති නොදුටු මිත්‍ර සම්බන්ධතාව මගින් ලංකාවට,)විදිමත් අභිෂේක ක්‍රමයක් ලැබීම, පංච කකුධ භාණ්ඩ ලැබීම. 2)`දෙවනපිය´ වැනි විරුධ නාමයන් ලැබීම, 3)ලංකාවේ යුද හමුදාව සිවුරඟ සෙනගින් යුක්ත වීම, 4)පාටලී පුත්‍ර නගරය ආදර්ශයට ගනිමින් මෙරට බලකොටු ඉදිවීම ආදී බලපෑම් රාශියක් ලංකාවට ලැබුණි. දේවානම්පිය තිස්ස රජුගේ හා අශෝකයන් අතර පැවැති මිත්‍රත්වයෙන් මෙරටට ලැබුණු බුදු දහම මගින් ලංකාව තුල ආගමික නවෝදයක් අති විය."
    },
    {
      "නම": "උත්තිය රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 267 - 257",
      "විවාහයන්": null,
      "මරණය": -257,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "දේවානම්පිය තිස්ස රජ",
      "අනුප්‍රාප්තිකයා": "මහාසිව රජ",
      "විස්තර": "උත්තිය රජ අනුරාධපුර නගරය අගනුවර කරගෙන, ක්‍රිපූ 267 සිට ක්‍රිපූ 257 දක්වා රාජ්‍යය පාලනය කල, රජරට රාජධානියෙහි රජ කෙනෙකි."
    },
    {
      "නම": "මහාසිව රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 257 -247",
      "විවාහයන්": null,
      "මරණය": -247,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "උත්තිය රජ",
      "අනුප්‍රාප්තිකයා": "සූරතිස්ස රජ",
      "විස්තර": "මහාසිව යනු, අනුරාධපුරය පුරාතන අගනුවරෙහි, ක්‍රිපූ 257 සිට ක්‍රිපූ 247 දක්වා රාජ්‍යත්වය හෙබවූ අනුරාධපුර රාජධානියේ මුල් අවදියෙහි ශ්‍රී ලාංකික රජ කෙනෙකි. මහාසිව යනු, මුටසිව රජුගේ බොහෝ පුතුන්ගෙන් එක් අයෙකු වූ අතර, දේවානම්පිය තිස්ස රජ, උත්තිය රජ සහ අසේල රජ යන්නන්ගේ සහෝදරයා විය."
    },
    {
      "නම": "සූරතිස්ස රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 247 - 237",
      "විවාහයන්": null,
      "මරණය": -237,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "මහාසිව රජ",
      "අනුප්‍රාප්තිකයා": "සේන සහ ගුත්තික",
      "විස්තර": "සූරතිස්ස යනු, අනුරාධපුරය පුරාතන අගනුවරෙහි, ක්‍රිපූ 247 සිට ක්‍රිපූ 237 දක්වා රාජ්‍යත්වය හෙබවූ අනුරාධපුර රාජධානියේ මුල් අවදියෙහි ශ්‍රී ලාංකික රජ කෙනෙකි. පණ්ඩුකාභය රජුගේ ලාබාල පුත්‍රයාවූ ඔහු, මුටසිව රජුගේ සහෝදරයා විය. දකුණු ඉන්දියානු දෙමළ ආක්‍රමණිකයන් දෙදෙනෙකුවූ සේන සහ ගුත්තික විසින් සූරතිස්ස රජු පරාජය කොට සටනේදී මරා දමා, සිංහල සිංහාසනය පැහැරගෙන අනුරාධපුරයේ ඒකාබද්ධ පාලකයන් වූ අතර, ශ්‍රී ලංකා‍ව තුල දෙමළ පාලනයක් පිළිබඳව ඓතිහාසිකව වාර්තා වන පළමුවන අවස්ථාව මෙය වෙයි. සිංහල පාලනය, ක්‍රිපූ 215 දී යළි සංස්ථාපනය කෙරිණි."
    },
    {
      "නම": "සේන සහ ගුත්තික",
      "රාජ්‍ය සමය": "ක්‍රිපූ 237 - 215",
      "විවාහයන්": null,
      "මරණය": -215,
      "රාජවංශය/පක්ෂය": null,
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "සූරතිස්ස රජ",
      "අනුප්‍රාප්තිකයා": "අසේල රජ",
      "විස්තර": "ලංකාවට පැමිණි ප්‍රථම ආක්‍රමණිකයන් ලෙස මහාවංශයයේ සදහන්වේ. මොවුන් දෙදෙනා දුවිඩ ජාතික අශ්ව වෙළදුන් දෙදෙනෙකි. ලංකාව පැමිණ සූරතිස්ස රජුගේ හමුදාවට බැදී කලක් සේවය කොට කුමන්ත්‍රණකාරීව බලය අල්ලාගෙන සූරතිස්ස රජු මරා සිහසුන පැහැරගත් ඔවුන් වසර 22 ලංකාවේ සිහසුන හෙබවීය. අධාර්මික පාලනයක් ගෙනගිය මොවුන් වෙහෙර විහාර විනාශ කරමින් රට පාලනය කළහ."
    },
    {
      "නම": "අසේල රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 215 – 205",
      "විවාහයන්": null,
      "මරණය": -205,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "සේන සහ ගුත්තික",
      "අනුප්‍රාප්තිකයා": "එළාර රජ",
      "විස්තර": "මුටසිව රජුගේ නව වන පුතු වූ අසේල රජ සේන සහ ගුත්තික යන ද්‍රවිඩ ආක්‍රමණිකයන් මරා එතැන් සිට දස අවුරුද්දක් රජකම් කරන ලදී. ද්‍රවිඩ ආක්‍රමණිකයන්ගේ පළමු කුමන්ත්‍රණය අසේල රජු විසින් නිමා කරන ලදී. ක්‍රිපූ 205දී මහවැලි ගංතොටින් මෙරටට ගොඩ බැසි දෙමළ ආක්‍රමණිකයෙකු වූ එළාර නැමැත්තා ඒ වන විට වයස් ගතව සිටි අසේල රජු මරවා රජරට සිය යටතට ලබා ගන්නා ලදී."
    },
    {
      "නම": "කාවන්තිස්ස රජ",
      "රාජ්‍ය සමය": "ක්‍රිස්තු පූර්ව 205–161",
      "විවාහයන්": "විහාරමහා දේවිය",
      "මරණය": -162,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "ගෝඨාභය රජ",
      "අනුප්‍රාප්තිකයා": "දුටුගැමුණු රජ",
      "විස්තර": "කාවන්තිස්ස රජ, (කාකවණ්න තිස්ස), යනු ශ්‍රී ලංකාවේ පැරණි රාජධානියක් වූ රුහුණු රාජධානිය තුල රජකම් කල ශ්‍රේෂ්ඨ සිංහල රජ කෙනෙකි. කාවන්තිස්ස රජු දේවානම්පියතිස්ස රජුගේ බාල සහෝදරයෙකු වූ මහානාග රජගේ මුණුපුරෙකු සහ, සිංහලේ මහා රජු සේ සැළකෙන දුටුගැමුණු රජුගේ පියාණන් වෙයි. කාවන්තිස්ස රජතුමන් හට පළමු විවාාහයෙන් දිඝභය නම් පුතෙකුද විහාර මහා දෙවියට දාව දරුවන් දෙදෙනෙක්ද සිටි බව පැවසේ.ඒ දුටු ගැමුණු හා තිස්සයි.කාවන්තිස්ස රජ ලංකාවෙ රුහුණු ප්‍රදෙශය පාලනය කරන සමයේ අනුරාධපුර රජ කලේ ද්‍රවිඩ පාලකයෙකු වු ඒළාරයි. එළාර පරාජය සදහා මුල් අඩිතාලම කාවන්තිස්ස රජු විසින් සැකසීය. නමුත් මහාවංශය තුල කාවන්තිස්ස රජු පිළිබඳ වැඩි සැළකිල්ලක් නොදක්වයි."
    },
    {
      "නම": "එළාර රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 205 – 161",
      "විවාහයන්": null,
      "මරණය": -161,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "අසේල රජ",
      "අනුප්‍රාප්තිකයා": "දුටුගැමුණු රජ",
      "විස්තර": "එළාර යනු, වර්තමාන දකුණු ඉන්දියාවේ, එකල චෝල රාජධානියේ සොළී රජෙක් වූ අතර, වර්තමාන ශ්‍රී ලංකාවේ කොටසක් ක්‍රිපූ 205 සිට ක්‍රිපූ 161 දක්වා පාලනය කල අතර, මෙයට අනුරාධපුරය පුරාතන අගනගරයද අයත් විය. සොළී රටෙහි දෙමළ ජාතිකයෙකු වන එළාර, සිංහලයන් විසින් පවා සාම්ප්‍රදායික ලෙසින් සැලකෙන්නේ ධර්මිෂ්ඨ රජෙකු ලෙසිනි"
    },
    {
      "නම": "දුටුගැමුණු රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 161 - 137",
      "විවාහයන්": "කතී බිසව",
      "මරණය": -137,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "එළාර රජ",
      "අනුප්‍රාප්තිකයා": "සද්ධාතිස්ස",
      "විස්තර": "දුටුගැමුණු හෙවත් ගාමිණී අභය රජතුමා ලාංකීය ඉතිහාසයේ අග්‍රගණ්‍ය රජෙකි. එතුමාව දුට්ඨගාමිණී අභය, ගාමිණී අභය යන නම් වලින්ද හැඳින්වේ. ක්‍රි.පූ 161 සිට ක්‍රි:පූ 137 දක්වා කාලය තුල ලංකාව පාලනය කළ මෙතුමා රජරට පාලකයාව සිටි ආක්‍රමණික එළාර රජ පරදා චෝළ අධිරාජ්‍යයෙන් ලාංකීය ජනතාව රැක ගත්හ. මොහුට දස මහා යෝධයෝ සිටියෝ ය. ඔවුන් සුරනිමල, මහාසෝන, ගෝඨයිම්බර, ථේරපුත්තාභය, භරණ, වේළුසුමන, ලභියවසභ, ඛංඡදේව, පුස්සදේව, නන්දිමිත්‍ර වේ. ගැමුණු, ගාමිණී යනු සාම්ප්‍රදායික සිංහල නමකි. මහාවංශය විස්තර කරන අන්දමට දුටුගැමුණු කුමරුට ආක්‍රමණික නායකයන් හා සටනට නොයන ලෙස ඔහුගේ පියා වන රුහුණු රට කාවන්තිස්ස රජ අණ කරන ලදි. නමුත් ඔහු‍ගේ අණ නොතැකූ කුමරු රජ මැදුරින් පලා ගිය අතර පසුව කාවන්තිස්ස රජුට කාන්තා ආභරණ යවන ලදි. ඔහු මින් අදහස් කරනු ලැබු‍වේ තම පියා විහිලුවටත්, හෑල්ලුවටත් පත් කිරීමයි. දුටුගැමුණු ලෙස පසු කලෙක හදුන්වන ලද්දේ මෙම හේතුව නිසාය. මහාවංශයට අනුව දුටුගැමුණු රජු සිය යුද්ධ මෙහෙයුම දියත් කරනු ලැබුවේ “මාගේ වෑයම රජ සැප විදීම සඳහා නොව, බුද්ධාගමේ චිරස්ථිතිය සඳහාය” යනුවෙන් පවසමිනි."
    },
    {
      "නම": "සද්ධාතිස්ස රජ",
      "රාජ්‍ය සමය": "ක්‍රි.පූ.137 - ක්‍රි.පූ.119",
      "විවාහයන්": "අනුලා දේවි, සෝමා දේවි",
      "මරණය": -120,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "දුටුගැමුණු රජ",
      "අනුප්‍රාප්තිකයා": "තුලත්ථන රජ",
      "විස්තර": "සද්ධාතිස්ස රජ යනු ක්‍රි.පූ.137 - ක්‍රි.පූ.119 අතර කාලය තුල අනුරාධපුර රාජධානියේ, රජකම් කල ශ්‍රේෂ්ඨ සිංහල රජ කෙනෙකි. එතුමා කාවන්තිස්ස රජුගේ පුතණුවන් සහ දුටුගැමුණු රජුගේ සොහොයුරා වෙයි. සද්දාතිස්ස රජුට දාව දරුවෝ සිව් දෙනෙකි. තුලත්ථන ලංජතිස්ස (ලැමිණිතිස්) ඛල්ලාඨනාග (අනුලා දේවි සමග විවාහ වී මහාචුලික නම් පුතෙක් සිටියහ.) වළගම්බා (වට්ටගාමිණී අභය/වලගම් අබා) බල්ලාඨනාග රජු මරා එවකට හමුදා ප්‍රදානියා වූ ඛම්මහරට්ටක (මහාරට්ටක) රජ විය. වලගම්භා ඔහුව මරා රජ වූයේ බු.ව 103 දීය. මෙතුමාට අනුලා දේවි සහ සෝමා දේවි නමින් බිසවන් 2ක් වූහ."
    },
    {
      "නම": "තුලත්ථන රජ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 119",
      "විවාහයන්": null,
      "මරණය": -119,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "සද්ධාතිස්ස රජ",
      "අනුප්‍රාප්තිකයා": "ලජ්ජිතිස්ස රජ",
      "විස්තර": "සද්ධාතිස්ස රජගේ ඇවෑමෙන් පසු ඔහුගේ දෙවැනි පුත් තුලත්ථන රජ එක් මස් දස දිනක් රජ කම් කරන ලදී. එවක දිගාමඩුල්ලෙහි සිටි ඔහුගේ දෙටු සොයුරු ලජ්ජිතිස්ස කුමරු අනුරාධපුරයට පැමිණ ඔහු නෙරපා රාජ උරුමය ලබා ගන්නා ලදී."
    },
    {
      "නම": "ලජ්ජිතිස්ස රජ",
      "රාජ්‍ය සමය": "ක්‍රි.පූ. 119 ක්‍රි.පූ. 109",
      "විවාහයන්": null,
      "මරණය": -109,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "තුලත්ථන රජ",
      "අනුප්‍රාප්තිකයා": "ඛල්ලාඨනාග රජ",
      "විස්තර": "තුලත්ථන රජුගේ වැඩිමහල් සොහොයුරායි. සද්ධාතිස්ස රජුගේ වැඩිමහල්ම පුත්‍රයායි."
    },
    {
      "නම": "ඛල්ලාඨනාග රජ",
      "රාජ්‍ය සමය": "ක්‍රි.පූ. 109 - ක්‍රි.පූ. 104",
      "විවාහයන්": null,
      "මරණය": -104,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "ඛල්ලාඨනාග රජ",
      "අනුප්‍රාප්තිකයා": "වළගම්බා රජ",
      "විස්තර": "ඛල්ලාටනාග රජු සද්ධාතිස්ස රජුගේ තුන්වන ප්‍රත්‍රයාය මෙතුමා මහාරත්ථක නම් සෙනෙවියකු අතින් ඝාතනයට ලක්විය"
    },
    {
      "නම": "වළගම්බා රජ",
      "රාජ්‍ය සමය": "ක්‍රි.පූ. 104 ක්‍රි.පූ. 103",
      "විවාහයන්": "අනුලාදේවිය, සෝමාදේවිය",
      "මරණය": -103,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "මහාරඨ්ඨක",
      "අනුප්‍රාප්තිකයා": "මහකුලි මහතිස්ස",
      "විස්තර": "වළගම්බා හෙවත් වට්ඨ ගාමිණී අභය ( වළගම්බාහු ) ක්‍රි.පු. 103 සිට 77 දක්වා අනුරාධපුරය අග නගරය කර රාජ්‍ය කර වු ශ්‍රේෂ්ඨ සිංහල රජ කෙනෙකි. එතුමා රාජ්‍යයත්වයට පත් වි මාස 5 කට පසු කැරළි හා දකුණු ඉන්දිය ආක්‍රමණ හමුවේ පරාජයට පත් වි සිහසුන අහිමිවිය. නමුත් වසර 14 කට පසු ආක්‍රමණිකයන් පරාජය කර නැවත සිහසුන ලබාගැනිමට එතුමාට හැකි විය. මාතලේ අළුවිහාරයේදි මුල්වරට ත්‍රිපිටකය ග්‍රන්ථාරූඪ කිරිම එතුමාගේ රාජ්‍ය අනුග්‍රහය ඇතිව සිදුවු මහඟු ක්‍රියාවලියකි.(මේ සදහා ප්‍රාදේශීය පාලකයෙක් සහය වූ බව සදහන් වෙතත් වළගම්බා අනුග්‍රහය දැක්වූබවක් මහා වංශයේ නොදැක්වේ මෙය. විමසිය යුතු කරුනකි.බොහෝ දුරට වළගම්බාවන් සහය නොවූ බවට සාධක තිබේ.සහය වූවානම් ඒ සදහා මූලාශ්‍ර සැපයිම අවශ්‍ය වේ) ඒමෙන්ම විශාල වෙහෙර විහාර කරවිමටද එතුමා කටයුතු යොදන ලදි. ඒයින් අභයගිරි විහාරය හා rස්ථුපය රන්ගිරි දඹුළු රජමහා විහාරය ප්‍රධානියක් ගනි.සද්ධාතිස්ස රජු දුටුගැමුණු රජුගේ සහෝදරයා වේ. ඔහුට පුතුන් සිව් දෙනෙකු සිටියේය. එම පුතුන් පිළිවෙළින් ලජ්ජිතිස්ස, ථුලත්තන,ඛල්ලාඨනාග හා වට්ට ගාමිණී අභය (වළගම්බා) විය.සද්ධාතිස්ස රජු ක්‍රි.පූ.137 සිට 119 දක්වා වසර 18ක් රාජ්‍ය පාලනය කළේය. ඔහුගෙන් පසු ථුලත්තන රජු දින 40ක්, ලජ්ජිතිස්ස රජු වසර 10ක් බැගින් පාලනය කිරීමෙන් පසු ඛල්ලාඨනාග රජුට රජකම හිමිවිය."
    },
    {
      "නම": "පුලහත්ථ",
      "රාජ්‍ය සමය": "ක්‍රිපූ 103– ක්‍රිපූ 100",
      "විවාහයන්": null,
      "මරණය": -100,
      "රාජවංශය/පක්ෂය": "පංච ද්‍රවිඩයන්",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "වළගම්බා රජ",
      "අනුප්‍රාප්තිකයා": "බාහිය",
      "විස්තර": "පුලහත්ථ යනු ද්‍රවිඩයන් පස් දෙනගෙන් පළමුවැන්නා විය. පස් මසකට පෙර සිහසුනට පත් පාලක රජතුමාවූ වළගම්බා රජ බලයෙන් පහ කල ඔහු, දකුණු ඉන්දියාවෙන් පැමිණි, පාණ්ඩ්‍ය රාජවංශයේ දෙමළ නායකයෙකි. ඔහුගේ ප්‍රධාන අමාත්‍ය ලෙසින් බාහිය පත් තල හෙතෙම, වසර තුනක් රාජ්‍යය පාලනය කලේ, ක්‍රිපූ 100 දී බාහිය විසින් ඔහු මරා දමන තෙක්ය."
    },
    {
      "නම": "බාහිය",
      "රාජ්‍ය සමය": "ක්‍රිපූ 100– ක්‍රිපූ 98",
      "විවාහයන්": null,
      "මරණය": -98,
      "රාජවංශය/පක්ෂය": "පංච ද්‍රවිඩයන්",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පුලහත්ථ",
      "අනුප්‍රාප්තිකයා": "පණය මාර",
      "විස්තර": "බාහිය යනු ද්‍රවිඩයන් පස් දෙනාගෙන් දෙවැන්නා වූ අතර, හෙතෙම ක්‍රිපූ 100 සිට ක්‍රිපූ 98 දක්වා රාජ්‍ය පාලනය කලේය. පුලහත්ථගේ පාලන සමයේදී ප්‍රධාන අමාත්‍ය වූ හෙතෙම, ඔහු මරා රජකම පැහැර ගති. බාහියගේ පාලන සමය කෙලවර වූයේ, ඔහු සිහසුනට පත්ව වසර දෙකක් ගත වත්ම, ඔහුගේ අග්‍රාමාත්‍ය වූ පණය මාර විසින් ඔහු මරා දැමීමත් සමගය"
    },
    {
      "නම": "පනයමාර",
      "රාජ්‍ය සමය": "ක්‍රිපූ 98– ක්‍රිපූ 91",
      "විවාහයන්": null,
      "මරණය": -91,
      "රාජවංශය/පක්ෂය": "පංච ද්‍රවිඩයන්",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "බාහිය",
      "අනුප්‍රාප්තිකයා": "පිලිය මාර",
      "විස්තර": "ක්‍රිපූ 98 සිට ක්‍රිපූ 91 දක්වා රාජ්‍යය පාලනය කල පණය මාර , ද්‍රවිඩයන් පස් දෙන ගෙන් තෙවැන්නාවූ අතර, ද්‍රවිඩයන් පස් දෙනා අතුරින් වැඩිම කලක් රාජ්‍යය පාලනය කල තැනැත්තා විය. සිහසුනට පත් වීමට පෙර, හෙතෙම බාහිය යටතේ අග්‍රාමාත්‍යය තනතුර දැරූ අතර, පණය මාර විසින් බාහිය මරා රාජ්‍යය පැහැරගෙන සිහසුනට පත්වූයේ ඔහුගේ අග්‍රාමාත්‍යය ලෙසින් පිලිය මාර පත් කරමිනි."
    },
    {
      "නම": "පිළයමාර",
      "රාජ්‍ය සමය": "ක්‍රිපූ 91– ක්‍රිපූ 90",
      "විවාහයන්": null,
      "මරණය": -90,
      "රාජවංශය/පක්ෂය": "පංච ද්‍රවිඩයන්",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පණය මාර",
      "අනුප්‍රාප්තිකයා": null,
      "විස්තර": "අනුරාධපුරයේ රජ ලෙසින් පිලිය මාර රාජ්‍ය පාලනය සිදු කලේ ක්‍රිපූ 91 සිට ක්‍රිපූ 90 දක්වා වෙයි. ඔහුගේ පූර්වප්‍රාප්තිකයන් කල අයුරින්ම සිහසුන ඩැහැගත් හෙතෙම, පණය මාර ඝාතනය කලේ ඔහුගේ ප්‍රධාන අමාත්‍ය ලෙසින් කටයුතු කරමින් සිටියදීය. ද්‍රවිඩයන් පස් දෙන අතුරින්, අඩුම පාලන කාලය සහිත වූයේ පිලිය මාර වන අතර, ඔහුගේ ප්‍රධාන අමාත්‍ය දාඨික විසින් ඔහු මරා රජකම පැහැර ගැනුමට පෙර එය පැවැතියේ සත් මසක් පමණි."
    },
    {
      "නම": "දාඨික",
      "රාජ්‍ය සමය": "ක්‍රිපූ 90– ක්‍රිපූ 88",
      "විවාහයන්": null,
      "මරණය": -88,
      "රාජවංශය/පක්ෂය": "පංච ද්‍රවිඩයන්",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පිලිය මාර",
      "අනුප්‍රාප්තිකයා": "වළගම්බා රජ",
      "විස්තර": "දාඨික යනු ද්‍රවිඩයන් පස් දෙනාගෙන් අවසන් තැනැත්තේ වූ අතර ක්‍රිපූ සිට ක්‍රිපූ 88 දක්වා රාජ්‍ය පාලනය කලේය. දාඨික සිහසුනට පත් වූයේ ඔහුගේ රජු පිලිය මාර ඝාතනය කිරීමෙන් වන අතර, එවිට හෙතෙම ඔහුගේ ප්‍රධාන අමාත්‍ය විය. ක්‍රිපූ 88 දී වළගම්බා රජ විසින් ඔහු මරා දමා සිහසුන පැහැර ගනිමින් විජය රාජ වංශය යළි ස්ථාපිත කලේය. ඊළඟ වසර 12 තුල වළගම්බා රජු විසින් අනුරාධපුර රාජධානිය පාලනය කෙරිණි."
    },
    {
      "නම": "අනුලා රැජිණ",
      "රාජ්‍ය සමය": "ක්‍රි.පූ. 47 –ක්‍රි.පූ. 42",
      "විවාහයන්": null,
      "මරණය": -42,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "චෝරනාග රජු",
      "අනුප්‍රාප්තිකයා": "කූටකණ්ණ තිස්ස",
      "විස්තර": "අනුලා රැජිණ (රාජ්‍යත්වය 47 ක්‍රිපූ - 42 ක්‍රිපූ), අනුලා රැජිණ(ක්‍රි.පූ.47-42) අර්ථවත් පාලනයක් ගෙන ගිය ශ්‍රී ලංකාවේ ප්‍රථම රැජිණයි. එසේම ඇය ආසියාවේ ප්‍රථම රාජ්‍ය පාලිකාව ද වේ. අනුලා රැජිණ බලයට පත් වූයේ චෝරනාග රජුගේ බිසව ලෙසිණි. චෝරනාග රජු අනුරාධපුරයේ වළගම්බා රජුගේ පුත්‍රයාය. කෙසේ හෝ ඇය තමාගේ පාලන කාලය තුළ අඩු ගණනේ තවත් ස්වාමි පුරුෂයන් හතර දෙනෙකුට වස දුන්නාය. අනතුරුව තම අභිමතය පරිදි රාජ්‍ය විචාලාය. ඇය ඉතා ප්‍රසිද්ධ තවත් අනුලා දේවියක් වූ දේවානම්පියතිස්ස රජුගේ බිරිඳ යයි වරදවා තේරුම් නොගත යුතුය. ඇය ගැන තොරතුරු ලැබෙන ප්‍රධාන මූලාශ්‍රය වන්නේ මහා වංශයයි.  අනුලා දේවියගේ රාජ්‍ය කාලයට පෙර ආසන්න කාලය රටේ තත්වය අන්තයට පිරිහී තිබුණි. මාළිගයේම සිදු වූ කුමණ්ත්‍රණයකින් ඛල්ලාටනාග රජු බලයෙන් පහ කෙරුණු අවස්ථාවේ (ක්‍රි.පූ.104) ඔහුගේ බාල සොහොයුරු වට්ටගාමිණී අභය (වළගම්බා) රාජ්‍ය බලය අනියම් ලෙස පැහැර ගැනීමට තැත් කළ අය පලවා හැර අනුලා නමින්ම යුත් තම මිය ගිය සහෝදරයාගේ බිරිය සරණ පාවා ගෙන රජකමට උරුමය ලබා ගත්තේය. ඔහු ඔහුගේ ඤාති පුත්‍රයා වූ 'මහ කුලික' තමාගේම පුතෙකු මෙන් හදා වඩා ගත්තේය.දෙමළු ඔහු සමග සටනකට එළඹුනාහ. 'කොළම්බලක' නම් ස්ථානය අසල කෙරුණු සටනකින් රජු ජය ගත්තේය. මේ සිද්ධිය වන විට වළගම්බාහුට සිහසුනට පත් වී ඉන්නට ලැබුණේ අවුරුද්දකට වැඩි කාලයක් පමණි. ඒ වළගම්බාහු නැවත සිහසුන ගැනීමට අවුරුදු දහයකට පෙරයි. මෙම කාලය වන විට මහ කුලික විසින් චෝරනාග බලයෙන් පහ කළේ වළගම්බාහුගේ අනුමැතිය ලැබූ උරුමක්කාරයා වශයෙනි. මහකුල (මහකුලි මහතිස්ස නමින් පාලනය කළේය) ක්‍රි.පූ.76 දී වළගම්බාහුගේ කිරුළ උරුම කර ගැනීම සඳහා කටයුතු කළේය. අනිත් අතට චෝරනාග 'කැරලිකරුවෙක් ලෙස ජීවත් විය'. මෙම තත්වය සිහසුන ලබා ගැනීම සඳහා අරගලයකට හේතුවූවා යැයි කීමට තොරතුරු නොමැත. ක්‍රි.පූ. 62 දී චෝරනාග සිහසුනට පත්වීම මහකුලි මහතිස්සගේ ඉවත් වීම නිසා සිදු වූවා විය හැක. මහාවංශය වි‍ශේෂයෙන් සඳහන් කරන්නේ චෝරනාග පළමුවෙන්ම කළ ක්‍රියාවන්ගෙන් එකක් වූයේ ඔහු සැඟවී සිටි කාලය තුළ ඔහුට රැකවරණය නොදුන් විහාර දහ අටක් විනාශ කිරීමයි. නව රජයක් තම බලය ස්ථාපිත කිරීමේදී මෙවැනි ක්‍රියාවන් කරන්නේ වුවද හේතුව පැහැදිලි නොවේ. තත්වය කෙසේ පැවතියේ වුවද වාර්තාවල සඳහන් වන අන්දමට චෝරනාග වසර 12 ක් රට පාලනය කළේය. අනතුරුව ඔහුගේ බිසව වූ කුප්‍රසිද්ධ අනුලා දේවිය ඔහුට වස දුන්නාය. අනුලා බිසව තම සැමියා මැරීමට අදහස් කළේ මක්නිසාදැයි විස්තර සඳහන් නොවේ. චෝරනාගගෙන් පසු රජ වූ කුඩා තිස්ස පියාගේම (මහකුලි) පුතා වූයේය. 'කුඩා' යන්නෙන්ම අදහස් වන පරිදි නව රජු කුඩා ළමයෙකු වන්නට ඇත. එසේම අනුලා දේවියගේ පාලනය යටතේ කටයුතු කරන්නට ඇත. ඔහු ස්වාධීන රජෙකු ලෙස කටයුතු කළාද නොකළාද යන්න පැහැදිලි නැත්තේ අනුලා 'ඇය රජ මාළිගයේ ආරක්ෂකයෙකුට වසඟ වී වස දී තිස්ස මරා රජය අනිකාට භාර දුන්නාය ' යනුවෙන් සඳහන් වීමෙනි. එතැන් සිට ඉදිරියට තම නාම මාත්‍ර වල්ලභයා අභිබවමින් අනුලාදේවිය රජරට සැබෑ පාලිකාව වූවාය."
    },
    {
      "නම": "භාතිකාභය අභය රජ",
      "රාජ්‍ය සමය": "ක්‍රි.පූ. 20 - ක්‍රි.ව. 9",
      "විවාහයන්": null,
      "මරණය": 9,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "කුටිකණ්ණ තිස්ස",
      "අනුප්‍රාප්තිකයා": "මහාදාඨික මහානාග",
      "විස්තර": "කුටිකණ්ණ තිස්ස රජුගේ දෙටු පුත් භාතිකාභය (බු.ව.522) රාජ්‍යත්වයට පැමිණියේය (භාතික නමින් රටේ ප්‍රසිද්ධවිය) . සිය සොයුරු මහානාම කුමරු සමග ලෙන්ගතුකමකින් ද ක්‍රියාකළ බව මේ රජුගේ බෞද්ධ පුජාවන් නිසා ම ලංකා ඉතිහාසයේ විශේෂ ස්ථානයක් ගනී. එසේම මොහු රාජ්‍යත්වයට පැමිණිමට ප්‍රථම මොහුතුල බෞද්ධ ධර්මයට තිබු ලැදියාවද, ඔහුගේ රාජ්‍ය කාල සිමාව තුල පිලිබිඹු වේ. මහාදාඨික රජ්ජුරුවන්ගේ සහෝදරයෙක් වන නිසා මේ රජ්ජුරුවන්ගේ නාමය ‘භාතික රජ්ජුරුවෝ’ නමින් දිවයිනේ ප්‍රසිද්ධ වුනා. මේ රජ්ජුරුවෝ ධාර්මිකයි. ලෝවා මහා පායේ ප්‍රතිසංස්කරණ කටයුතු කරවීම මහා ථූපයට (රුවැන්වැලිසෑය) මල් හා ජල පූජාවන් පැවැත්වීය; ඒ අනුව අභය වැවේ ජලය රුවැන්වැලිසෑයට ඉසීම තාක්ෂණ ක්‍රමවේද අනුව කළ බැව් පෙනේ, රෝම රටට දූතයන් යවා පබළු ගෙන්වා ඒවායින් දැල් කරවා , රුවන්වැලිසෑය සුණු පිළියම් කළ පබළු දැළක් සරසවා මහා සෑයේ පූජා කටයුතු කළ බව ඉතිහාස ගතවේ. මොහු තමන්ගේ රාජ්‍ය කාල සිමාව තුලදි, මස් මාංශ විකිණිම සහා සතුන් මැරීම, සහ මුලින්ම නතර කර, රටම ධාර්මික කරගැනිමට උත්සහා දැරු රජ කෙනෙක් බවට බෞද්ධ මිනිසුන් අතර ප්‍රකටය. රෝමයේ ක්ලෝඩියස් රජුගේ කාලයේ එරටට දූතයන් යවා ඒ රට සමග ගිවිසුමක් ඇති කර ගත් බැව් ප්ලිනිගේ ඓතිහාසික විස්තර අනුවද තහවුරු වී ඇත මේ රජුගේ පාලන කාලය තුළ සිය ආඥා චක්‍රය දිවයින තුළ ක්‍රියාත්මක වූ අතර නොයෙක් පළාත්වල සෙල්ලිපි පිහිටුවා ඇති අතර ඒවායින් ලිපි 15 ක් පමණ හදුනා ගෙන ඇත දක්ෂිණ දේශය සිය සොයුරාට ද රෝහණ දේශය සිය පුත්‍රයාටද පවරා තැබූ බැව් හැගී යයි. එසේම මේ රජුගේ කාලයේ ලංකාවේ බටහිර වෙරළ ආශ්‍රිතව නාවික සේවාවක් පවත්වා ගෙන ගොස් ඇති බැව් පෙනේ කලා වැව නිම්නයේ ඇති අනුල පවත නම් විහාරයට කරන ලද පුද පූජා පිළිබඳව ප්‍රධානියා අහල ඇමතිවරයා බැව් පැහැදිළිය. රෝම රටින් පබළු ඇතුළු පූජා භාණ්ඩ ගෙන ඒමත් පසුව සේරි රටට හෙවත් චීනයට වෙළද කටයුතු පිණිස ගිය ගමන් බිමන් ආදියත් මේ කරුණු හා සැසදේ. එසේම භාතිකාභය රජු ධර්මාධිකරණ ක්‍රමයක් ක්‍රියාත්මක කළ බවත්,අධිකරණ කටයුතුවලදී ගෝදත්ත නම් තෙරුන් වහන්සේගෙන් උපදෙස් ලබාගෙන ඇත. එසේම ගවයන් මැරීම හා ගවමස් කෑමද මේ රජු විසින් තහනම් කර තිබූ බැව් පෙනේ. භාතිකාභය රජුගේ රාජ්‍ය කාලය පිළිබඳව රාජ රත්නාකාරය හා රාජාවලිය යන ග්‍රන්ථවල එකිනෙකට වෙනස් තොරතුරු දැක්වේ මහා වංශයේ දැක්වෙන්නේ විසි අට වසක් රජකම් කළ බවයි. එලෙසින්ම දැහැමින් රට පාලනය කරගෙන ගිය බවයි, බොහො ලිපි වලින් සදහන් වේ."
    },
    {
      "නම": "මහාදාඨික මහානාග රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 9 - 21",
      "විවාහයන්": null,
      "මරණය": 21,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "භාතිකාභය අභය රජ",
      "අනුප්‍රාප්තිකයා": "අමණ්ඩගාමිණී අභය",
      "විස්තර": "ඒ භාතික රජ්ජුරුවන්ගේ අභාවයෙන් පස්සේ ඔහුගේ මළනුවන් වන මහාදාඨිකමහානාග නැමැති රජ්ජුරුවෝ රජකමට පත්වුනා.ඒ මහාදාඨික රජ්ජුරුවෝ දොළොස් අවුරුද්දක් රජකම් කළා. නොයෙක් ආකාර වූ පින් පිහිට කරගෙන සිටි ඒ රජ්ජුරුවෝ මහාසෑයේ ගලින් කළ පේසාවළල්ලට පහලින් කිඤ්ජක්ඛ නැමැති පියුම් කැටයම් කළ ගල් ඇතිරෙව්වා."
    },
    {
      "නම": "සීවලී රැජින",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 35 - 35",
      "විවාහයන්": null,
      "මරණය": 35,
      "රාජවංශය/පක්ෂය": "විජය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "චූලාභය",
      "අනුප්‍රාප්තිකයා": "අරාජික සමය",
      "විස්තර": "සිංහල රාජාවලියේ එන දෙවන රැජීන සීවලී රැජිනයි. මෙතුමිය අනුරාධපුර රාජධානියේ චූලාභය රජුගේ නැගණියයි. ඇගේ පියා මහා දාඨික මහානාග රජුය මාස කිහිපයක් පමණක් සිහසුන හෙබවීය. ඉලනාග රජු ඇයව පලවා හැර සිහසුන උදුරාගත්හ."
    },
    {
      "නම": "වසභ රජ",
      "රාජ්‍ය සමය": "ක්‍රිව 67–111",
      "විවාහයන්": "මෙත්තා(සිය නැන්දනිය)",
      "මරණය": 111,
      "රාජවංශය/පක්ෂය": "Iවන ලම්බකර්ණ රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "සුභරජ රජ",
      "අනුප්‍රාප්තිකයා": "වංකනාසික තිස්ස රජ",
      "විස්තර": "වසභ රජ යනු ශ්‍රී ලංකාවේ අනුරාධපුර යුගයෙහි රජ කෙනෙකි. වී ගොවිතැනට උපකාර වනු වස් මහා පරිමාණයේ ජලාපවහන කර්මාන්ත ගොඩනැගීමෙහි පුරෝගාමියෙකු ලෙසින් එතුමා සැලකෙයි. එතුමාගේ පාලන සමයෙහිදී වැව් 11 ක් සහ ඇළ 12 ක් තනන ලදි. එකල පැවති ඒවා ප්‍රතිසංස්කරණය කිරීමට අමතරව, එතුමා බොහෝ නව බෞද්ධ විහාරස්ථාන ඉදිකිරීමද සිදු කලේය. එවකට අනුරාධපුර පාලකයාව සිටි සුභරාජ රජ මරා සිහසුන පැහැර ගත් වසභ රජ, ශ්‍රී ලාංකික රජවරුන්ගේ ඉතිහාසයෙහි නව රාජ වංශයක් ඇරඹීය.මෙතුමා වල්ලිපුරම් රන් සන්නස පිහිටුවිිය. ඉසිගිරි ඇමති යොදවා යාපනය පාලනය කර ඇත. ලම්භකර්ණ නම් ගෝත්‍රයකට අයත් පවුලකට උපන් වසභ, ඔහුගේ ළමා විය රටෙහි උතුරු පළාතේ ගත කළේය., රජුගේ හමුදාවෙහි සේනාධිපතියෙකු වූ ඔහුගේ මාමාට සේවය කරමින්. එකල රටෙහි පාලකයා වූයේ සුභරාජ රජ වූ අතර, ශාස්ත්‍රකාරයන් විසින් ඔහු හට පවසා තිබුනේ, වසභ නමැත්තෙක් විසින් ඔහු පරාජය කොට රජ වන බවයි. මෙය වැලැක්වීමට, සුභරාජ රජ නියෝග කලේ, එම නම දරන සියළු රට වැසියන් මරා දමන ලෙසටයි. වසභගේ මාමා විසින් ඔහු රජු වෙත ගෙන යෑමට තැත්කලේ රජුගේ සේවයට ඔහු බඳවා ගැනුමට යන මුවාවෙනි. කෙසේවෙතත්, රජුගේ අදහස පිළිබඳ ඔහු දැනුවත් කල මාමාගේ බිරිය වූ මෙත්තා විසින් සිදු වෙන්නට ගිය ජීවිත හානියෙන් ඔහු මුදවා ගත්තාය. සැඟව පලා ගිය ඔහු, රහසේ හමුදාවක් රැස් කර ගති.තම දිවි ගලවා ගත් මෙත්තා නම් සිය නැන්දනිය විවාහ කර ගත් මෙම රජුට අයත් සෙල්ලිපි උතුරේ යාපන අර්ධද්වීපයෙන්ද,දකුණේ සිතුල්පව්වෙන්,නැගෙනහිර මඩකළපුචෙන්ද,බටහිර කුරුණෑගල දිස්තික්කයෙන්ද ලැබී ඇති හෙයින් මෙම රජතුමාගේ බලය මුලු දිවයින පුරා පැතිර තිබූ බව කියයි. පුරා අවුරුදු 44ක් වූ සිය රාජ්ය කාලයේදී හෙතෙම වෙහෙර, විහාර වැව්, අමුණු ආදිය කරවූවේය. වසභ රජුගෙන් ඇරඹි ලම්බකර්ණ රාජ්යවන්ශය පුරා අවුරැදු 370ක් දිවයින පාලනය රනු දක්නට ලැබේ. මෙතුමා කරවූ වැව් අතර මහවිලච්චිය, මානාකැටිය, නොච්චිපොතාන, හිරිවඩුන්න, ඇලහැර වැවද වේ. අත්‍යන්තයෙහිදී හමුදාවක් රැස් කර ගත් පසු, රජුට විරුද්ධ කැරැල්ලකට වසභ නායකත්වය සපයමින්, ඉන්පසු ක්‍රිව 67 දී සුභරාජ රජු සහ ඔහුගේ මාමා මරා සිහසුන ඩැහැ ගති. ක්‍රිව 111 දී ඔහුගේ මරණය වන තුරුම හේ වසර 44 ක් රාජ්‍යය පාලන කලේය.  ඔහුගේ සිංහාසනාරූඪ වීම හා සමගම, ඔහුගේ ගෝත්‍ර නාමය අනුව යමින්, පළමු ලම්භකර්ණ රාජ වංශය නමැති පාලන රාජ වංශයක ආරම්භය ඇති විය."
    },
    {
      "නම": "වංකනාසික තිස්ස රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 111 - 113",
      "විවාහයන්": null,
      "මරණය": 113,
      "රාජවංශය/පක්ෂය": "Iවන ලම්බකර්ණ රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "වසභ රජ",
      "අනුප්‍රාප්තිකයා": "පළමුවන ගජබාහු රජ",
      "විස්තර": "මොහුගේ පියා වසභ රජතුමා ය. ඉංග්‍රීසියෙන් පරිවර්තනය කළ-පළමුවන ලැම්බකන්නගේ නිවසේ සිට අනුරාධපුර රජුගේ දෙවන රජු වන්කනසිකා තිස්ස ය. ඔහු ක්‍රි.ව. 111 සිට 113 දක්වා පාලනය කළේය. ඔහුට පෙර ඔහුගේ පියා වන වසබා සහ ඔහුගේ පුත් ගජබාහු අයි."
    },
    {
      "නම": "පළමුවන ගජබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.135 - 141",
      "විවාහයන්": null,
      "මරණය": 141,
      "රාජවංශය/පක්ෂය": "Iවන ලම්බකර්ණ රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "වංකනාසික තිස්ස රජ",
      "අනුප්‍රාප්තිකයා": "මහල්ලකනාග",
      "විස්තර": "ගජබාහු සිහිපත් කරණ ප්‍රධාන සංසිද්ධි වනුයේ සොළී දේශ සිමාව අනුක්‍රමණය කිරිමත් ඔහුගේ පියා රජකළ කාලයේදී සිරකරැවන් ලෙස අල්ලාගත් 12,000 ක් සිංහලයින් මුදවා ගැනිමටත්ය. ඔහුගේ රාජකාරි කාලය වු සත්‍ය සිදුවිම් හා සිද්ධෂි යථර්ථය පිලිබද තරමක අවිනිශ්චිත භාවයක් පවතී."
    },
    {
      "නම": "මහාසේන රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.275 - 301",
      "විවාහයන්": null,
      "මරණය": 301,
      "රාජවංශය/පක්ෂය": "Iවන ලම්බකර්ණ රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පළමුවන ජෙට්ඨතිස්ස",
      "අනුප්‍රාප්තිකයා": "සිරිමේඝවන්න",
      "විස්තර": "මහාසේන රජ නොහොත් මහසෙන් රජු (ක්‍රි ව 276-303 ) මින්නේරි දෙවියන් ලෙසද හදුන්වා ඇත. මෙතුමා ලංකාවේ වැවු 16 කරවූ බව සදහන්ය. මින්නේරි වැව මින් එකකි. මෙම වැව පිරුණු විට අක්කර 4560 පමණවේ. මෙම වැවට අවශ්‍ය ජලය ලබාගැනීම පිණිස මාතලේ දිස්ත්‍රික්කයේ වූ අඹන් ගඟ සිට ඇලක් කරවිය. මෙතුමන්ගේ රාජ්‍ය කාලය තුලදී දකුණු ඉන්දියාවේ සිට ලන්කාපුරට පැමිණි සංගමිත්ත නම් ස්ථවිරයන් වහන්සේ නමක් බුදුන්වහන්සේ විසින් නියම කල පිළිවෙත් මහාවිහාරය අනුගමනය නොකරන්නේයැයි ලෙස කීම පිට මහාවිහාරය විනාශ කල බව ඉහිහාසයේ සදහන්ය. පසුව රජුගේ මෙම තීරණය වෙනස්වූ බව ඉතිහාසය කරුණු දක්වයි. රුවන්වැලි සෑයට හා අභයගිරි සෑයට වඩා විශාලවූ ජේතවනාරාමය කරවුයේද මහසෙන් රජු විසින්ය."
    },
    {
      "නම": "බුද්ධදාස රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.341 - 370",
      "විවාහයන්": null,
      "මරණය": 370,
      "රාජවංශය/පක්ෂය": "Iවන ලම්බකර්ණ රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "ජෙට්ඨතිස්ස 2",
      "අනුප්‍රාප්තිකයා": "උපතිස්ස I",
      "විස්තර": "බුද්ධදාස රජු ප්‍රකටවන්නේ දක්ෂ වෙදදුරකු ලෙසය ඉතා ධාර්මික රජකුවිය මෙතුමා වෙදපොත් රැසක් රචනාකළ බව සදහන්වේ එසේම මිනිසුන්ට පමනක් නොව සතුනට පවා වෙදකම් කළේය දිවයින පුරා රෝහල් ආදිය ඇතිකළහ මෙතුමා දිනක් පෙනයේ ගෙඩියක් සෑදී වෙදනාවෙන් සිටි නාගරාජයෙකුට වෙදකම් කර සුවපත් කළ බවත් නාගයා රජුට කෘතගුණ සැළකීමක් ලෙස තම නාගමාණිඛය වමාරා දුන්බව ජනප්‍රවාදයේ සදහන් වෙයි"
    },
    {
      "නම": "මිත්තසේන රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.435 - 436",
      "විවාහයන්": null,
      "මරණය": 436,
      "රාජවංශය/පක්ෂය": "Iවන ලම්බකර්ණ රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": null,
      "අනුප්‍රාප්තිකයා": null,
      "විස්තර": "මිත්තසේන රජ, පස්වන සියවසෙහිදී අනුරාධපුරයේ රජ ලෙසින් සිටිමින් 435 සිට 436 දක්වා රාජ්‍යය පාලනය කලේය."
    },
    {
      "නම": "ධාතුසේන රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.455 - 473",
      "විවාහයන්": null,
      "මරණය": 473,
      "රාජවංශය/පක්ෂය": "මෝරිය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "ෂඩ් ද්‍රවිඩයින්",
      "අනුප්‍රාප්තිකයා": "කාශ්‍යප I",
      "විස්තර": "ධාතුසේන රජු ක්‍රි.ව.455 සිට 473 දක්වා අනුරාධපුරය අග නගරය කර රාජ්‍ය කර වු ශ්‍රේෂ්ඨ සිංහල රජ කෙනෙකි. එතුමා ශ්‍රී ලංකාවේ මෞර්ය රාජ වංශයේ පළමු රජුයි. සමහර වාර්ථා වල එතුමා දසන්කෙළි ලෙසත් හදුන්වා දි ඇත. ධාතුසේන රජු එතුමාගෙ රාජ්‍ය පාලන කාලය තුල එකල ශ්‍රී ලංකාවේ කොටසක් පාලන කාලය දකුණු ඉන්දිය ආක්‍රමණිකයන් පරාජ කර වසර 26 කට පසු මුළු ශ්‍රී ලංකාවම නැවත එක්සත් කරවිමට සමත් විය. එතුමාගේ රාජ්‍ය පාලන කාලය තුල විශාල වාරි කර්මාන්ත 18 කරවන ලදි. යෝධ ඇළ, කලා වැව, බලලු වැව එතුමා කරවු වාරි කර්මාන්ත වලින් ප්‍රධාන කිහිපයකි. අවුකන බුද්ධ ප්‍රතිමාවද එතුමාගේ රාජ්‍ය පාලන කාලය තුල කරවු විශාල බුද්ධ ප්‍රතිමාවකි."
    },
    {
      "නම": "කාශ්‍යප I",
      "රාජ්‍ය සමය": "ක්‍රි.ව.479 - 497",
      "විවාහයන්": null,
      "මරණය": 497,
      "රාජවංශය/පක්ෂය": "මෝරිය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "ධාතුසේන රජ",
      "අනුප්‍රාප්තිකයා": "මොග්ගල්ලාන I",
      "විස්තර": "ධාතුසේන රජුගේ දෙටු පුත් වූ කාෂ්‍යප කුමරු පල්ලව රාජ වංශික බිසවකගෙන් ලත් පුත්‍රයෙකු හෙයින් ඇය භින්න මාතෘක විය.මුගලන් කුමරු කාශප රජ දියණිය වෙතින් ධාතුසේන රජුට දාව උපන්නෙක් වූයෙන් ඔහු සමාන මාතෘක විය. හෙළ කුලසිරිතට අනුව සිංහාසනය උරුම වූයේ උභයකුල පාරිශුද්ධත්ව‍ය හිමි වූ මුගලන් කුමරුටය.දකුණු ඉන්දියාවෙන්වූ ආක්‍රමණයකදී භාරතීය සේනාව සමඟ යුධ වැදුණේ කාශ්‍යප කුමරුය. සිය ජයග්‍රහණයෙන් පසු පිය රජු‍ගෙන් ඔහු යුවරජු තනතුර බලාපොරොත්තු වුවත් එය ඉටු නොවීය.ඉන් කලකිරීමට පත් කාශ්‍යප කුමරු චූල වංශයට අනුව ක්‍රි‍‍:ව:111 දී විහාර සෙන්පතියා සමඟ වංශකථාවට අනුව කාශ්‍යප රජු සීගිරිය කරවූයේ මුගලන්ගෙන් එල්ල වේ යැයි සිතූ තර්ජනයට බියෙනි.කුමන්ත්‍රණය කර ධාතුසේන රජු සිහසුනෙන් නෙරපා හැර රාජ්‍ය පවරා දෙනු ලදි. වංශකථාවට අනුව කාශ්‍යප රජු සීගිරිය කරවූයේ මුගලන්ගෙන් එල්ල වේ යැයි සිතූ තර්ජනයට බියෙනි. එහෙත් එහි නටඹුන් වලට අනුව මහාචාර්යය පරණවිතාන සඳහන් කරන්නේ ; සීගිරියේ ඉදිකිරීම් සඳහා වැය කළ හත්කෝටියක ධනස්කන්ධය ද සුවිශාල මිනිස් ශ්‍රම ශක්තිය ද බලන කළ එහි බලකොටුවක් වශයෙන් ඇති අගය සීමා සහිත බවයි.සීගිරි කැටපත් පවුර , වේදිකාව කෙළවර පිහිටි මහා සිංහ රූපය , සිංහ ශරීරය තුළින් පර්වත ඉස්මත්තට විහිදුණු පියගැටපෙළ සහ පර්වත මුහුණත වූ ලලනා රූ රැගත් සිතුවම් යුධ බලකොටුවකට කිසිඳු සබඳතාවක් නොවූ අංග ලක්ෂණයන් බව පරණවිතාන මහතා පෙන්වා දෙයි.සීගිරි පර්වත මුදුණේ නටඹුන් අනුව මිනිස් වාසය සඳහා එහි වූයේ එක් කාමරයකින් වූ ගෘහයක් පමණි.ඒ අනුව සීගිරිය කලා කෞතුකාගාරයක් ,විනෝද මණ්ඩපයක් විය යුතු ය."
    },
    {
      "නම": "මහානාග රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.561 - 564",
      "විවාහයන්": null,
      "මරණය": 564,
      "රාජවංශය/පක්ෂය": "මෝරිය රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "කිත්තිසිරි මේඝවණ්ණ",
      "අනුප්‍රාප්තිකයා": "යඨාලතිස්ස රජ",
      "විස්තර": "මහානාග රජු දේවානම්පිය තිස්ස රජුගේ සොහොයුරා විය. රජුගේ ඇවෑමෙන් අනුරාධපුර රාජ්‍යයේ රජකම මහානාග යුවරජුහට නියමය තිබිණි. නමුත් දේවානම්පියතිස්ස රජුගේ බිසවක් වු අනුලා දේවිය මහානාග යුවරජු ඝාතනය සඳහා කුමන්ත්‍රණ සිදු කළාය. එම කුමන්ත්‍රණය වැරදීමෙන් ඇගේම පුත්‍රයා විෂ අඹ කෑමෙන් මියගියේ ය. ඒ අවස්ථාවේදී තමාගේ ජීවිතයට වූ තර්ජනය දැනගත් මහානාගරජු තම බිරිඳ වූ අනුලා බිසවද රුහුණට පැන ගොස් එහි නව රාජ්‍යක් ඇරඹීය. ඒ යන අතරතුර යඨාල නම් ස්ථානයේ දී ගැබ්බරව සිටි අනුලා බිසව දරුවෙකු ප්‍රසූත කළාය. ඔහුට යඨාලතිස්ස ලෙස නම් තැබීය. පසුව මහානාග රජු රුහුණේ මාගම පෙළපත ඇරඹීය. ඔහු එහි තිස්ස වැව සහ වලස් පොකුණ විශාල කර වලස් වැව කරවීය. මහානාග රජුගෙන් පසු ඔහු පුත් මාගම යඨාලතිස්ස රජවිය."
    },
    {
      "නම": "මානවම්මරජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.691 - 726",
      "විවාහයන්": null,
      "මරණය": 726,
      "රාජවංශය/පක්ෂය": "IIවන ලම්බකර්ණ රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "හත්ථදාට රජු",
      "අනුප්‍රාප්තිකයා": "Vවන අග්ගබෝධි",
      "විස්තර": "මනවම්ම කුමරු දෙවන දාඨෝපතිසුස රජුගේ කාලයේ ඉන්දියාවට පලා ගොස් එහිදී සටන් ශිල්ප හදාරා පසුව ඉන්දියාවේ පල්ලව රජුගේ හමුදාවට බැදී රජුගේ සිත දිනාගෙන පල්ලව රජුගේ උදවු ඇතිව සේනාවක් සමග ලංකාවට පැමින හත්ථදාට රජුමරා සිහසුන ලබාගත්හ ඉතා ධාර්මික රජෙක්විය"
    },
    {
      "නම": "Vවන කස්සප",
      "රාජ්‍ය සමය": "ක්‍රි.ව.912 - 929",
      "විවාහයන්": null,
      "මරණය": 929,
      "රාජවංශය/පක්ෂය": "IIවන ලම්බකර්ණ රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IVවන කස්සප",
      "අනුප්‍රාප්තිකයා": "IVවන දප්පුල",
      "විස්තර": "IIවන සේනගේ පුත්‍රයායි. Iවන උදයගේ උප-රජෙකි. මහාවංශ අටුවාව වන දම්පියා අටුවා ගැටපදය රචනා කරනු ලැබිය."
    },
    {
      "නම": "Vවන මහින්ද රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1001 - 1017",
      "විවාහයන්": null,
      "මරණය": 1029,
      "රාජවංශය/පක්ෂය": "IIවන ලම්බකර්ණ රාජවංශය",
      "රාජධානිය/අගනගරය": "අනුරාධපුර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "Vවන සේන",
      "අනුප්‍රාප්තිකයා": "චෝළ පාලනය",
      "විස්තර": "පස්වන මිහිදු රජු අනුරාධපුර රාජධානියේ අවසන් රජුය මෙතුමා පස්වන සේන රජුගේ සොහොයුරාය දුර්වල පාලකයෙකුවිය අදික බදු පැනවීම නිසා ජනයා තුල රජුකෙරේ සහයෝගය අඩුවිය ජනයා බදු ගෙවීම පැහැර හැරීමනිසා රජුගේ භාණ්ඩාගාර හිස්වූ බව සදහන් වෙයි යුධ ශක්තියෙන් හා ආර්ථික අතින් රජු ඉතාමත් දුර්වල වීමනිසා එවක දකුණු ඉන්දියාවේ අධිරාජ්යයක් බිහිකරමින් සිටි චෝලයන් ගේ අවධානය ලංකාව කෙරේ යොමුවිය රාජරාජ නම් චෝල අධිරාජයා ලංකාව ආක්‍රමණය කොට පස්වන මිහිදු රජු මරා සිහසුන පැහැර ගත්තේය."
    },
    {
      "නම": "පළමුවන විජයබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1055 - 1110",
      "විවාහයන්": "ලීලාවතී බිසව",
      "මරණය": 1110,
      "රාජවංශය/පක්ෂය": "විජයබාහු රාජවංශය",
      "රාජධානිය/අගනගරය": "පොළොන්නරු රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "හත්වන කස්සප",
      "අනුප්‍රාප්තිකයා": "පළමුවන ජයබාහු",
      "විස්තර": "පළමුවන විජයබාහු ( I වන විජයබාහු / මහා විජයබාහු / විජය බා ) ක්‍රි.ව. 1055 සිට 1110 දක්වා පොළොන්නරුව අග නගරය කර රාජ්‍ය කර වු ශ්‍රේෂ්ඨ සිංහල රජ කෙනෙකි. රාජ්‍ය ලේ උරුමය ඇතිව එතුමා උපන්නේය, එකල ශ්‍රී ලංකාවේ කොටසක් ආක්‍රමණික ඉන්දියාවෙහි චෝල අධිරාජ්‍යයයන් විසින් පාලනය කරන ලදි. 1055 දි රුහුණ හෙවත් දක්කිණදේශයේ පාලනය බාර ගත් එතුමා පසුව වසර 17 ක දිගු සටන් මෙහෙයුමකින් පසු 1070 දි චෝල ආක්‍රමණිකයන් සම්පුර්ණයෙන්ම ශ්‍රී ලංකාවේන් එලවා දැමිමට සමත් විය. සියවසකට පසු ශ්‍රී ලංකාව නැවත එක්සත් කිරිමට එමගින් එතුමාට හැකිවිය. එතුමාගේ පාලන කාලය තුල බුද්ධ ධර්මය නැවත පිහිටුවිමටත් යුද්ධය නිසා විනාශ වු යටිතල පහසුකම්, වෙහෙර විහාර, ගොඩනැගිලි ආදිය අළුත් වැඩියා කිරිමටත් කටයුතු කරන ලදි. විජයබාහු , කිත්ති ( කීති ) යන නාමයෙන් ක්‍රි.ව. 1039 දි දක්කිණදේශයේ රුහුණු රාජධානියේ උපත ලැබීය.එතුමා කුඩා අවදියේදී ඔහුගේ දෙමව්පියන් මිය ගියේය.ඉන් පසු ඔහුගේ මාමා කෙනෙක් වූ බුද්දරාජ සමග ජීවත් වුණි. එතුමා රුහුණු පාලකයා වු මොග්ගල්ලාන රජු හා ලෝඛිත බිසවගේ පුතණුවන්ය. එකල ශ්‍රී ලංකාව දකුණු ඉන්දීය චෝල ආක්‍රමණිකයන්ගේ ග්‍රාහණයට නතු වුවත් රුහුණ සිංහල රජවරුන් විසින් චෝල පාලකයන්ට එරෙහිව බලපෑම් කරමින් පාලනය ගෙන යන ලදි. එතුමාට වයස 15 දි රුහුණේ රාජ්‍යයත්වයට පත්විමේ අරමුණ ඇතිව ආක්‍රමණිකයන්ගේ ප්‍රධානියෙකු වු ලෝකිස්සර පරාජය කරන ලදි. පසුව ක්‍රි.ව. 1055 දි විජයබාහු නමින් රුහුණේ රාජ්‍යයත්වයට පත්විය. චෝල හමුදාවන් විජයබාහු රජුගේ හමුදාවන්ට එරෙහිව නිතර නිතර ප්‍රහාර එල්ල කලත් ඒවා මැඩපවත්වා, ක්‍රි.ව. 1058 දි රුහුණ සම්පුර්ණයෙන්ම දකුණු ඉන්දීය චෝල ආක්‍රමණිකයන්ගෙන් නිදහස් කර, සම්පුර්ණ රුහුණු පාලනය එතුමාගේ යටතට ගැනිමට සමත් විය."
    },
    {
      "නම": "Iවන ජයබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1110 - 1111",
      "විවාහයන්": null,
      "මරණය": 1111,
      "රාජවංශය/පක්ෂය": "විජයබාහු රාජවංශය",
      "රාජධානිය/අගනගරය": "පොළොන්නරු රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පළමුවන විජයබාහු රජ",
      "අනුප්‍රාප්තිකයා": "Iවන වික්‍රමබාහු",
      "විස්තර": "Iවන විජයබාහුගේ සොහොයුරායි. Iවන විජයබාහුගේ අග්‍රාමාත්‍යවරයා ද විය."
    },
    {
      "නම": "පළමුවන පරාක්‍රමබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1153 – 1186",
      "විවාහයන්": "ලීලාවතී රැජිණ, භද්‍රාවති දේවිය, රූපාවතී දේවිය",
      "මරණය": 1186,
      "රාජවංශය/පක්ෂය": "විජයබාහු රාජවංශය",
      "රාජධානිය/අගනගරය": "පොළොන්නරු රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IIවන ගජබාහු",
      "අනුප්‍රාප්තිකයා": "දෙවන විජයබාහු",
      "විස්තර": "පළමුවන පරාක්‍රමබාහු ( මහා පරාක්‍රමබාහු 1123–1186) 1153 සිට 1186 දක්වා ශ්‍රී ලංකාවේ රජතුමා විය. එතුමාගේ අග නගරය වූ පොළොන්නරුව හි සිට එතුමාගේ රාජ්‍යත්වය තුලදී, දිවයිනෙහි උප රාජධානි තුන, එතුමා විසින් එක්සත් කරන ලදී. තම අග නගරය පුළුල් කෙරුමට හා විචිත්‍රවත් කෙරුමට යුහුසුළු වූ හේ, විසල් වාරිමාර්ග පද්ධතීන් ගොඩනැංවීම, රටෙහි යුද්ධ හමුදාව ප්‍රතිසංවිධානය කිරීම, බෞද්ධ පිළිවෙත් ප්‍රතිසංස්කරණය කිරීම, කලා කටයුතු වලට රුකුල් දීම ආදියෙහි නියැළුනු අතර, දකුණු ඉන්දියාව සහ මියන්මාරය හි හමුදා ක්‍රියාන්විතයන් හිද නිරත විය. අහසින් වැ‍ටෙන එක් දිය බිඳුවක්වත් මිනිසාගේ ප්‍රයෝජනයට නොගෙන මුහුදට එක් වීමට ඉඩ නොදිය යුතුය යන භාෂණය ඔහුගේ ජනප්‍රිය කියමන් අතුරින් එකකි. පරාක්‍රමබාහුගේ තුරුණු වියෙන් වැඩි කොටසක් ගෙවුනේ, පිළිවෙලින් දක්කිණදේශ සහ රුහුණ යන රාජ්‍යයන්හි රජවරුන් වූ, කිත්ති ශ්‍රී ‍මේඝ සහ ශ්‍රී වල්ලභ යන්නාවූ එතුමාගේ මාමාවරුන්ගේ රජ මාලිගා වල හා, රජ රට රජු වූ, දෙවන ගජබාහු ගේ රජ මාලිගාවෙහිය. 1140 දී පමණ හේ, තම මාමා වූ කිත්තිගේ අනුප්‍රාප්තිකයා ලෙසින් දක්කිණදේශයේ රජු බවට පත්ව ඊලඟ දශකය තුලදී දක්කිණදේශයෙහි යටිතල ව්‍යුහය මෙන්ම එහි යුද්ධ හමුදාවද වැඩි දියුණු කළේය. බොහෝ කල් පැවැති සිවිල් යුද්ධයකින් අනතුරුව, 1153 දී පමණ එතුමාණන්, මුළු දිවයින පුරා තම අණසක පතුරවා 1186 දී එතුමාගේ මරණය දක්වාම එම ස්ථාපිතයෙහි පිහිටියේය. පරාක්‍රමබාහුගේ රාජ්‍ය කාලයෙහිදී, එතුමා විසින්, මියන්මාරයෙහි රජවරුන්ට දණ්ඩන පමුණුවන රිසියෙන් යුද්‍ධ ක්‍රියාන්විතයක් දියත් කල අතර, දකුණු ඉන්දියාවෙහි චෝල අධිරාජ්‍යය ට එරෙහිව පාණ්ඩ්‍යයන් හට උපකාර කරන අතරතුර චීනය හා මැද පෙරදිග රටවල් සමග පුළුල් වෙළෙඳ සබඳතා පවත්වාගෙන ගියේය. දිවයින තුල, ඔහු විසින් ආගමික සිද්ධස්ථාන ස්ථාපිත කිරීම, රෝහල්, සමාජ සුභසාධන ඒකකයන්, ඇළ සහ පරාක්‍රම සමුද්‍රය වැනි විසල් ජලාශ ගොඩනැගීම, ආදිය සිදු කෙරිණි."
    },
    {
      "නම": "ලීලාවතී රැජින",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1197–1195",
      "විවාහයන්": "පළමුවන පරාක්‍රමබාහු රජ",
      "මරණය": 1195,
      "රාජවංශය/පක්ෂය": "විජයබාහු රාජවංශය",
      "රාජධානිය/අගනගරය": "පොළොන්නරු රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "චෝඩගංග",
      "අනුප්‍රාප්තිකයා": "සහස්සමල්ල",
      "විස්තර": "පළමු වන පරාක්‍රමබාහු රජතුමා ශ්‍රී ලංකා ඉතිහාසයේ ස්වාධිපත්‍යය පැතිර වු දෙවැනි රජතුමා ලෙස ඉතිහාසයේ සඳහන් වේ. එතුමන්ගෙන් පසුව එතුමන්ගේ බිරිඳ වූ ලීලාවතී රැජන කිහිප වරක් සිංහාසනය දැරූ ලංකාවේ එකම රැජිනයි. පළමු වතාවට ක්‍රී. ව. 1197 සිට 1200 දක්වා වසර තුනක් පොළොන්නරුවේ පාලනය කළ ඔහු දෙවන වරටත් 1209 සිට 1210 දක්වා දෙවසරක් සිංහාසනයේ සිටියේය. තුන්වන වරටත් නැවත සිහසුනට පත් වූ ඇයට පාලනය කිරීමට හැකි වූයේ මාස හතක් පමණි."
    },
    {
      "නම": "නිශ්ශංක මල්ල රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1187 - 1196",
      "විවාහයන්": "කල්‍යාණවතී රැජින",
      "මරණය": 1196,
      "රාජවංශය/පක්ෂය": "කාලිංග රාජවංශය",
      "රාජධානිය/අගනගරය": "පොළොන්නරු රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "VIවන මහින්ද රජ",
      "අනුප්‍රාප්තිකයා": "Iවන වීරබාහු",
      "විස්තර": "කිර්ති නිශ්ශංක සහ කාලිංග ලෝකේශ්වර යන නාම වලින්ද හැඳින්වුන නිශ්ශංක මල්ල රජතුමා 1187 සිට 1196 දක්වා ශ්‍රී ලංකාව පාලනය කළේය. රජු විසින් නිශ්ශංක ලතා මණ්ඩපය, හැටදාගේ සහ රන්කොත් වෙහෙර ඉදිකරන ලද අතර පැරණි විහාර සහ වැවු රැසක් ප්‍රතිසංස්කරණය කරන ලදී. මහා පරාක්‍රමබාහු රජතුමාගේ අනුප්‍රාප්තිකයා වශයෙන් මෙරට රාජ්‍ය බලය හිමිකර ගත් විදේශීය කුමාරවරයකු ලෙස නිශ්ශංක මල්ල රජු පෙන්වා දිය හැකිය. ඉන්දියාවේ සිට පැමිණි කාලිංග වංශිකයෙකු වූ මොහුගේ සේවය මෙරටට කෙසේ ලැබුණේ ද යන්න මූලාශ්‍රය තොරතුරු සපයනු ලබයි. කාලිංග වංශික නිශ්ශංකමල්ල රජුගේ රාජ්‍ය වර්ෂය ලෙස සැලකෙනුයේ ක්‍රි. ව. 1187 - 1196 දක්‌වා කාලයයි. මොහු පිළිබඳ තොරතුරු ගවේෂණය කරන්නකුට සාහිත්‍ය මූලාශ්‍රය සහ සෙල්ලිපි යන අංශ දෙකෙන්ම තොරතුරු ගවේෂණය කර ගැනීමේ හැකියාව පවතී. විශේෂයෙන්ම සාහිත්‍ය මූලාශ්‍රයන් අතර, මහා වංසයෙහි දෙවැනි කොටසට හිමිවනුයේ අද්විතීය ස්‌ථානයකි. දඹදෙණි යුගයේ දී මයුරපාද පරිවෙණාධිපති බුද්ධපුත්‍ර හිමියන් විසින් රචිත පූජාවලිය තුළින් ද නිශ්ශංකමල්ල රජු පිළිබඳ තොරතුරු රැසක්‌ම ලද හැකිය."
    },
    {
      "නම": "කල්‍යාණවතී රැජින",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1202 - 1208",
      "විවාහයන්": "නිශ්ශංක මල්ල රජ",
      "මරණය": 1208,
      "රාජවංශය/පක්ෂය": "කාලිංග රාජවංශය",
      "රාජධානිය/අගනගරය": "පොළොන්නරු රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "සහස්සමල්ල",
      "අනුප්‍රාප්තිකයා": "ධර්මාශෝක",
      "විස්තර": "කල්‍යාණවතී රැජින යනුවෙන් හැඳින්වෙන්නේ 13වන සියවසේ පොළොන්නරු රාජධානියේ විසූ රැජිනකි. ඇය විසින් 1202 සිට 1208 දක්වා රාජ්‍ය පාලනය මෙහෙයවන ලදී. ශ්‍රී ලංකාවේ සිටි රාජ්‍ය පාලනය කළ රැජිනියන් කිහිප දෙනාගෙන් අයෙකි, ඇය. ඇය සහස්සමල්ලගෙන් පසුව පොළොන්නරුවේ රැජින ලෙස රාජ්‍යත්වයට පත්වූවා ය. ඇගෙන් පසු ධර්මාශෝක සිහසුනට පත් විය. ඇය නිශ්ශංකමල්ල රජුගේ අගබිසව වූවා ය."
    },
    {
      "නම": "ධර්මාශෝක",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1208 - 1209",
      "විවාහයන්": null,
      "මරණය": 1209,
      "රාජවංශය/පක්ෂය": "කාලිංග රාජවංශය",
      "රාජධානිය/අගනගරය": "පොළොන්නරු රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "කල්‍යාණවතී රැජින",
      "අනුප්‍රාප්තිකයා": "අනිකංග",
      "විස්තර": "අයස්මන්ත විසින් කල්‍යාණවතී රැජින ධුරයෙන් පහකොට මොහුව සිහසුනට පත්කරන ලදී."
    },
    {
      "නම": "පරාක්‍රම පාණ්ඩ්‍ය",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1212 - 1215",
      "විවාහයන්": null,
      "මරණය": 1215,
      "රාජවංශය/පක්ෂය": "පාණ්ඩ්‍ය රාජවංශය",
      "රාජධානිය/අගනගරය": "පොළොන්නරු රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "ලීලාවතී රැජින",
      "අනුප්‍රාප්තිකයා": "කාලිංග මාඝ",
      "විස්තර": "ආක්‍රමණික පාණ්ඩ්‍යයෙකි ජගත්පාල රජු සොළීන් විසින් මරණයට පත් කරන ලද අරාජික වූ රෝහණයේ රජ බවට පත්වූයේ මුලින් දක්වන ලද වික්‍රමපාණ්ඩ්‍ය රජුගේ පුත්‍රයා වූ පරාක්‍රම කුමාරයයා.සිය පියා ජගත්පාල රජු සමඟ පැවති සටනේදී දිවි පුදද්දී සිය දිවි රැකගැනීම සඳහා ඔහු සැඟවී යන්නට ඇත.ඔහු විදේශ රටකට ගිය බවක් සඳහන් නොවේ.ජගත්පාල රජුගෙන් පසු රජකමට පත්වූ පරාක්‍රම දේවර්ෂයක් රෝහණය පාලනය කළ පසු සොලීහු ඔහුද අල්ලා මැරූහ. මණිමංගලම් ලිපියෙහි සොළීන්ගෙන් විනාශ වුණු ශ්‍රී වල්ලභ මදන රාජ නම් අයකු ගැන කියවෙයි.සිංහල පොත්වල එබදු නමක් නොදැක්වේ.එහෙත් මහාවංසය දක්වන පරාක්‍රම පාණ්ඩ්‍ය රජු මෙයින් අදහස් කරතැයි පැහැදිලි කර ඇත. වික්‍රමපාණ්ඩ්‍ය හා පරාක්‍රම පාණ්ඩ්‍ය,පාණ්ඩ්‍ය වංශිකයන් බවට සැක නැත.සොළින්ගෙන් පහර වැදුණු පාණ්ඩ්‍ය කුමාරවරුන් සිංහලයන් සමඟ මිත්‍රව සිටින්නට ඇති බවත් ලංකාවේ සොලීන් මැඩීමට ඔවුන් ක්‍රියා කරන්නට ඇති බව පෙනේ. පරාක්‍රම පාණ්ඩ්‍ය රජු දවස කාලිංග මාග ගේ ආක්‍රමණයත් සමඟ 1215 දී පොළොන්නරු රාජධානියේ අභාවය සිදු විය."
    },
    {
      "නම": "කාලිංග මාඝ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1215–1255",
      "විවාහයන්": null,
      "මරණය": 1255,
      "රාජවංශය/පක්ෂය": "නැගෙනහිර ගංග රාජවංශය",
      "රාජධානිය/අගනගරය": "පොළොන්නරු රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පරාක්‍රම පාණ්ඩ්‍ය",
      "අනුප්‍රාප්තිකයා": "IIIවන විජයබාහු",
      "විස්තර": "කාලිංග මාඝ යනු ශ්‍රී ලංකාවේ මධ්‍යතන යුගයේ රජෙකු වන අතර ඔහු සිහියට නැගෙන්නේ ප්‍රාථමික වශයෙන් ඔහුගේ ක්‍රෑර හා පීඩාකාරී පාලනය නිසාවෙනි. 1215දී නැගෙනහිර ඉන්දියාවේ කාලිංග ප්‍රදේශයේ සිට මාඝ මෙහි පැමිණ මෙම රට ආක්‍රමණය කර වන අතර පරාක්‍රම පාණ්ඩ්‍ය සිහසුනෙන් පහකර ලීය. ඔහුගේ රාජ්‍යත්වය තුලදී, දේශීය සිංහලයන් ශ්‍රී ලංකාවේ දකුණු හා බටහිර ප්‍රදේශයන්ටද, රට අභ්‍යන්තරයෙහි මධ්‍ය කඳුකරයටද අතිමහත් වශයෙන් සංක්‍රමණය වූයේ ඔහුගේ පීඩාකාරී පාලනයෙන් මිදීමටය. රජරට නමින් හැදුන්වුනු පුරාණ උතුරු ප්‍රදේශයේ බලය ලබා ගත් අවසාන රජු වුයේ මාඝයි. ඔහු උතුරේ සිංහල බලය විනාශ කිරීමට ගත් පෘථුල උත්සාහය කොතරම් ප්‍රබල වීද යත් රජරටින් බලයට පත් වු සෑම සිංහල රාජ්‍යවංශක්ම පැවතුනේ ප්‍රධාන වශයෙන් දිවයිනේ දකුණු දිශාවේය. වෙනසකට උත්ප්‍රේරකයක් වූ නමුදු මාඝ යනු ශ්‍රී ලංකා ඉතිහාසයෙහි විවාදයට බඳුන් වූ සුවිශේෂී පාලකයෙකි. ඒ වන විට දිවයිනේ පාලන බලයේ හදවත බඳුව තිබූ රජරට රාජධානියට මාඝගේ ආක්‍රමණය විශාල විනාශයක් කළේය. පුරාණ රජදරුවන් විසින් නිර්මාණය කරන ලද මහා නගර වනයට බිලි විය. ඒවා පසුව සොයා ගන්නා ලද්දේ 19 වෙනි ශත වර්ෂයේදීය. දේශීය පාලන බලය ඉන් පසු දකුණට සහ ලංකාවේ මධ්‍යම පළාත්වලට මාරු වූයේ කැලිඩොස්කෝපයක දර්ශන මාරුවන පරිද්දෙනි. උතුරු ප්‍රදේශය අන්තිමට යාපනය රාජධානිය ලෙස විකාශනය වුවද 1619 දී පෘතුග්‍රීසීන් විසින් එය යටත් කරගන්නා ලදී. පුරාණයේ සිට ශ්‍රී ලංකාව බෙදී තිබුණේ රජරට, දක්ඛිණ දේශය සහ රුහුණ වශයෙනි. පළමුවෙන් ඒවා වෙනස් වූයේ රජරට - පතිතදේශ වශයෙන්ද දක්ඛිණ දේශය - මායා රටද වශයෙනි. එහෙත් පසුව එක විටම වාගේ මෙම භාවිතාවන් නතර වී ඒ නම් යල් පිනූ ඒවා බවට පත් විය. ඉන් පසු එම ප්‍රදේශවල බිහි වූ රාජධානි භූගෝලීය වශයෙන් කුඩා වූ අතර යාපහුව - ගම්පොල වැනි ආරක්ෂිත බලකොටු නගර කේන්ද්‍ර කොට ගත්තේය. ඒවා සීතාවක රාජ්‍යය මෙන්ම කෙටි කාලයකට පමණක් සීමා විය. මාඝගේ ආක්‍රමණයේ අමිහිරි මතක සටහන් නිසා සිංහලයින් සහ දකුණු ඉන්දීය චෝල, කේරළ සහ පාන්ඩ්‍යයන් අතර කලින් තිබූ කිට්ටු සම්බන්ධතාවයන් පලුදු විය. පෘථුල ලෙස ඉන්දියාවේ සහ ලංකාවේ ශාඛාවන් අතර ඇති වූ විවාහ සම්බන්ධතා සමග රජරට උසස් පවුල් නොවරදවාම රාජකීය සම්බන්ධයක් සහිත වූ නිසා මධ්‍ය කාලීන රාජ්‍ය පවුල් වර්තමානයේ භාවිතා වන අර්ථයෙන්ම විශිෂ්ට සිංහලයෝ වූහ. කෙසේ වෙතත් ශ්‍රී ලංකා දේශපාලනයේ දකුණු ඉන්දීය බලපෑම නැති වී ගිය බවක් එයින් අදහස් නොකෙරේ. නුවර නායක්කර් රජ පරපුර ඊට සාක්ෂි වේ. කෙසේ වෙතත් මෞර්ය සහ ලම්බකර්ණ වැනි ඉන්දු ලංකා ශ්‍රේෂ්ඨ වංශවල යුගය එයින් අවසාන විය. මාඝගේ ආක්‍රමණයට පෙර සිටම ශ්‍රී ලංකාවේ දේශීය පාලන බලය ක්‍රමයෙන් පිරිහෙමින් තිබුණි. එකී ආක්‍රමණයෙන් පසුවද ශත වර්ෂ 3 ක පමණ කාලයක් රට අරාජිකව මෙන් පැවැතුණේය. ශ්‍රී ලංකාවේ මෙම ඓතිහාසික යුගය අවසන් වන්නේ සතුරෙකුගේ පැමණීමත් සමගය. එම සතුරා පසුව දකුණු ඉන්දියාවේ මහා අධිරාජ්‍යය ද ලංකාවේ තිබුණු රාජ්‍යයන් ද තම අණසකට යටත් කර ගත්තේය. ඒ සතුරා අන් කවරෙකුවත් නොව යුරෝපීය අධිරාජ්‍යවාදීන්ය."
    },
    {
      "නම": "තුන්වන විජයබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1220 - 1224",
      "විවාහයන්": null,
      "මරණය": 1224,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "දඹදෙණිය රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "කාලිංග මාඝ",
      "අනුප්‍රාප්තිකයා": "දෙවන පරාක්‍රමබාහු රජ",
      "විස්තර": "ප්‍රාදේශීය නායකයෙක් ලෙස නැඟී ආ තුන්වන විජයබාහු ක්‍රිස්තු වර්ෂ 1232 දී දඹදෙනිය අග නගරය බවට පත් කරගෙන රාජ්‍යත්වයට පත්වු බෝධි වංශික කුමරෙක් විය. මායා රට එක්සත් කොට එහි දේශපාලන ස්ථාවරත්වයක් ඇති කිරීමට තුන්වන විජයබාහු රජුට හැකි විය. සමකාලීන මූලාශ්‍රවල තුන්වන විජයබාහු රජතුමාව හඳුන්වා ඇත්තේ වන්නි රජු හෙවත් වන්නි නිරිඳු යනුවෙනි. මාඝගේ ආක්‍රමණය නිසා කොත්මලේට ගෙන ගොස් පොළොවෙහි නිදන් කර තිබූ බුදුන් වහන්සේ ගේ දන්ත ධාතුව හා පාත්‍රා ධාතුව වැඩමවා ගෙන අවුත් කෑගලු දිස්ත්‍රික්කයේ බෙලිගල පර්වතය මුදුනේ දළදා මාලිගාවක් ඉඳි කර එහි තැන්පත් කර වූ බව පූජාවලිය නම් වූ ග්‍රන්ථයේ සඳහන් වේ. දළදා වහන්සේ ලබා ගැනීම සිංහාසනයට ඇති උරුමය තහවුරු කරන්නක් විය."
    },
    {
      "නම": "දෙවන පරාක්‍රමබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1234-1269",
      "විවාහයන්": null,
      "මරණය": 1269,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "දඹදෙණිය රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "තුන්වන විජයබාහු රජ",
      "අනුප්‍රාප්තිකයා": "හතරවන විජයබාහු රජ",
      "විස්තර": "දෙවන පරාක්‍රමබාහු යනු කලින් සිටි තුන්වන විජයබහු රජුගේ ලොකු පුතා ය.මායා රටේ රජු ලෙස මේ රජුගේ රාජ්‍ය කාලය ක්‍රිස්තු වර්ෂ 1234 සිට 1269 වන තෙක් ය. දෙවන පරාක්‍රමබාහු රජතුමා බෙලිගල තිබූ දාන්ත ධාතූන් වහන්සේදඹදෙනිය ට වැඩම කර අති උත්කර්ෂවත් දළදා පූජාවක් පවත්වාමාඝ ගෙන් රට මුදවා ගන්නා බවට මහජනතාව ඉදිරියේ ප්‍රතිඥාවක් ද දුන්නේය. භාසා ශාස්ත්‍ර, ආගම් ධර්මය ආදී විසයයන් පිළිබඳ මනා නිපුනතාවයක් තිබූ නිසා මහා පඬි රුවනක් වූ දෙවන පරාක්‍රමබාහු රජ කලිකාල සාහිත්‍ය සර්වඥ පණ්ඩිත යන උපාධි නාමයෙන් ද පිදුම් ලැබීය. දෙවන් පරාක්‍රමබාහු රජතුමාට ආක්‍රමණකාරී සටන් 3කට මුහුණ දීමට සිදු විය. ඒවා නම් මාඝ රජු සමඟ පැවති යුද්ධය, චන්ද්‍රභානු රජුගේ පළමු ආක්‍රමණය හා චන්ද්‍රභානු රජුගේ දෙවන අක්‍රමණයයි. චන්ද්‍රභානු රජුගේ පළමු ආක්‍රමණය දෙවන පරාක්‍රමබාහු රජුගේ එකොළොස්වන රාජ්‍ය වර්ෂයේදී, එනම් ක්‍රිස්තු වර්ෂ 1247 දී සිදු විය. චන්ද්‍රභානු රජු මලය අර්ධ ද්වීපයේ තාම්‍රලිංග දේශයෙන් පැමිණි බව සඳහන් වේ. පරාක්‍රමබාහු රජුගේ බෑනා වූ වීරබාහු කුමරු මෙම සටනේ මූලිකත්වය ගෙන තිබේ. සටනින් පරාජයට පත් වූ චන්ද්‍රභානු පලා ගියේය. මාඝගේ පාලනයෙන් රජරට මුදවා ගැනීම මේ රජුගේ ඊළඟ ප්‍රයත්නය විය. මේ සඳහා දකුණු ඉන්දීය පාණ්ඩ්‍ය අධිරාජයාගේ උදව් ලබා ගෙන ඇත. පාණ්ඩ්‍ය හමුදාවත් පරාක්‍රමබාහු රජුගේ හමුදාවත් නැගෙනහිරින් හා බටහිරින් පොළොන්නරුව වට කොට ක්‍රිස්තු වර්ෂ 1255 දී මාඝ පරාජය කර්න ලදී. මේ රජ දවාස එල්ල වූ මීළඟ ආක්‍රමණය වූයේ පළමුව පරාජයට පත් වූ ජාවක චන්ද්‍රභානු නැවතත් ලංකාව ආක්‍රමණය කිරීමයි. පාණ්ඩ්‍ය අධිරාජයාගෙන් උදව් ලබා ගත් දෙවන පරාක්‍රමබාහු රජු ක්‍රිස්තු වර්ෂ 1261 දී චන්ද්‍රභානු ජීවිතක්ෂයට පත් කළේය. මෙයට හිලව් වශයෙන් පාණ්ඩ්‍ය අධිරාජයා ජාවක රජුගේ පුතකු උතුරු ලංකාවේ නියෝජිතයා වශයෙන් පත් කළ බව සෙල් ලිපිවල සඳහන් වේ."
    },
    {
      "නම": "හතරවන විජයබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1269-1270",
      "විවාහයන්": null,
      "මරණය": 1270,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "දඹදෙණිය රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "දෙවන පරාක්‍රමබාහු රජ",
      "අනුප්‍රාප්තිකයා": null,
      "විස්තර": "ක්‍රිස්තු වර්ෂ 1270 දි දෙවන පරාක්‍රමබාහු රජතුමාගෙ මරණයෙන් පසු දඹදෙනිය අග නගරය කරගෙන රාජ්‍යත්වයට පත් වුනේ ඔහුගේ වැඩිමහළු පුත් විජයබාහු කුමාරයා ය. හතරවන විජයබාහු නමින් ප්‍රකට වූ මෙතුමා බෝසත් විජයබාහු නමින් ද හැඳින්වින. එහෙත් මෙම රජතුමාට බලයේ සිටිය හැකි වුනේ දෙවසරක් පමණි. මිත්ත නම් සෙන්පතියෙක් ක්‍රිස්තු වර්ෂ 1272 දී රජ ගෙදර මෙහෙකරුවෙකුට අල්ලස් දී රජු මරා දමා තෙමේ රජ විය. මිත්ත සෙන්පතියාට සිහසුනට උරුමයක් නොවූ අතර වැටුප් ප්‍රසාද දී හමුදාපතීන් පක්ෂ කරවාගෙන තමන්ට තර්ජනයක් විය හැකි බෝසත් විජයබාහු රජුගේ සොයුරු බුවනෙකබාහු ආදිපාදයන් මැරවීමට චරපුරුෂයන් යෙදවීය. මෙකල රාජ සේවයේ සිටි විදේශීය හමුදාංකයේ සිටි ආර්ය භටයන් මිත්තට අවනත නොවුණු අතර ඔවුන්ගේ නායක ඨකුරක සෙන්පතියා මිත්තව මරා දමා තමා එය සිදුකලේ සිහසුනට උරුමකම් කියන බුවනෙකබාහු ආදිපාදගේ උපදෙස් පරිදි බව සිංහල සෙන්පතියන්ට පැහැදිලි කර ඔවුන්ද පක්ෂ කොටගෙන බුවනෙකබාහු ආදිපාදයන් කැඳවා රජ කරවීය. බුවනෙකබාහු කුමරා පළමු බුවනෙකබාහු රජ නමින් දඹදෙනිය අග නගරය කරගෙන රජ විය. ඒත් ටික කලෙකින් පළමු බුවනෙකබාහු රජතුමා තම අග නගරය වශයෙන් යාපහුව තෝරා ගත්තේය."
    },
    {
      "නම": "පළමු බුවනෙකබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1271–1284",
      "විවාහයන්": null,
      "මරණය": 1284,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "දඹදෙණිය රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "හතරවන විජයබාහු රජ",
      "අනුප්‍රාප්තිකයා": "අරාජික සමය",
      "විස්තර": "බෝසත් විජයබාහු හෙවත් හතරවන විජයබාහු රජතුමාගෙන් පසු ක්‍රිස්තු වර්ෂ 1272 දී රාජ්‍යත්වයට පත් වූයේ පළමුවන බුවනෙකබාහු රජු ය. එතුමා ටික කලෙකින් යාපහුව බලකොටුවට ගොස් එහි සිට රාජ්‍ය කටයුතු මෙහෙයවීය. බෝසත් විජයබාහු රජුට පක්ෂපාතී ව සිටි වන්නි නායකයින් ද උතුරේ පෙළ ගැසෙමින් සිටි නායාකයින් ද මේ රජුට පැවති අභියෝගයින් විය. වාර්ෂික උපසම්පදා උත්සව ආදිය පැවැත්වූ මේ රජතුමා ක්‍රිස්තු වර්ෂ 1284 දී මිය ගියේය. මෙකල කුලසේකර නම් පාණ්ඩ්‍ය රජුගේ ආර්ය චක්‍රවර්ති නම් ඇමති විශාල හමුදාවක් රැගෙන විත් යාපහුව වටලා දළදා වහන්සේ රැගෙන ගිය බව මහා වංශය යේ දෙවන කොටසේ සඳහන් වේ. පළමු බුවනෙකබාහු රජුගේ මරණයෙන් පසු ඇති වූ තෙවසරක අරාජික කාලයට පසු රාජ්‍යත්වයට පත් වූයේ තුන්වන පරාක්‍රමබාහු රජතුමා ය."
    },
    {
      "නම": "IIIවන පරාක්‍රමබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1302 - 1311",
      "විවාහයන්": null,
      "මරණය": 1311,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "දඹදෙණිය රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "අරාජික සමය",
      "අනුප්‍රාප්තිකයා": "IIවන බුවනෙකබාහු",
      "විස්තර": "ක්‍රිස්තු වර්ෂ 1284දී පළමු බුවනෙකබාහු රජතුමාගේ මරණයත් සමඟම සාගතයක් ඇති විය. මෙතැන් සිට වසර 6ක් පමණ ලංකාවේ පිළිගත හැකි රජෙක් නොසිටි නිසා එම කාලය අරාජික කාලයක් සේ සැලකේ. තුන්වන පරාක්‍රමබාහු ක්‍රිස්තු වර්ෂ 1287 දී පාණ්ඩ්‍ය දේශයට ගොස් දන්ත ධාතුව හා පාත්‍රා ධාතුව ලබා ගෙන පොළොන්නරුව අග නගරය කරගෙන රාජ්‍යත්වයට පත් විය. පොළොන්නරුවේ සිට රජ කළත් මෙම රජ සමය ත් යාපහුව යුගයට අයත් සේ සැලකේ. මෙතුමා ක්‍රිස්තු වර්ෂ 1292 වනතෙක් වසර 6ක් රජ කළේය. මෙයින් පසු තුන්වන පරාක්‍රමබාහු රජු පරාජය කර ක්‍රිස්තු වර්ෂ 1292 දී රාජ්‍යත්වයට පත් වූයේ දෙවන බුවනෙකබාහු රජතුමා ය."
    },
    {
      "නම": "IIවන බුවනෙකබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1310 - 1324",
      "විවාහයන්": null,
      "මරණය": 1324,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "දඹදෙණිය රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IIIවන පරාක්‍රමබාහු",
      "අනුප්‍රාප්තිකයා": "IVවන පරාක්‍රමබාහු",
      "විස්තර": "තුන්වන පරාක්‍රමබාහු රජ පරාජය කළ දෙවන බුවනෙකබාහු කුමාරයා ක්‍රිස්තු වර්ෂ 1292 දී යාපහුව අගනුවර කරගෙන රජ විය. මේ රජතුමාව ශ්‍රී නිවාස බුවනෙකබාහු නමින්ද හැඳින්වේ. වසර 7ක් යාපහුවේ සිටි මෙම රජතුමා ඉන්පසු ක්‍රිස්තු වර්ෂ 1300 දී තම රාජධානිය ලෙස කුරුණෑගල තෝරා ගත්තේය. දෙවන බුවනෙකබාහු රජ ක්‍රිස්තු වර්ෂ 1302 වන තෙක් රාජ්‍ය බලයේ සිටියේය. දෙවන බුවනෙකබාහු රජතුමා ගේ ඇවෑමෙන් රාජ්‍යත්වයට පත් වූයේ ඔහු පුත් හතරවන පරාක්‍රමබාහු රජතුමා ය. ඉතිහාසය නැවත නැවත සිදු වීම නිසා දෝ නිරිතදිග රාජධානිවල මුල්ම රාජධානි මාරුව, එනම් අගනුවර දඹදෙනිය නගරයෙන් යාපහුව ට ගෙන ගියේ පළමු බුවනෙකබාහු රජතුමා ය. යාපහුව බලකොටුවෙන් කුරුණෑගල ට ගෙන ගියේ දෙවන බුවනෙකබාහු රජතුමා ය."
    },
    {
      "නම": "IVවන පරාක්‍රමබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1325 - 1325",
      "විවාහයන්": null,
      "මරණය": 1325,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "දඹදෙණිය රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IIවන බුවනෙකබාහු",
      "අනුප්‍රාප්තිකයා": "IIIවන බුවනෙකබාහු",
      "විස්තර": "දෙවන බුවනෙකබාහු රජතුමාගේ ඇවෑමෙන් ඔහු පුත් හතරවන පරාක්‍රමබාහු ක්‍රිස්තු වර්ෂ 1302 දී කුරුණෑගල අගනුවර කරගෙන රාජ්‍යත්වයට පත් විය. කුරුණෑගල යුගය ප්‍රතාපවත් කළ ශ්‍රේෂ්ඨ නරපතියකු ලෙස මොහු වැදගත් වේ. බුදු දදහමට හා ශාස්ත්‍රීය අංශයේ දියුණුවට ඉමහත් සේවයක් මෙම රජතුමාගෙන් සිදු විය. එ නිසාම මෙතුමා පණ්ඩිත පරාක්‍රමබාහු රජ නමිනු ත් හැඳිවින. කුරුණෑගල නගරයේ දළදා මාලිගාවක් කරවීම, දළදා වහන්සේගේ ආරක්ෂාවට හා නඩත්තුවට ගම්වර පූජා කිරීම, දළදා සිරිත ලියවීම, ජාතක පොත සිංහලට හැරවීමට අනුග්‍රහය දැක්වීම,වීදාගම ඝනානන්ද පිරිවෙනට හා තොටගමුවේ විජයබා පිරිවෙනට අනුග්‍රහය දැක්වීම, මහනුවර අස්ගිරි සේනාසනය ආරම්භ කිරීම, සිංහල බෝධි වංශය අනාගත වංශය වැනි පොත් ලියවීම යනාදිය මෙම රජතුමාගෙන් වූ සේවාවන් ලෙස දැක්විය හැකිය. ක්‍රිස්තු වර්ෂ 1326න් මෙතුමාගේ රාජ්‍ය බලය අවසන් වූ පසු ක්‍රිස්තු වර්ෂ 1349 තෙක් තුන්වන බුවනෙකබාහු හා පස්වන විජයාබාහු යන රජවරු රාජ්‍යත්වයේ සිටියහ."
    },
    {
      "නම": "IIIවන බුවනෙකබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1325 - 1326",
      "විවාහයන්": null,
      "මරණය": 1326,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "දඹදෙණිය රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IVවන පරාක්‍රමබාහු",
      "අනුප්‍රාප්තිකයා": "පස්වන විජයබාහු රජ",
      "විස්තර": "ක්‍රිස්තු වර්ෂ 1325 හෝ 1326දී රාජ්‍යත්වයට පත් වූ මෙම රජතුමා හැඳින්වුනේ වන්නි බුවනෙකබාහු යන නමිනුයි. කිසිම අතීත රජ පෙළපතකට සම්බන්ධ නොවූ නිසාත් වන්නි ප්‍රධානියකු හැටියට ජීවිතය ඇරඹූ නිසාත් මෙම නම යෙදෙන්නට ඇතැයි සැලකේ. මේ රජ තම අගනුවර හැටියට තෝරා ගත්තේ කුරුණෑගල යි. මෙම රජතුමාට පසු, ක්‍රිස්තු වර්ෂ 1325 හෝ 1326දී රාජ්‍යත්වයට පත් වූයේ පස්වන විජයබාහු රජතුමා ය."
    },
    {
      "නම": "පස්වන විජයබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1326 - 1344",
      "විවාහයන්": null,
      "මරණය": 1344,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "දඹදෙණිය රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IIIවන බුවනෙකබාහු",
      "අනුප්‍රාප්තිකයා": "හතරවන බුවනෙකබාහු",
      "විස්තර": "ක්‍රි.ව. 1325 හෝ 1326 දී රාජ්‍යත්‍වයට පත් වූ පස්වන විජයබාහු රජතුමා, යාපනය රාජධානියෙහි චන්ද්‍රභානුගේ දෙවන පුත්‍රයා ය. මේ රජතුමා ද තම අගනුවර ලෙස තෝරා ගත්තේ කුරුණෑගල යි."
    },
    {
      "නම": "හතරවන බුවනෙකබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1344 -1358",
      "විවාහයන්": null,
      "මරණය": 1358,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "ගම්පොළ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පස්වන විජයබාහු රජ",
      "අනුප්‍රාප්තිකයා": "Vවන පරාක්‍රමබාහු",
      "විස්තර": "කලින් උප නගරයක් ව පැවතුනු නිසාත්, කඳු කිහිපයකින් වට වූ තැනිතලා බිමක පිහිටි නිසාත්, ශ්‍රී පාද මාර්ගයේ සන්ධිස්ථානයක පිහිටි නිසාත්, මහවැලි ගඟ ගලා බසින නිම් තෙරෙහි පිහිටි නිසාත්, ක්‍රිස්තු වර්ෂ 1341 දී රජ වූ හතරවන බුවනෙකබාහු කුමරු තම අග නගරය වශයෙන් ගම්පොළ තෝරා ගත්තේය. ඒ කාලයේම ඔහුගේ සහෝදර පස්වන පරාක්‍රමබාහු කෑගලු දිස්ත්‍රික්කයේ දැදිගම පාලනය කළේය. මේ යුගයේම අලකේශ්වර නම් වූ ප්‍රභූ පරම්පරාවක් කළුතර දිස්ත්‍රික්කයේ රයිගම බලවත් වී සිටි අතර, ගම්පොළ රජ පවුල හා සම්බන්ධතා පැවැත්වූ තවත් ප්‍රධාන පවුලක් වශයෙන් සේනාධිලංකාර සෙනෙවිරත් පවුල හැඳින්විය හැකිය. ඉතිහාසය නැවත නැවත සිදු වීම නිසා දෝ නිරිතදිග රාජධානිවල මුල්ම රාජධානි මාරුව, එනම් අගනුවර දඹදෙනිය නගරයෙන් යාපහුව ට ගෙන ගියේ පළමු බුවනෙකබාහු රජතුමා ය. යාපහුව බලකොටුවෙන් කුරුණෑගල ට ගෙන ගියේ දෙවන බුවනෙකබාහු රජතුමා ය. කුරුණෑගලින් ගම්පොළට ගෙන ගියේ සතරවන බුවනෙකබහු රජතුමා ය. ක්‍රිස්තු වර්ෂ 1351 දක්වා මෙතුමා රජ කළ අතර ඉන් පසු රාජ්‍යත්වයට පත් වූයේ පස්වන පරාක්‍රමබාහු රජතුමා ය."
    },
    {
      "නම": "Vවන පරාක්‍රමබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1344 - 1359",
      "විවාහයන්": null,
      "මරණය": 1359,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "ගම්පොළ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "හතරවන බුවනෙකබාහු රජ",
      "අනුප්‍රාප්තිකයා": "IIIවන වික්‍රමබාහු",
      "විස්තර": "ක්‍රිස්තු වර්ෂ 1344 සිට දැදිගම තමාගේම රාජධානියක් පවත්වා ගෙන ආ මෙම රජතුමා හතරවන බුවනෙකබාහු රජතුමාගෙන් පසුගම්පොළ රාජ්‍යත්වයට පත් විය. හතරවන බුවනෙකබාහු රජුගේ කාලයේ මෙන්ම මෙම රජතුමාගේ කාලයෙත් සේනාධිලංකාර නම් අමාත්‍යාවරයා රජුටත් වඩා බලවත් වී සිටි අතර මෙම පුද්ගලයා දකුණු ඉන්දියානු පරපුරකට සම්බන්ධ බව මහාචාර්ය සෙනරත් පරණවිතාන ශූරීන් පෙන්වා දී තිබේ. ක්‍රිස්තු වර්ෂ 139 දී පස්වන පරාක්‍රමබාහු රජතුමාගෙන් පසු රාජ්‍යත්වයට පත් වූයේ තුන්වන වික්‍රමබාහු රජතුමාය."
    },
    {
      "නම": "IIIවන වික්‍රමබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1357  - 1374",
      "විවාහයන්": "හෙණ කඳ බිසෝ බණ්ඩාර",
      "මරණය": 1374,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "ගම්පොළ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "Vවන පරාක්‍රමබාහු",
      "අනුප්‍රාප්තිකයා": "පස්වන බුවනෙකබාහු රජ",
      "විස්තර": "පැරණි ගම්පොල රාජධානියේ රජකල රජෙකි. හෙණ කඳ බිසෝ බණ්ඩාර නමින් දේවත්‍වෙයන් සලකන්නේ මොහුගේ අග බිසව බව සැලකේ."
    },
    {
      "නම": "පස්වන බුවනෙකබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1397 - 1409",
      "විවාහයන්": null,
      "මරණය": 1409,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "ගම්පොළ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IIIවන වික්‍රමබාහු",
      "අනුප්‍රාප්තිකයා": "IIවන වීරබාහු",
      "විස්තර": "තුන්වන වික්‍රමබාහු රජතුමාගෙන් පසු ගම්පොල රජ වූයේ පස්වන බුවනෙකබාහු රජු ය. ක්‍රිස්තු වර්ෂ 1372 සිට 1408 දක්වා කාලය මෙතුමාගේ රාජ්‍ය කාලය වශයෙන් සැලකේ.මේ කාලයේදී නැවතත් ආර්ය චක්‍රවර්ති ගොඩින් හා මුහුදින් සිංහල රාජ්‍යයට පහර දුන්නත් අලගක්කෝනාර ගේ ශූර මෙහෙයවීමෙන් ඒ හමුදාංක දෙකම පරාජයට පත් කරනු ලැබීය. මේ රජු ක්‍රිස්තු වර්ෂ 1396 දී පමණ තම රාජධානිය කෝට්ටේ ට ගෙන ගිය අතර කොට්ටේ පුරවරය සැලසුම් සහගත ව ඉඳි කරන ලද්දේ නිශ්ශංක අලගක්කෝනාර විසිනි. මේ රජුගෙන් පසු ක්‍රිස්තු වර්ෂ 1412 දී බලයට පැමිණියේ හයවන පරාක්‍රමබාහු රජතුමා ය. ක්‍රිස්තු වර්ෂ 1408 සිට 1412 දක්වා කාලය අනුමාන කිරීමට සිදු ව ඇත."
    },
    {
      "නම": "අලගක්කෝනාර",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1372 -1392",
      "විවාහයන්": null,
      "මරණය": 1392,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "ගම්පොළ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IIවන වීරබාහුගේ පුත්‍රයෙක්",
      "අනුප්‍රාප්තිකයා": "පරාක්‍රමබාහු ඈපා",
      "විස්තර": "අලගක්කෝනාර නැතහොත් අලකේශ්වර යනු 3 වන වික්‍රමබාහුගේ රජුගේ කාලයේ (1357-1374 ) ශ්‍රී ලංකාවේ සිටි සේනාධිනායකයෙකි. සමහර විද්වතුන්ගේ මතය වන්නේ ඔහුගේ පවුලට මලයාලම් සමිභවයක් ඇති බවයි , සමහරෙක් ඔවුන්ගේ ආරමිභය ඉන්දියාවේ තමිල්නාඩු වල කාංචිපුර යයි පවසති. 13 වන සියවසේ පමණ ශ්‍රී ලංකාවට පැමිණි ඔවුන්,ශ්‍රී ලංකාවට අනුව හැඩගැසුණි. එම පවුලේ එක් සාමාජිකයෙක් ශ්‍රී ලංකාවේ වර්තමාන අගනුවර වන ශ්‍රී ජයවර්ධනපුර කෝට්ටේ ආරමිභයට මූලික විය. එකල ශ්‍රී ජයවර්ධනපුර කෝට්ටේ හා රයිගම බලකොටු , යාපන රාජධානියෙහි ආර්ය චක්‍රවර්ති ගේ ආක්‍රමණයන්ට එරෙහි ව භාවිතා කරන ලදි. ක්‍රි: ව 1411 දි චින අද්මිරාල් ෂැන් හේ විසින් අලගක්කෝනාර පවුලේ නායක වු වීර අලකේශ්වර ඔවුන්ගේ සිර භාරයට ගත් පසු එම පවුලේ බලය බෙහෙවින් පිරිහුණි. එම පවුලේ ශ්‍රී ලංකාවට පැමිණි මුල්ම සාමාජිකයා නිශ්ශංක අලගක්කෝනාර නම් විය. ඔහු ඉන්දියාවේ වාංචිපුර හෝ කාංචිපුර සිට පැමිණියේය. එකල ඔහුගේ මව්බිම මුස්ලිම් ආක්‍රමණ වලට ලක්වී තිබුණි. ප්‍රධාන වශයෙන් වෙළදාමට හිත යොමු කල අලගක්කෝනාරවරු එයින් ධනවතුන් බට පත් විය. අවසානයේදි 14 වන සියවසේ ගම්පොළ රාජධානියේ ප්‍රමුඛ දේශපාලන බලයක් ඇති වුවන් බවට පත් විමට ඔවුනට හැකියාව ලැබිණ. මෙයට ඔවුන් බෞද්ධයන් බවට පත්වීමද මහඟු පිටුවහලක් විය. රයිගම් කෝරළ ජනප්‍රවාද අනුව ඇත්තේ මීට වඩා වෙනස් අදහසකි. දුරාතයේ පටන් පැවති රවි ශෛලාෂ හෙවත් ඉරුගල් පරපුරේ හිරුගොත් හෙවත් සූරාය ගුප්ත කුමරුත් දේවානම් පියතිස්ස රජුගේ දියැණිය මයුරවතී දේවියත් එක්ව සෑදුනු වංශය ගිරි වංශය නමින් හැදින්විය. මෙම ගිරි වංශයේ කීර්තිමත් භික්ප්‍ෂූන්ර වහන්සේලා, පාලකයින්, ප්‍රභූන්, සාහිත්‍යධරයන් බිහිවිය. රදළ ග්‍රාම හෙවත් රයිගම ඔවුන්ගේ ජන්ම ප්‍රවිනිය විය. මහා පරාකුමබාහු රජ සමයේ වංචි පුරයෙන් පැමිනෙන ප්‍රභූවරයෙක් මෙම ගිරි වංශයෙන් විවාහ ප්‍රප්ථිව රයිගම් පුරය වාසභූමි කර ගනී. ඔහුට ලැබෙන ගෞරව නාමයක් වන්නේ අලකේෂ්වර අභිදානයයි. ඉන් අනතුරුව ගිරි වංශයේ පුතුන් හා බෑණා වරුන් අලකේෂ්වර විරුදය භාවිතා කර ඇති බව පෙනේ."
    },
    {
      "නම": "හයවන පරාක්‍රමබාහු රජු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1415-1467",
      "විවාහයන්": "ස්වර්ණ මාණික්‍යා කුමරිය",
      "මරණය": 1467,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "කෝට්ටේ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පස්වන භුවෙනෙකබාහු රජ",
      "අනුප්‍රාප්තිකයා": "දෙවන ජයබාහු රජ",
      "විස්තර": "කෝට්ටේ යුගය ආලෝකමත් කළ ශ්‍රේෂ්ඨතම පාලකයා වූයේ පස්වන බුවනෙකබාහු රජතුමාගෙන් පසු බලයට පත් වූ හයවන පරාක්‍රමබාහු රජු ය. ක්‍රිස්තු වර්ෂ 1415 සිට ක්‍රිස්තු වර්ෂ 1467 දක්වා වසර 53ක් රජ කළ මේ රජතුමා මුළු ලංකාවම එක්සේසත් කළ පාලකයෙක් විය. මේ රජු අභිෂේකයෙන් වසර 3කට පසු තම අගනුවර කෝට්ටේ ට ගෙන ගියේය. කෝට්ටේ නගරය අංග සම්පූර්ණ නගරයක් බවට අත් වූයේ මේ කාලයේ ය. මේ කාලය ලංකා ඉතිහාසයේ අවසාන විභූතිමත් කාලය ලෙස සැලකේ. මේ රජු සමයේ සිදු වූ වැදගත් සිදුවීම් අතර යාපනය හා වන්නි ප්‍රදේශ ඈඳා ගැනීම, මලය රටෙහි හට ගත් කැරැල්ලක් මැඬලීම, වන්නි ප්‍රදේශවල ස්වාධීන ව නැඟී ආ නායකයින් අවනත කර ගැනීම, යාපනයේ පාලකයා ලෙස සපුමල් කුමරු පත් කිරීම, විජයනගර් අධිරාජ්‍යයේ තොටුපොළක් ආක්‍රමණය කිරීම, ක්‍රිස්තු වර්ෂ 1462 දී ජෝතිය සිටානන් ඇති කළ කැරැල්ලක් මැඬලීමට අම්බුළුගල කුමරු යැවීම හා වෙළඳ ගනුදෙනුවක් මුල් කරගෙන දකුණු ඉන්දියාවේ අදිවිරරාම පටුන ආක්‍රමණය කිරීම ද වෙයි. ක්‍රිස්තු වර්ෂ 1467 දී මේ රජතුමා මිය ගිය විට එතුමාගේ දියණියගේ පුතා වූ ජයබාහු කුමරා දෙවන ජයබාහු රජ නමින් බලයට පත් විය."
    },
    {
      "නම": "දෙවන ජයබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1472 - 1480",
      "විවාහයන්": null,
      "මරණය": 1480,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "කෝට්ටේ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "හයවන පරාක්‍රමබාහු රජු",
      "අනුප්‍රාප්තිකයා": "VIවන බුවනෙකබාහු",
      "විස්තර": "ක්‍රිස්තු වර්ෂ 1467 දී හයවන පරාක්‍රමබාහු රජතුමා මිය ගිය විට එතුමාගේ දියණියගේ පුතා වන ජයබාහු කුමරු දෙවන ජයබාහු නමින් කෝට්ටේ රජකමට පත් විය. තමාට රජකම නොලැබීම නිසා කෝපයට පත්, යාපනයේ පාලකයා වූ සපුමල් කුමරු කෝට්ටේට පැමිණ දෙවන ජයබාහු රජු මරා ක්‍රිස්තු වර්ෂ 1469 දී හයවන බුවනෙකබාහු රජ නමින් කෝට්ටේ බලයට පත් විය."
    },
    {
      "නම": "VIවන බුවනෙකබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1467 - 1473",
      "විවාහයන්": null,
      "මරණය": 1473,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "කෝට්ටේ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "දෙවන ජයබාහු රජ",
      "අනුප්‍රාප්තිකයා": "VIIවන පරාක්‍රමබාහු",
      "විස්තර": "හයවන පරාක්‍රමබාහු රජ විසින් සපුමල් කුමරු යාපනයේ පාලකයා ලෙස පත් කර යැවීය. ඒ රජුගේ මරණින් පසු ඔහුගේ මුණුපුරා වූ ජයබාහු කුමරු දෙවන ජයබාහු රජ නමින් බලයට පත් වීම නොරිස්සූ සපුමල් කුමරු නැවත් කෝට්ටේට පැමිණ ජයබාහු මරා හයවන බුවනෙකබාහු නමින් රජකමට පත් විය. ජයබාහු රජුගේ ඝාතනය ගැන කුපිත වූ කළු ගඟ හා වළවේ ගඟ අසළ ප්‍රඩේශයේ ජනතාව හයවන බුවනෙකබාහු රජුට විරුද්ධව කැරලි ගැසූහ. සපුමල් කුමරු හෙවත් හයවන බුවනෙකබාහු රජු තම සහෝදරයා වන අම්බුළුගල කුමරු මෙම කැරැල්ල මැඬ පැවැත්වීමට යැවූව ද ඔහුට එම කැරැල්ල මැඬ පැවැත්වීමට වසර 4ක් ගත් විය. මේ කාලයේ ගම්පොළ පාලකයා වූයේ සේනාසම්මත වික්‍රමබාහු ය. ඔහු තමන්ගේ අගනුවර ගම්පොළින් පේරාදෙණියටත් එතැනින් මහනුවරටත් මාරු කළේය. හයවන බුවනෙකබාහු රජුගෙන් පසු ඔහුගෙ පුත් හත්වන පරාක්‍රමබාහු රජ නමින් බලයට පත් විය."
    },
    {
      "නම": "VIIවන පරාක්‍රමබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1480 - 1484",
      "විවාහයන්": null,
      "මරණය": 1484,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "කෝට්ටේ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "VIවන බුවනෙකබාහු",
      "අනුප්‍රාප්තිකයා": "VIIIවන පරාක්‍රමබාහු",
      "විස්තර": "හයවන බුවනෙකබාහු රජතුමාගෙන් පසු බලයට පැමිණියේ ඔහු පුත් හත්වන පරාක්‍රමබාහු ය. ක්‍රිස්තු වර්ෂ 1480 සිට 1484 දක්වා ඔහු රාජ්‍යත්වයේ සිටියේය."
    },
    {
      "නම": "VIIIවන පරාක්‍රමබාහු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1484 - 1518",
      "විවාහයන්": null,
      "මරණය": 1518,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "කෝට්ටේ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "VIIවන පරාක්‍රමබාහු",
      "අනුප්‍රාප්තිකයා": "IXවන ධර්ම පරාක්‍රමබාහු",
      "විස්තර": "අම්බුළුගල කුමරු කෝට්ටේට පැමිණ හත්වන පරාක්‍රමබාහු රජ මරා දමා අටවන වීර පරාක්‍රමබාහු නමින් කෝට්ටේ රජ විය. පෙළ පොතෙහි මෙම වර්ෂය ක්‍රිස්තු වර්ෂ 1490 ලෙස සඳහන් වෙතත් ඉන්ද්‍රකීර්ති සිරිවීර විද්වතාණන් ලියූ රජරට ශිෂ්ඨාචාරය හා නිරිතදිග රාජධානි නම් පොතෙහි සඳහන් වන්නේ මෙම වර්ෂය ක්‍රිස්තු වර්ෂ 1484 බවයි."
    },
    {
      "නම": "සත්වන විජයබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1513–1521",
      "විවාහයන්": "අනුලා කහතුඩ, කිරිවැල්ලේ බිසෝ බණ්ඩාර",
      "මරණය": 1521,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "කෝට්ටේ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IXවන ධර්ම පරාක්‍රමබාහු",
      "අනුප්‍රාප්තිකයා": "සත්වන බුවනෙකබාහු රජ",
      "විස්තර": "සත්වන විජයබාහු රජ යනු, කෝට්ටේ ප්‍රතිස්ථාපිත කල සයවන පරාක්‍රමබාහු රජ විසින් හදාගත් දරුවකු වන අටවන වීර පරක්‍රමබාහු රජගේ පුත්‍රයාය. ඔහු උපන්නේ 1445 දී පමණ වන අතර ඔහුගේ සහෝදරයන් වන ශ්‍රී රාජසිංහ, නවවන ධර්ම පරාක්‍රමබාහු රජ, සහ රයිගම් බණ්ඩාර යන්නන් සමග ඇතිදැඩි විය. මනම්පේරි ආරච්චි වෙත විවාහපත්ව සිටි සහෝදරියක්ද ඔහුට සිටියේය. ඔහුගේ වැඩිමහළු සොහොයුරු නවවන ධර්ම පරාක්‍රමබාහු රජුගේ මරණයෙන් පසු, කෝට්ටේ ජනතාවට අවශ්‍ය වූයේ ඔහුගේ අඩ සොහොයුරු, සකලකලා වල්ලභ, රජු බවට පත් වීමටය. ඒ වන විට ඔහු උඩුගම්පොල උපරාජ විය. කෙසේවෙතත්, සිංහල රජුන් පිළිබඳ කතාන්තරයක් වන රාජාවලිය අනුව, ඔහුගේ අඩ සොහොයුරු සකලකල වල්ල විසින් විජයබාහු වෙත කිරුළ පැළඳුවේ සත්වන විජයබාහු ලෙසිනි. මොහු සිංහාසනාරූඪ වූයේ ක්‍රි.ව. 1513 දීය."
    },
    {
      "නම": "සත්වන බුවනෙකබාහු රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1521-1550",
      "විවාහයන්": null,
      "මරණය": 1551,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "කෝට්ටේ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "සත්වන විජයබාහු රජ",
      "අනුප්‍රාප්තිකයා": "දොන් ජුවන් ධර්මපාල රජ",
      "විස්තර": "හත්වන බුවනෙකබාහු කෝට්ටේ රජු වූ සත්වන විජයබාහු රජුගේ හා ඔහුගෙ අග බිසවගේ වැඩිමහල් දරුවා විය.  1468දී උපන් ඔහුගේ සොහොයුරන් වූයේ මායාදුන්නේ හා රයිගම බණ්ඩාර ය. ඔහුගේ පියගේ දෙවන විවාහයේ නව බිසව, දේව රාජසිංහ නම් වෙනත් අයෙකුගෙ පුතෙකු ද රැගෙන ආ අතර රජු ඔහුට තමාගෙන් පසු රජකම ලබා දීමට අදහස් කළ බැවින් බුවනෙකබාහු හා ඔහුගේ සොයුරන් දෙදෙනා රාජධානිය අත්හැර පලා යාමට පෙළඹුනු අතර ඔවුන් නැවත පැමිණියේ උඩරට රාජධානියෙන් ලැබුණු හමුදාවක් ද සමගිනි. එම පවුලේ ශ්‍රී ලංකාවට පැමිණි මුල්ම සාමාජිකයා නිශ්ශංක අලගක්කෝනාර නම් විය. ඔහු ඉන්දියාවේ වාංචිපුර හෝ කාංචිපුර සිට පැමිණියේය. එකල ඔහුගේ මව්බිම මුස්ලිම් ආක්‍රමණ වලට ලක්වී තිබුණි. ප්‍රධාන වශයෙන් වෙළදාමට හිත යොමු කල අලගක්කෝනාරවරු එයින් ධනවතුන් බට පත් විය. අවසානයේදි 14 වන සියවසේ ගම්පොළ රාජධානියේ ප්‍රමුඛ දේශපාලන බලයක් ඇති වුවන් බවට පත් විමට ඔවුනට හැකියාව ලැබිණ. මෙයට ඔවුන් බෞද්ධයන් බවට පත්වීමද මහඟු පිටුවහලක් විය. රයිගම් කෝරළ ජනප්‍රවාද අනුව ඇත්තේ මීට වඩා වෙනස් අදහසකි. දුරාතයේ පටන් පැවති රවි ශෛලාෂ හෙවත් ඉරුගල් පරපුරේ හිරුගොත් හෙවත් සූරාය ගුප්ත කුමරුත් දේවානම් පියතිස්ස රජුගේ දියැණිය මයුරවතී දේවියත් එක්ව සෑදුනු වංශය ගිරි වංශය නමින් හැදින්විය. මෙම ගිරි වංශයේ කීර්තිමත් භික්ප්‍ෂූන්ර වහන්සේලා, පාලකයින්, ප්‍රභූන්, සාහිත්‍යධරයන් බිහිවිය. රදළ ග්‍රාම හෙවත් රයිගම ඔවුන්ගේ ජන්ම ප්‍රවිනිය විය. මහා පරාකුමබාහු රජ සමයේ වංචි පුරයෙන් පැමිනෙන ප්‍රභූවරයෙක් මෙම ගිරි වංශයෙන් විවාහ ප්‍රප්ථිව රයිගම් පුරය වාසභූමි කර ගනී. ඔහුට ලැබෙන ගෞරව නාමයක් වන්නේ අලකේෂ්වර අභිදානයයි. ඉන් අනතුරුව ගිරි වංශයේ පුතුන් හා බෑණා වරුන් අලකේෂ්වර විරුදය භාවිතා කර ඇති බව පෙනේ."
    },
    {
      "නම": "දොන් ජුවන් ධර්මපාල රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1551 - 1597",
      "විවාහයන්": null,
      "මරණය": 1597,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "කෝට්ටේ රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "සත්වන බුවනෙකබාහු රජ",
      "අනුප්‍රාප්තිකයා": "පළමුවන ෆිලිප් රජ",
      "විස්තර": "දොන් ජුවන් ධර්මපාල ශ්‍රී ලංකාව පාලනය කළ රජ කෙනෙකි. ඒ වසර 1551 සිට 1597 මැයි 27 දක්වාය. ඔහු හත්වන බුවනෙකබාහු රජ තුමාගේ මුණුපුරා ද වීදිය බංඩාරගේ හා සමුද්‍රදේවියගේ පුත්‍රයා ද වේ. බුවනෙකබාහු රජුගේ මරණින් පසුව ධර්මපාල කුමාරයා රාජාභිෂේක ලැබීය. ඔහු ශ්‍රී ලංකාවේ පළමු කතෝලික රජු විය.ඉතා දුර්වල පාලකයෙකු වූ මෙතුමා කෝට්ටේ රාජධානිය පෘතුගීසීන්ට තෑගි ඔප්පුවක් මගින් පවරදුන්හ මෙතුමා ඉතා ලබාල අවදියේදී පෟතුගීසින්ගේ වුවමනාවට සිහසුනට පත්වුවෙකු විය එක් අතකට මෙතුමා ලංකාවේ සිටි අවාසනාවන්තම රජු ලෙස සැලකිය හැක සිංහල ඉතිහාසය තුල සිහසුනට පත්වූ එකම කතෝලික සිංහල රජු ඔහුවිය මෙතුමා කෙතාලික දහම වැලදගෙන භෞතිස්ම ලැබූවක් විය කෙසේ වෙතත් මෙතුමාට වැඩිකලක් සිහසුන හෙබවීමට නොහැකිවිය කතොලික රජකු වීම නිසාත් දුර්වල පාලනය නිසාත් මහජන ප්‍රසාදය ලබාගැනීමට නොහැකිවිය සිහසුන හැරදමා පෘතුගීසි ආරක්ෂාව යටතේ කොළඹ පිහිටි බලකොටුවේ සිටියදී මිය ගියහ"
    },
    {
      "නම": "මායාදුන්නේ රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1501–1581",
      "විවාහයන්": null,
      "මරණය": 1581,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "සීතාවක රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "දොන් ජුවන් ධර්මපාල රජ",
      "අනුප්‍රාප්තිකයා": "පළමුවන රාජසිංහ රජ",
      "විස්තර": "මායාදුන්නේ රජ (1501–1581) සීතාවක රාජධානියේ, 1521 සිට 1581 දක්වා වසර 60 ක කාලයක් රජකම් කළේය. මායාදුන්නේ 1505 දී මෙරටට පැමිණි පෘතුගීසි ජාතිකයන්ගේ සැඩපරුෂ සතුරෙක් විය. ඔහු තම ජීවිතයම කැපකරන ලද්දේ තම සොයුරු බුවනෙකබාහු, හෙවත් කෝට්ටේ රාජධානියේ රජ බලයෙන් පහ කර එයින් පෘතුගීසි කුමන්ත්‍රණ නිසා පීඩාවට පත්ව තිබූ ශ්‍රී ලංකාවේ නිදහස රැකගැනීමට ය. ඔහු නිතර තම සොයුරා වූ බුවනෙකබාහුගේ රාජ්‍යයට ආක්‍රමණ එල්ල කරන ලදී. මායාදුන්නේ උපත ලද්දේ 1501 දී කෝට්ටේ රාජධානියේ පිහිටි කෝට්ටේ නගරයේ දී ය. ඔහු 1509 සිට 1521 තෙක් කෝට්ටේ රජ කළ සත්වන විජයබාහුගේ පුත්‍රයාය. මායාදුන්නේ සත්වන විජයබාහුගේ හා ඔහුගේ අග බිසවගේ වැඩිමහල් පුතු විය. බුවනෙකබාහු හා රයිගම බණ්ඩාර ඔහුගේ සොයුරන් විය. බුවනෙකබාහු 1521 සිට 1551 දක්වා කෝට්ටේ රාජධානියේ රජකම් කළේය. විජයබා කොල්ලය යනු 1521 දී සිදුවූ ඓතිහාසික සිද්ධියක් වන අතර එහිදී කෝට්ටේ රජුගේ (සත්වන විජයබාහු රජ) පුතුන් තිදෙන ඔවුන්ගේ පිය රජුට එරෙහිව කැරලි ගසමින් තම පියා මරා දමා රාජධානිය තමන් අතරෙහි බෙදා ගත්හ. සත්වන විජයබාහු රජ හට ඔහුගේ පළමු විවාහයෙන් පුතුන් තිදෙනෙකු වූ අතර ඔවුහූ බුවනෙකබාහු (පසුව කෝට්ටේ හත්වන බුවනෙකබාහු රජ ), පරරාජසිංහ (පසුව රයිගම බණ්ඩාර) සහ මායාදුන්නේ (පසුව සීතාවක මායාදුන්නේ රජ) නම් වූහ. රජු දෙවන වරට විවාපත් වූ කිරිවැල්ලේ බිසව හට, ඇයගේ පළමු විවාහයෙන් දේවරාජා නම් පුතකු විය. ඔහුගේ දෙවන බිසවගේ ඉල්ලීම ප්‍රකාර, ඔටුන්න හිමි කුමරු බවට දේවරාජා නම් කෙරුමට පිය රජු විසින් තීරණය කර ඇති බව දැනගත් කුමරුවන් රජුට එදිරි වූහ. කුලියට ගත් විදේශිකයෙකු ලවා රජු මාලිගාව තුලදීම ඝාතනය කරවන ලදි. මෙම සිදුවීම හැඳින්වෙන්නේ විජයබා කොල්ලය යනුවෙනි."
    },
    {
      "නම": "පළමුවන රාජසිංහ රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1593–1593",
      "විවාහයන්": null,
      "මරණය": 1593,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "සීතාවක රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "මායාදුන්නේ රජ",
      "අනුප්‍රාප්තිකයා": "රාජසුරිය රජු",
      "විස්තර": "පළමුවන රාජසිංහ රජතුමා සීතාවක රාජධානියේ රජතුමෙකි. එතුමාගේ මහත් එඩිතර බව හා දේශප්‍රේමීත්වය පිළිබඳව ඉතිහාසයේ සඳහන් වේ. සීතාවක රාජධානියේ මායාදුන්නේ රජතුමාට දාව ටිකිරි බණ්ඩාර නමින් උපත ලැබූ මෙතුමාට පෘතුගීසි හමුදා සමඟ සිදු කළ බිහිසුණු සටන් වලින් පසුව රාජසිංහ යන නාමය ලැබිණි. එහි සිංහයන්ගේ රජු හෝ රාජකීය සිංහයා යන තේරුම ඇත. සාමාන්‍යයෙන් මෙතුමා 1581 සිට 1592 දක්වා රජකම් කළ බවට වාර්තා වේ. නමුත් ද ක්වේරෝස්ට අනුව මායාදුන්නේ රජතුමා විසින් 1578 දී තම රාජධානිය රාජසිංහ රජතුමාට පවරන ලදී. 1581 දී මායාදුන්නේ රජතුමා මරණයට පත් විය. ඉන් පසු රාජසිංහ රජතුමා සිංහාසනයට පත් විය. තම පියා වන මායාදුන්නේ රජතුමාගේ මරණය සමඟ රාජසිංහ රජතුමාගේ සම්බන්ධයක් ඇති බවට එකිනෙකට පරස්පර තොරතුරු විවිධ මූලාශ්‍රවල ඇත. කීර්ති ශ්‍රී රාජසිංහ රාජ සමයේදී තිබ්බොටුවාවේ බුද්ධරක්ඛිත ස්ථවිරයන් වහන්සේ විසින් ලියන ලද මහාවංසයේ 4වන පරිච්ඡේදයේ දී රාජසිංහ රජු විසින් මායාදුන්නේ පියරජුව ඝාතනය කළ බව සඳහන් වෙයි. චූල රාජාවලිය ද රජුගේ පීතෘ ඝාතනය ආනන්තරීය පාප කර්මයක් ලෙස බෞද්ධ භික්ෂූන් වහන්සේලා විසින් සැලකීම නිසා රජු සහ භික්ෂූන් වහන්සේ අතර ගැටුම් හට ගත බවත් එහි ප්‍රතිඵලයක් ලෙස රජු බෞද්ධ විරෝධී පිළිවෙතක් අනුගමනය කළ බවත් සඳහන් කරයි. කෙසේ නමුත් ඉතිහාස විචාරකයන් විශ්වාස කරන්නේ රාජාවලිය හා අලකේශ්වර යුද්ධය වැනි වැදගත් මූලාශ්‍රවල මෙම පීතෘ ඝාතන සිද්ධිය සඳහන් නො වීම නිසා රජු විසින් තම පියරජුව ඝාතනය කිරීම සැක සහිත සහ මතභේදාත්මක කරුණක් බවයි. රෙබෙයිරෝ පවා රජුගේ පීතෘ ඝාතනයක් ගැන වාර්තා කර නැත. සෙංකඩගල රාජධානියට පැමිණි ලන්දේසී දූතයකු වන ස්පිල්බර්ජන් විසින් කන්ද උඩරට රාජධානියේ පමණක් රාජසිංහ රජුගේ පීතෘ ඝාතනයක් පිළිබඳ කට කතාවක් පැතිර යමින් තිබූ බව වාර්තා කර ඇත. ක්වේරෝස් යනු සීතාවක රාජසිංහ රජු කෙරෙහි නුරුස්නා ගතියක් තිබූ අයෙකු බව බොහෝ ඉතිහාසඥයන් දන්නා කරුණකි. මේ අනුව රාජසිංහ රජු පීතෘ ඝාතනයක් කළේ නම් ක්වේරෝස් විසින් අනිවාර්යයෙන්ම එය වාර්තා කරනු ඇත. ක්වෙරෝස්ගේ දීර්ඝ විස්තරය අනුව මායාදුන්නේ පියරජු මරණයට පත් වී ඇත්තේ 85වැනි වියේදී ස්වභාවික හේතුවකින් ය. ක්වෙරෝස්ට අනුව රාජසිංහ රජතුමා තම පිය රජුගේ අභාවය දැනගත් විට චිරප්‍රසිද්ධ කොළඹ කොටුව වටලා සිටි අතර තුර ආපසු සීතාවක බලා පැමිණ ඇත."
    },
    {
      "නම": "රාජසුරිය රජු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1581–1594",
      "විවාහයන්": null,
      "මරණය": 1594,
      "රාජවංශය/පක්ෂය": "සිරි සඟ බෝ රාජවංශය",
      "රාජධානිය/අගනගරය": "සීතාවක රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පළමුවන රාජසිංහ රජ",
      "අනුප්‍රාප්තිකයා": "හා බිසෝ බණ්ඩාර",
      "විස්තර": "සීතාවක රාජධානියයේ රජෙකු වන රාජසුරිය රජු පළමුවන රාජසිංහ රජගේ මුණුබුරෙකි.ඔහු 1593 රජ වන්නේ මහා බිසෝ බණ්ඩාර දේවිය ගේ උපකාරයේනි.නමුත් I රාජසිංහ රජුට හිතවත්ව සිටි අරිට්ඨ කී වෙණ්ඩු පෙරුමාල් කුමන්ත්‍රණ කොට ඔහු මරා දැමිය."
    },
    {
      "නම": "පළමුවන විමලධර්මසූරිය රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1591-1604",
      "විවාහයන්": "කුසුමාසන දේවිය",
      "මරණය": 1604,
      "රාජවංශය/පක්ෂය": "දිනරාජ රාජවංශය",
      "රාජධානිය/අගනගරය": "මහනුවර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පළමුවන රාජසිංහ රජු",
      "අනුප්‍රාප්තිකයා": "සෙනරත් රජු",
      "විස්තර": "උපතින් කොනප්පු බණ්ඩාර ලෙස හැඳින්වුනු මෙතුමාගේ පියා පළමුවැනි රාජසිංහ රජුගේ රාජ්‍යයට එරෙහිව කැරලි ගැසුවේ යැයි සැකයට ලක්වී බොරුවලකට වට්ටවා මරවනු ලැබීය. ඉන්පසු ආරක්ෂාව පතා පෘතුගීසීන් වෙත ගොස් කතෝලික දහමද වැළඳගෙන දොන් ජෝන් (දොන් ජෝන් ඔෆ් ඔස්ට්‍රියා) නමින් බෞතීස්ම ලබා සිටියේය. උඩරට යටත් කරගෙන සීතාවක සිට රජකම් කළ පළමුවන රාජසිංහ රජු පරාජය කිරීමට දොන් පිලිප් (යමසිංහ බණ්ඩාර) නම් රජකමට උරුමකම් කියන කුමාරයෙක් සමඟ පෘතුගීසීන්ට උදව් කළේය. නමුත් පෘතුගීසින් රජකමට පත්කළේ ඔහුව නොව දොන් පිලිප් නම් කුමාරයාවය. මීට එරෙහි වූ දොන් ජෝන් පෘතුගීසින් ඉවත්ව යනතෙක් සිට දොන් පිලිප් ට වස දී මරා දැමීය. පෘතුගීසින්ට තර්ජනය කොට මහනුවරින් එළවා දැමුවේ යැයි කියවේ. ඉන්පසු ප්‍රසිද්ධියේම කතෝලික දහම අතහැර බුදු දහම වැළඳ ගත්තේය. පළමුවන විමලධර්මසූරිය ලෙසින් සෙංකඩගල රජ විය."
    },
    {
      "නම": "සෙනරත් රජු",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1604-1635",
      "විවාහයන්": "කුසුමාසන දේවිය",
      "මරණය": 1635,
      "රාජවංශය/පක්ෂය": "දිනරාජ රාජවංශය",
      "රාජධානිය/අගනගරය": "මහනුවර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "පළමුවන විමලධර්මසූරිය රජ",
      "අනුප්‍රාප්තිකයා": "IIවන රාජසිංහ",
      "විස්තර": "සෙනරත් ( සෙනරත් අඳසින් ) රජු ක්‍රි. ව. 1604 සිට 1635 දක්වා මහනුවර අගනුවර කර ශ්‍රී ලංකාවේ පාලනය ගෙන යන ලදී. එතුමා පළමුවන විමලධර්මසූරිය රජුගේ සහෝදරයයි ."
    },
    {
      "නම": "IIවන රාජසිංහ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1634 -1686",
      "විවාහයන්": null,
      "මරණය": 1687,
      "රාජවංශය/පක්ෂය": "දිනරාජ රාජවංශය",
      "රාජධානිය/අගනගරය": "මහනුවර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "සෙනරත් රජු",
      "අනුප්‍රාප්තිකයා": "IIවන විමලධර්මසූරිය",
      "විස්තර": "දෙවැනි රාජසිංහ (අභිෂේකයට පෙර මහා අස්ථාන කුමරු) රජු (ක්‍රි:ව 1634 -1686 දක්වා පාලනය කළ) සිංහල රජෙකි. ඔහු ශ්‍රී ලංකාවේ කන්ද උඩරට රාජධානියේ තෙවැනි සිංහල රජුය. රාජසිංහ රජු පෘතුග්‍රීසීන් ලංකාවෙන් පළවා හැරීමට ලන්දේසීන්ගේ උදව් පැතුවේය. ඔව්හු 1656 දී එය ඉතා සාර්ථකව ඉටු කළහ. එහෙත් ඒ වන විට ලන්දේසීන්ගේ පරමාර්ථය වී තිබුණේ පෘතුග්‍රීසීන් ලංකාවෙන් පළවා හැරීම පමණක් නොව දිවයිනෙහි ප්‍රධාන යටත් විජිත බලවතා වීම බව උඩුරැටියනට ඒ වන විට පැහැදිළි වී තිබුණි. රාජසිංහ 1645 සිට තම කලින් සතුරු කණ්ඩාම් සමග විටින් විට සටන්වල නිරත වෙමින් සිටියේය. මහා අස්ථාන කුමරු සෙනරත් රජුගේ සහ කුසුමාසන දේවිය ගේ පුතාය. සිංහලේ අගනුවර සෙංකඩගල කරගත් දෙවැනි පාලකයා වූයේ සෙනරත්ය. පෘතුග්‍රීසීන් දිවයිනේ මුහුදු බඩ වූ බොහෝ ප්‍රදේශ ඔවුනගේ පාලනයට නතු කරගත් හෙයින් දිවයිනෙහි එකම තනි ස්වාධීන ස්වදේශීය රාජ්‍යය බවට කන්ද උඩරට පත්විය. නිතර නිතර සිදු වූ සටන් නිසා උඩරැටියන් පෘතුග්‍රීසීන් කෙරෙහි තද කළකිරීමෙන් පසුවූහ. ශත වර්ෂයකට පමණ කලින් රණකාමී සීතාවක රාජ්‍යය ලබාගත් කෙටිකාලීන ජයග්‍රහණය නිසා යටත් විජිත පාලකයින් පළවා හැරීම කළහැකි දෙයක් බව රාජධානියෙහි බො‍හෝ දෙනෙක් ඒත්තු ගත්හ. ඉතා ළාබාල අවධියේදී කන්ද උඩරට ‍රාජධානියට 1612 දී එල්ල වූ පෘතුග්‍රීසී ආක්‍රමණයේදී රාජසිංහ රජු ප්‍රතිප්‍රහාර එල්ලකිරීම සඳහා සහාය විය. රාජසිංහ රජු පිය රජුගෙන් පසු 1634 දී කිරුළ හිමිවිය. (සමහරක් මූලාශ්‍රවල වර්ෂය 1629 ලෙසද සඳහන් වේ)"
    },
    {
      "නම": "IIවන විමලධර්මසූරිය",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1687 – 1707",
      "විවාහයන්": null,
      "මරණය": 1707,
      "රාජවංශය/පක්ෂය": "දිනරාජ රාජවංශය",
      "රාජධානිය/අගනගරය": "මහනුවර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IIවන රාජසිංහ",
      "අනුප්‍රාප්තිකයා": "ශ්‍රී වීර පරාක්‍රම නරේන්ද්‍රසිංහ රජ",
      "විස්තර": "IIවන රාජසිංහ රජ පුත් විය."
    },
    {
      "නම": "ශ්‍රී වීර පරාක්‍රම නරේන්ද්‍රසිංහ රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1707 - 1739",
      "විවාහයන්": "මදුරෙයි මනාලියන් දෙදෙනෙකු සහ මාතලේ මොණරවිල දිසාවේගේ දියණිය",
      "මරණය": 1739,
      "රාජවංශය/පක්ෂය": "දිනරාජ රාජවංශය",
      "රාජධානිය/අගනගරය": "මහනුවර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "IIවන විමලධර්මසූරිය",
      "අනුප්‍රාප්තිකයා": "ශ්‍රී විජය රාජසිංහ රජ",
      "විස්තර": "ශ්‍රී වීර පරාක්‍රම නරේන්ද්‍රසිංහ (වීර පරාක්‍රම නරේන්ද්‍රසිංහ) රජු සිංහල රාජ වංශයේ අන්තිම සිංහල රජුයි. එතුමා ක්‍රි.ව.1707 සිට 1739 දක්වා මහනුවර රාජධානියේ රාජ්‍යත්වයට පත් විය. එතුමා II වන විමලධර්මසූරිය රජුගේ පුත්‍රයායි. ශ්‍රී වීර පරාක්‍රම නරේන්ද්‍රසිංහ රජු වයස 17 දි සිහසුනට පත් වූ අතර වසර 32 රාජ්‍යය පාලනය කලේය. එතුමා උගත් මෙන්ම ශ්‍රද්ධාවන්ත රජ කෙනෙකු ලෙස සළකනු ලැබුවේය. පෙර රාජ්‍යත්වය දැරූවන් මෙන් එතුමාද ලන්දේසි ආක්‍රමණිකයන් සමග සමාදානයෙන් කටයුතු කලේය. එමෙන්ම එතුමා සාහිත්‍ය හා ආගමික චිරස්ථිතිය උදෙසා මහඟු කැපවිමක් කලේය. එතුමාගේ බිසව දකුණු ඉන්දියාවේ මදු‍රෙයි නගරයේ නායක්කර් රාජකීය පවුලේ කුමාරිකාවක් විය. රජුට සිහසුනට පත් කිරිම සදහා දරුවෙකු ලැබුණේ නැත. එම නිසා රජු ඔහුගේ අනුප්‍රාප්තිකයා ලෙස තම පළමු බිසවගේ සහෝදරයා නම් කළේය(ශ්‍රී විජය රාජසිංහ රජ), එමගින් සිංහලේ රාජාවලිය අවසන් වන තුරු.උඩරට පාලනය කරන ලද දුර්වලම පාලකයා මොහුය."
    },
    {
      "නම": "ශ්‍රී විජය රාජසිංහ රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1739 - 1747",
      "විවාහයන්": "මදුරෛ භාර්යාවන් 1",
      "මරණය": 1747,
      "රාජවංශය/පක්ෂය": "මහනුවර නායක්කර් රාජවංශය",
      "රාජධානිය/අගනගරය": "මහනුවර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "ශ්‍රී වීර පරාක්‍රම නරේන්ද්‍රසිංහ රජ",
      "අනුප්‍රාප්තිකයා": "කීර්ති ශ්‍රී රාජසිංහ රජ",
      "විස්තර": "නරේන්ද්‍ර සිංහ රජුගේ පළමු බිරිඳගේ සහෝදරයා නොහොත් රජුගේ මස්සිනා වූ ශ්‍රී විජය රාජසිංහ එම නමින්ම මහනුවර රාජධානියේ රජු ලෙස සිහසුනට පත් විය. ඔහු දකුණු ඉන්දියාවේ විජයනගර් පරම්පරාවෙන් පැවත එන්නෙකි. ඔහුගේ සම්භවය ද මදුරෙයි නගරයයි. නව රජු සැලකිය යුතු තරමේ ප්‍රබුද්ධයෙකු විය. හින්දු භක්තිකයෙකු වුවත් ජාතික ආගම වූ බුද්ධාගමේ උන්නතිය සඳහා සම්පූර්ණ අවධානය යොමු කළේය. ඔහු රටේ නොයෙක් ස්ථානවල ගල් ලෙන්වල බුදුන්ගේ සැතපෙන පිළිම, හිටි පිළිම, හා හිඳි පිළිම ජීවමාන ප්‍රමාණයට ගලින් නිම කිරීමට කටයුතු කළේය. එවකට මුහුදු බඩ ප්‍රදේශ පාලනය කරමින් සිටි ලන්දේසීන් සමග වෙළඳ කටයුතු මුල් කරගෙන සටන් කීපයක නියැලීමට රජුට සිදු විය. ශ්‍රී විජය රාජසිංහ පල්ලි විනාශ කළේය. ලන්දේසීන්ට හා පෘතුග්‍රීසීන්ට නොයෙක් වද හිංසා පැමිණ වූ අතර එම තත්වය කීර්ති ශ්‍රී යුගය දක්වා පැවතියේය. රටේ ව්‍යසනකාරී සිද්ධීන් කීපයක් ඇති වූ අතර එවැනි දෑ සිදු වන්නේ රජුගේ ක්‍රියා කලාපයන් නිසා යැයි රජු සිතුවේය. එයින් පසු පමණක් රජුගේ එම ක්‍රියා නැවතුණේය."
    },
    {
      "නම": "කීර්ති ශ්‍රී රාජසිංහ රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1747 - 1782",
      "විවාහයන්": "නාඩුකට්ටු සාමි නායක්කර්ගේ දියණිය, තවත් නායක්කර් කුමරියන් තිදෙනෙක් සහ යකඩ දෝලිය",
      "මරණය": 1782,
      "රාජවංශය/පක්ෂය": "මහනුවර නායක්කර් රාජවංශය",
      "රාජධානිය/අගනගරය": "මහනුවර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "ශ්‍රී විජය රාජසිංහ රජ",
      "අනුප්‍රාප්තිකයා": "ශ්‍රී රාජාධි රාජසිංහ රජ",
      "විස්තර": "කීර්ති ශ්‍රී රාජසිංහ යනු විජයරාජසිංහගේ බිරිඳගේ වැඩිමහල් සහෝදරයාය. ඔහු පැමිණියේ 'මදුරෙයි' නගරයෙනි. ඔහු සිහසුනට උරුමකම් ලැබූ තවත් මස්සිනා කෙනෙකු වූයේ එපරිද්දෙනි. එමෙන්ම ඔහු දකුණු ඉන්දීය රජ පෙළපතේ දෙවැන්නාය. කීර්ති ශ්‍රී රාජසිංහ ඔහුගේ මස්සිනාගෙන් පසු රජු බවට පත් වන විට සියුමැලි තරුණයෙකි. ඔහුට සිහසුනේ උරුමය ලැබුණේ 1751 වර්ෂයේදී ය. ඔහුගේ පාලන යුගයේ මුල් කාලය, කැප කළේ සාහිත්‍යය සහ ආගමික කටයුතුවල අභිවෘද්ධිය පිණිසයි. ලන්දේසීන්ගේ ද උදව් ලබාගෙන බුද්ධාගමේ දියුණුව සඳහා සියමෙන් (තායිලන්තයෙන්) භික්ෂූන් වහන්සේලා ගෙන්වා ගත්තේය. මහනුවර රජමහා විහාරය (ගංගාරාමය) තැනවූයේය. දන්ත ධාතුන් වහන්සේ උදෙසා දැනට දක්නට තිබෙන ඇතුළු විහාරයක් ද තනවා සිව්වැනි වික්‍රමබාහු රජුගේ සිට ඔහුගේ රාජ්‍ය කාලය දක්වා මහාවංශයේ විස්තරය සම්පූර්ණ කිරිමට ද කටයුතු යෙදුවේය."
    },
    {
      "නම": "ශ්‍රී රාජාධි රාජසිංහ රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1782-1798",
      "විවාහයන්": "උපේන්ද්‍රම්මා රැජින",
      "මරණය": 1798,
      "රාජවංශය/පක්ෂය": "මහනුවර නායක්කර් රාජවංශය",
      "රාජධානිය/අගනගරය": "මහනුවර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "කීර්ති ශ්‍රී රාජසිංහ රජ",
      "අනුප්‍රාප්තිකයා": "ශ්‍රී වික්‍රම රාජසිංහ රජ",
      "විස්තර": "ශ්‍රී රාජාධි රාජසිංහ (ක්‍රි.ව. 1782-1798) නමින් සිහසුනට උරුමකම් ලැබූ ඔහු කීර්ති ශ්‍රී රාජසිංහ රජුගේ සොහොයුරාය. ඔහුද තම සහෝදරයා සමග මදුරෙයි හි සිට මෙහි පැමිණියේ කුඩා ළමයෙකුව සිටියදීය. මේ හේතුව නිසාම ඔහු හැදී වැඩුනේ උඩරැටියෙකු පරිද්දෙනි. සිංහලයෙකු පරිද්දෙනි. එවකට මල්වතු විහාරයේ නායක හිමියන්ගේ දක්ෂතම ශිෂ්‍යයෙකු ලෙස කැපී පෙනුණේය. ඔහු විවිධ දක්ෂතාවලින් යුත් අයෙකු විය. භාෂා බොහොමයක් ඉගෙන ගත්තේය. පාලි සහ සංස්කෘත ද ඒ අතර විය. බුද්ධාගම සම්බන්ධයෙන් නොමසුරු දායකත්වයක් සැපයූ ඔහු කාව්‍ය රසිකයෙකු විය. එසේම කවියෙක් ද විය. 1798 දී දරුවෙකු නොමැතිව, අනුප්‍රාප්තිකයෙකු ද නම් නොකර ඔහු මිය ගියේය. සියලු වගකීම් පිළිමතලාවේ වෙත පැවරුණි. පිළිමතලාවේ පළමු අධිගාර් නොහොත් අගමැති තනතුර දරමින් සිටියේය. ඔහු අති දක්ෂ, බලලෝභි, කූට උපක්‍රමයෙහි දක්ෂ පුද්ගලයෙකු විය. හිස් වූ සිහසුනට අනුප්‍රාප්තිකයෙකු තේරීම ඔහුට පැවරුණි. විවාද චරිතයක් වූ පිළිමතලාවේ, රජ පෙළපතේ අවසාන වීමට වගකිව යුතු ප්‍රධාන සාධකයන්ගෙන් එකක් විය."
    },
    {
      "නම": "ශ්‍රී වික්‍රම රාජසිංහ රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1798 - 1815",
      "විවාහයන්": "වෙන්කටරංග රාජම්මාල්, වෙන්කටම්මා, මූදුචුන්නම්මා, වෙන්කට ජම්මාල්",
      "මරණය": 1832,
      "රාජවංශය/පක්ෂය": "මහනුවර නායක්කර් රාජවංශය",
      "රාජධානිය/අගනගරය": "මහනුවර රාජධානිය",
      "පූර්වප්‍රාප්තිකයා": "ශ්‍රී රාජාධි රාජසිංහ රජ",
      "අනුප්‍රාප්තිකයා": "තුන්වන ජෝර්ජ් රජ, එක්සත් රාජධානිය",
      "විස්තර": "ශ්‍රී වික්‍රම රාජසිංහ රජතුමා හෙළ ශ්‍රී ලංකාවේ රාජධානිය ඉංග්‍රීසීන්ට යටත්වීමට පෙර එහි අවසාන රජතුමා විය. ඔහු ශ්‍රී රාජාධිරාජසිංහ රජුගෙන් පසු 1798 දී සිහසුනට පත් විය. ඛ්‍රිතාන්‍යයන් විසින් මහනුවර යුද්ධය අවසානයේදී ඔහු පරාජය කොට පහ කරන ලදි. ඔහු නායක්කාර වංශයට අයත් දකූණු ඉන්දීය ජාතිකයෙකි. කන්නසාමි නම් වු මොහු 1798 දී සිංහාසනාරූඪ වන විට අභිෂේකය සඳහා ශ්‍රී වික්‍රම රාජසිංහ නම තෝරා ගන්නා ලදි. ඔහු ලංකාවේ නායක්කාර රජ පෙළපතෙහි අවසාන රජු විය. මොහු රාජාධිරාජ සිංහ රජුගේ බිසව වූ උපේන්ද්‍රම්මාගේ සොහොයුරියගේ පුතාය. වයස අවුරුදු 18 දී ඔහු මහනුවර රාජධානියේ රජු ලෙස අභිෂේක ලද්දේය. ඔහු මහනුවර නායක්කර් රජ පරපුරේ අන්තිමයා වූවා මෙන්ම ශ්‍රී ලංකාවේද අන්තිම රජු විය. ඔහුගේ පාලන කාලය තුළ ලංකාවේ අනිකුත් පෙදෙස්වල ද බ්‍රිතාන්‍ය යටත් විජිතය ස්ථාපනය විය. රාජාධි රාජසිංහගෙන් පසු රජකමට පත්වීම සඳහා තවත් අයෙකු සිටියේය. ඔහු උපේන්ද්‍රම්මා බිසවගේ සහෝදරයාය. ඔහුට රජ කමේ උරුමයට වැඩි අයිතියක් තිබිණ. කෙසේ වෙතත් අගමැති පිළිමතලාවේ, දකුණු ඉන්දීය කුමාරයා රජකමට තේරුවේය. වාර්ථාවන අන්දමට ඔහු එසේ කළේ විශාල සැලසුමක් හිතේ දරා ගෙනයි. එනම් සිහසුන අනියම් වශයෙන් ලබා ගෙන ඔහුගේම වූ නව රජ පරපුරක් පවත්වාගෙන යාමය. රජකමට පත් වීමෙන් පසු තරුණ රජුට කුමණ්ත්‍රණ ගණනාවකට මුහුණ දීමට සිදු විය. ඔහුගේ පාලන කාලය තුළදී ලන්දේසීන්ගෙන් පසු මුහුදු බඩ ප්‍රදේශයේ බලය අල්ලා ගත් බ්‍රිතාන්‍යයෝ උඩරට රාජ්‍යයේ දේශපාලන කටයුතුවලට මැදිහත් නොවූහ. එහෙත් පිළිමතලාවේ බ්‍රිතාන්‍යයන් සමග රහස් ගිවිසුම් පවත්වා ගෙන ගියේ බ්‍රිතාන්‍යයින්ට එරෙහිව ආරවුල් කිරීමට රජු පෙළඹෙන අයුරිණි. එවිට උඩරට රාජධානිය අල්ලා ගැනීමට බ්‍රිතාන්‍යයින්ට සාධාරණ හේතුවක් ඉස්මතුවෙයි. පසුව රාජ ද්‍රෝහි වීමේ හේතුව මත පිළිමතලාවේ මරා දැමීමට රජුට සිදු විය. එසේ කරන ලද්දේ ඊට පෙර එම වරද සම්බන්ධයෙන් දෙවරක් සමාව දී තිබීමෙන් පසුවයි. අලුතෙන් අගමැති (නොහොත් පළමු අධිගාර්) පදවියට පත් වූ ඇහැළේපොල, පිළිමතලාවගේ බෑණාය. ඔහු විසින් සංවිධානය කරන ලද කැරැල්ල රජු විසින් මැඩ පැවැත්වීමෙන් පසු ඇහැළේපොල කොළඹට පලා ගොස් බ්‍රිතාන්‍යයන් හා සම්බන්ධ වූයේය. ඔහුට යටත් වන ලෙස රජතුමා දන්වා සිටියේය. සති තුනක් ගත වීමෙන් පසුව ද ඔහු යටත් නොවීම නිසා කෝපයට පත් රජු ඔහුගේ මුළු පවුලම මරා දමන ලෙස නියෝග කළේය. මෙම දඬුවම ගැන විස්තර රට පුරා පතල කරන ලද්දේ ඒ ගැන ශෝක වූවන් විසිණි. කෙසේ වුවද මෙම තොරතුරුවල නිරවද්‍යතාවය ප්‍රශ්නකාරීය."
    },
    {
      "නම": "තුන්වන ජෝර්ජ් රජ, එක්සත් රාජධානිය",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1815 - 1820",
      "විවාහයන්": "මැක්ලන්බර්ග්-ස්ට්‍රෙලිස්z හි චාර්ලට් කුමරිය",
      "මරණය": 1820,
      "රාජවංශය/පක්ෂය": "හැනොවර් රාජ වංශය",
      "රාජධානිය/අගනගරය": "කොළඹ",
      "පූර්වප්‍රාප්තිකයා": "ශ්‍රී වික්‍රම රාජසිංහ රජ",
      "අනුප්‍රාප්තිකයා": "IV වන ජෝර්ජ් රජු",
      "විස්තර": "තුන්වන ජෝර්ජ් රජ (ජෝර්ජ් විලියම් ෆ්‍රෙඩ්රික්; 4 ජූනි 1738 - 29 ජනවාරි 1820) යනු, 1760 ඔක්තොම්බර 25 දින සිට 1801 ජනවාරි 1 දිනදී රටවල් දෙක එක්සත් වීම දක්වා මහා බ්‍රිතාන්‍යයෙහි සහ අයර්ලන්තයෙහි රජ සහ, එතැන් සිට ඔහුගේ මරණය දක්වා මහා බ්‍රිතාන්‍ය සහ අයර්ලන්ත එක්සත් රාජධානියෙහි රජද විය."
    },
    {
      "නම": "සතරවන ජෝර්ජ් රජ, එක්සත් රාජධානිය",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1837 - 1901",
      "විවාහයන්": null,
      "මරණය": 1830,
      "රාජවංශය/පක්ෂය": "හැනොවර් රාජ වංශය",
      "රාජධානිය/අගනගරය": "කොළඹ",
      "පූර්වප්‍රාප්තිකයා": "තුන්වන ජෝර්ජ් රජ",
      "අනුප්‍රාප්තිකයා": "හත්වන එඩ්වඩ් රජ",
      "විස්තර": "සතරවන ජෝර්ජ් රජ (ජෝර්ජ් ඔගස්ටස් ෆ්‍රෙඩ්රික්; 12 අගෝස්තු 1762 – 26 ජූනි 1830) යනු, ඔහුගේ පියාවූ තුන්වන ජෝර්ජ් රජ 1820 ජනවාරි 29 දිනදී මිය යෑමෙන් පසුව සහ වසර දහයකට පසුව තම මරණය දක්වා, මහා බ්‍රිතාන්‍ය සහ අයර්ලන්ත එක්සත් රාජධානියෙහි සහ හැනෝවර් හී රජ විය. 1811 වසරෙහි සිට ඔහුගේ කිරුළු ප්‍රාප්තිය දක්වා ඔහුගේ පියාගේ අවසාන මානසික ව්‍යාධිය තුලදී, උපරාජ කුමරුවා ලෙසින් ඔහු සේවය කළේය."
    },
    {
      "නම": "වික්ටෝරියා රැජිණ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1820 - 1831",
      "විවාහයන්": "සැකස-කොබර්ග් ගොතා හි ඇල්බට් කුමරු",
      "මරණය": 1901,
      "රාජවංශය/පක්ෂය": "හැනොවර් රාජ වංශය",
      "රාජධානිය/අගනගරය": "කොළඹ",
      "පූර්වප්‍රාප්තිකයා": "සතරවන ජෝර්ජ් රජ, එක්සත් රාජධානිය",
      "අනුප්‍රාප්තිකයා": "හත්වන එඩ්වඩ් රජ, එක්සත් රාජධානිය",
      "විස්තර": "වික්ටෝරියා (ඇලෙක්සැන්ඩ්‍රිනා වික්ටෝරියා; 1819 මැයි 24 - 1901 ජනවාරි 22) මහා බ්‍රිතාන්‍ය සහ අයර්ලන්ත එක්සත් රාජධානියේ සිටි රැජිණ පදවිය සහ ඉන්දියාවේ අධිරාජිණි පදවිය දරණලදී. ඇය 1837 ජුනි 20 වැනිදා සිට ඇගේ මරණය තෙක් මහා බ්‍රිතාන්‍ය සහ අයර්ලන්ත එක්සත් රාජධානියේ රැජිණ වූවාය. 1876 මැයි 1 සිට ඇයට ඉන්දියාවේ අධිරාජිණි පදවිය දරණ ලදී."
    },
    {
      "නම": "හත්වන එඩ්වඩ් රජ, එක්සත් රාජධානිය",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1901 – 1910",
      "විවාහයන්": "ඩෙන්මාර්කයේ ඇලෙක්සැන්ඩ්‍රා කුමරිය",
      "මරණය": 1910,
      "රාජවංශය/පක්ෂය": "හැනොවර් රාජ වංශය",
      "රාජධානිය/අගනගරය": "කොළඹ",
      "පූර්වප්‍රාප්තිකයා": "වික්ටෝරියා රැජිණ",
      "අනුප්‍රාප්තිකයා": "පස්වන ජෝර්ජ් රජ",
      "විස්තර": "හත්වන එඩ්වඩ් රජ  (1841 නොවැම්බර් 9 – 1910 මැයි 6) 1901 ජනවාරි 22 දින සිට සිය මරණය දක්වා ම එක්සත් රාජධානිය සහ බ්‍රිතාන්‍යය ඩොමිනියන වල රජු ද ඉන්දියාවේ අධිරාජ්‍යයා ද විය."
    },
    {
      "නම": "පස්වන ජෝර්ජ් රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1910 - 1936",
      "විවාහයන්": "ටෙක් හි මේරි",
      "මරණය": 1936,
      "රාජවංශය/පක්ෂය": "වින්ඩ්සර් රාජ වංශය",
      "රාජධානිය/අගනගරය": "කොළඹ",
      "පූර්වප්‍රාප්තිකයා": "හත්වන එඩ්වඩ් රජ, එක්සත් රාජධානිය",
      "අනුප්‍රාප්තිකයා": "අටවන එඩ්වර්ඩ් රජ",
      "විස්තර": "පස්වන ජෝර්ජ්, (ජෝර්ජ් ෆ්‍රෙඩ්රික් අර්නස්ට් ඇල්බර්ට්; 3 ජුනි 1865 - 20 ජනවාරි 1936) 1910 මැයි 6 සිට 1936 ඔහුගේ මරණය දක්වා එක්සත් රාජධානියේ සහ බ්‍රිතාන්‍ය අධිරාජ්‍යයේ ඩොමීනියන් රාජ්‍යවල රජු මෙන්ම ඉන්දියාවේ අධිරාජ්‍යයා විය. සිය මිත්තණිය වූ වික්ටෝරියා රැජිනගේ පාලන සමයේ උපත ලද ජෝර්ජ්, ඔහුගේ පියා වූ ඇල්බර්ට් එඩ්වර්ඩ් සහ වැඩිමහල් සොහොයුරා වූ ඇල්බර්ට් වික්ටර් කුමරුට පසු රජ කිරුළ දැරීමට සිටි තෙවැන්නා විය. 1877 සිට 1891 දක්වා ජෝර්ජ් රාජකීය නාවික හමුදාවේ සේවය කළේය. ඔහුගේ වැඩිමහල් සොහොයුරාගේ අනපේක්ෂිත මරණය නිසා 1892 ආරම්භයේ දී ඔහු රජ කිරුළ ලබා ගැනීමට සිටි දෙවැන්නා බවට පත්විය. ජෝර්ජ්ගේ මිත්තණිය 1901 දී මිය යාම නිසා ඔහුගේ පියා හත්වන එඩ්වර්ඩ් නමින් බ්‍රිතාන්‍ය අධිරාජ්‍යයේ රජ-අධිරජ බවට පත්විය. ජෝර්ජ්, වේල්ස්හි කුමරු බවට පත්විය. ඔහුගේ පියාගෙන් පසු 1910 දී ජෝර්ජ් සිහසුනට පත්විය. ඔහු දිල්ලි රාජසභාව ට පැමිණි එකම ඉන්දියාවේ අධිරාජ්‍යයා වෙයි. පස්වන ජෝර්ජ්ගේ රාජ්‍ය කාලය තුළ සමාජවාදය, කොමියුනිස්ට්වාදය, ෆැසිස්ට්වාදය, අයර්ලන්ත ජනරජවාදය සහ ඉන්දියානු නිදහස් ව්‍යාපාරය යනාදී දේශපාලන කරළියේ මූල විපර්යාසාත්මක අංශ වර්ධනය විය. 1911 පාර්ලිමේන්තු පනත මගින් ඡන්දයෙන් තේරී පත්වූ , ඡන්දයෙන් තේරී පත් නොවන ස්වාමි මංත්‍රී මණ්ඩලය ට වඩා අධිපතිත්වයෙන් යුක්ත වන බව ප්‍රකාශයට පත් කරන ලදී. පළමුවන ලෝක යුද්ධයේ (1914 - 1918) ප්‍රතිඵලයක් ලෙස ඔහුගේ ඥාතිවර රුසියාවේ දෙවන නිකොලස් සාර් සහ ජර්මනියේ දෙවන විල්හෙල්ම් ගේ අධිරාජ්‍යයන් බිඳ වැටුණි. නමුත් බ්‍රිතාන්‍ය අධිරාජ්‍යය එහි උපරිම ඵලදායි වපසරියට වර්ධනය වුණි. ජර්මන් විරෝධී මහජන මතය නිසා සැක්ස-කොබර්ග් ගොතා යන රාජ වංශයේ නාමය, සහ අනෙකුත් ජර්මානු රාජකීය සහ වංශාධිපති තනතුරු අතහැර 1917 දී ඔහු වින්ඩ්සර් රාජවංශයෙහි ප්‍රථම රජු බවට පත් විය. 1924 දී ඔහු ප්‍රථම කම්කරු අමාත්‍යංශය පත්කරන ලද අතර 1931 වෙස්ට්මින්ස්ටර් ආඥා පනත මගින් ඩොමීනියන් රාජ්‍යයන් පොදුරාජ්‍ය මණ්ඩලය තුළ වෙන්වූ, ස්වාධීන රාජ්‍යයන් බව පිළිගනු ලැබිය. දුම්පානය නිසා හටගත් දුර්වල සෞඛ්‍ය තත්ත්වයන්ගෙන් සිය රාජ්‍ය කාලයේ අවසන් සමයේ ඔහු පීඩා විඳි අතර ඔහුගේ මරණින් පසු ඔහුගේ වැඩිමහල් පුත් අටවන එඩ්වර්ඩ් ලෙස රජවිය."
    },
    {
      "නම": "අටවන එඩ්වර්ඩ් රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1936 - 1936",
      "විවාහයන්": "වොලිස් සිම්ප්සන්",
      "මරණය": 1972,
      "රාජවංශය/පක්ෂය": "වින්ඩ්සර් රාජ වංශය",
      "රාජධානිය/අගනගරය": "කොළඹ",
      "පූර්වප්‍රාප්තිකයා": "පස්වන ජෝර්ජ් රජ",
      "අනුප්‍රාප්තිකයා": "හයවන ජෝර්ජ් රජ",
      "විස්තර": "අටවන එඩ්වර්ඩ්, (එඩ්වර්ඩ් ඇල්බර්ට් ක්‍රිස්ටියන් ජෝර්ජ් ඇන්ඩෲ පැට්‍රික් ඩේවිඩ්, 23 ජුනි 1894 – 28 මැයි 1972), 1936 ජනවාරි 20 සිට එම වසරේ දෙසැම්බර් 11 තෙක් එක්සත් රාජධානියේ සහ බ්‍රිතාන්‍ය අධිරාජ්‍යයේ ඩොමීනියන් රාජ්‍යවල රජු මෙන්ම ඉන්දියාවේ අධිරාජ්‍යයා විය. එඩ්වර්ඩ්, පස්වන ජෝර්ජ් රජු සහ මේරි බිසවගේ වැඩිමහළු පුත්‍රයා විය. ඔහුගේ දහසය වන උපන් දිනය දා, එනම් ඔහුගේ පියා රජ බවට පත් වී සති නවයකට පසු එඩ්වර්ඩ් වේල්සයේ කුමරු ලෙස නම් කරන ලදී. ඔහු පළමුවන ලෝක යුධ සමයේ බ්‍රිතාන්‍ය හමුදාවට සේවය කල අතර විදේශයන් කිහිපයකට ගමන් කළේය. 1936 දී ඔහුගේ පියාගේ මරණය සිදුවීම නිසා එඩ්වර්ඩ් රජු බවට පත්විය. කෙසේ නමුත්, රාජ සභාවේ ක්‍රියා පටිපාටි පිළිබඳව ඔහු නොයිවසිලිමත් ස්වභාවයක් පෙන්නුම් කල අතර ව්‍යවස්ථාපිත සම්මුතීන් කෙරෙහි ඔහුගෙන් විද්‍යමාන වූ පැහැදිලි නොසැළකිල්ල පිළිබඳව දේශපාලකයින්ගේ අවධානය යොමු විය. රජ බවට පත් වී මාස කීපයක් තුළ වොලිස් සිම්ප්සන් නමැති, පළමු කසාදයෙන් දික්කසාද වී දෙවන කසාදයෙන්ද දික්කසාද වීමේ බලාපොරොත්තුවෙන් සිටි ඇමෙරිකානු කාන්තාවකට විවාහ යෝජනා කිරීමෙන් ඔහු ව්‍යවස්ථාමය අර්බුධයක් ඇති කළේය. එක්සත් රාජධානියෙහි සහ ඩොමිනියන් රටවල අගමැතිවරු එම විවාහයට විරුද්ධත්වය ප්‍රකාශ කළහ; ජිවත්වන දික්කසාද වූ සැමියන් දෙදෙනෙකු සිටින කාන්තාවක් දේශපාලන සහ සමාජමය වශයෙන් රජ බිසවකගේ තත්ත්වයට සුදුසු නොවන බවට ඔවුහු තර්ක කළහ. තවද, එකල දික්කසාද වූ වල්ලභයා ජීවත්වන්නේ නම් නැවත විවාහ වීම අනුමත නොකළ එංගලන්ත පල්ලියේ ප්‍රධානියා වූ එඩ්වර්ඩ් එවැනි විවාහයකට ඇතුලත් වීම විශාල ආරවුලක්/විසංවාදයක් ඇතිකළ හැකිව තිබුණි. විවාහය සිදු කෙරුණහොත්, එනිසාවෙන්ම අගමැති ස්ටැන්ලි බෝල්ඩ්වින්ගේ රජය ඉල්ලා අස්වන බව සහ එනිසා මැතිවරණයකට යාමට සිදුවන බවත් එමගින් දේශපාලන වශයෙන් මධ්‍යස්ථ ව්‍යවස්ථාපිත රාජකියයෙකු වශයෙන් සිය තත්ත්වය විනාශ මුඛයට යා හැකි බවත් එඩ්වර්ඩ් දැන සිටියේය. වොලිස් විවාහ කරගතහොත් සිහසුන දැරීම සිදු කල නොහැකි වන බව ප්‍රත්‍යක්ෂ ලෙස පෙනෙන්නට වූ විට එඩ්වර්ඩ් රජ පදවිය අත් හැරියේය. ඔහුගේ බාල සොහොයුරු VI වන ජෝර්ජ් රජ බවට පත් විය. දින 326 ක රාජ්‍ය කාලයක් දැරූ එඩ්වර්ඩ්, බ්‍රිතාන්‍ය ඉතිහාසයේ කෙටිතම රාජ්‍ය රාජ්‍ය කාලයක් දැරූ රාජකීයයන්ගෙන් අයෙක් වෙයි. රාජත්වය අත්හැරීමෙන් පසු ඔහු වින්ඩ්සර්හි ආදිපාදවරයා බවට පත්විය. 1937 ජුනි 3 ප්‍රංශයේ දී ඔහු වොලිස්ව, ඇගේ දෙවන දික්කසාදය සම්පූර්ණ වීමෙන් පසු විවාහ කර ගත්තේය. පසුව එම වසරේදී යුවළ ජර්මනියේ සංචාරය කළහ. දෙවන ලෝක යුධ සමයේදී ඔහු පළමුව බ්‍රිතාන්‍ය හමුදාවේ සේවය කළේය. නමුත් නාසින්ට අනුකම්පා කළ බවට ඔහුට පෞද්ගලික චෝදනා එල්ල වීමෙන් පසු ඔහුව බහමාස් හි ආණ්ඩුකාරවරයා ලෙස පත් කරන ලදී. යුද්ධයෙන් පසු ජිවිතයේ ඉතිරි කාලය ඔහු ප්‍රංශයේ විශ්‍රාමිකව ගත කළේය. 1972 ඔහුගේ මරණ තෙක් එඩ්වර්ඩ් සහ වොලිස් විවාහ දිවිය ගත කළහ."
    },
    {
      "නම": "හයවන ජෝර්ජ් රජ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1936 - 1952",
      "විවාහයන්": "එලිසබෙත් බෝවස්-ලියොන් ආර්යාව",
      "මරණය": 1952,
      "රාජවංශය/පක්ෂය": "වින්ඩ්සර් රාජ වංශය",
      "රාජධානිය/අගනගරය": "කොළඹ",
      "පූර්වප්‍රාප්තිකයා": "අටවන එඩ්වර්ඩ් රජ",
      "අනුප්‍රාප්තිකයා": "II වන එලිසබෙත් රැජිණ",
      "විස්තර": "හයවන ජෝර්ජ් (ඇල්බර්ට් ෆ්‍රෙඩ්රික් ආතර් ජෝර්ජ් 14 දෙසැම්බර් 1895 – 6 පෙබරවාරි 1952), 1936 දෙසැම්බර් 11 සිට ඔහුගේ මරණය දක්වා එක්සත් රාජධානියේ සහ බ්‍රිතාන්‍ය පොදුරාජ්‍ය මණ්ඩලයේ ඩොමීනියන් රාජ්‍ය වල රජු විය. ඔහු අවසාන ඉන්දියාවේ අධිරාජ්‍යයා සහ ප්‍රථම පොදුරාජ්‍ය මණ්ඩලයේ ප්‍රධානියා විය. ඔහු රජ බවට පත්වන තෙක් මහජනයා අතර ප්‍රසිද්ධියට පත් වූයේ ඇල්බර්ට් යන නමිනි. එමෙන්ම ඔහුගේ පවුලේ අය සහ මිතුරන් අතර ඔහු හැඳින්වුණේ බර්ටි යන නමිනි. ජෝර්ජ් උපත ලැබුවේ ඔහුගේ මී මිත්තණිය වූ වික්ටෝරියා රැජින ගේ පාලන සමයේ දී ය. ඇගේ වල්ලභයා වූ ඇල්බර්ට් කුමරුගේ නම අනුව ජෝර්ජ් කුමරුට ඇල්බර්ට් යන නාමය ලැබුණි. පස්වන ජෝර්ජ් රජුගේ දෙවන පුත්‍රයා වූ නිසාවෙන් ජෝර්ජ් සිහසුනට පත්වීමට අපේක්ෂා නොකළේය. ඔහුගේ මුල් කාලීන දිවිය සිය සොහොයුරු එඩ්වර්ඩ් සෙවණේ ගෙවුණි. යොවුන් වියේ දී නාවුක පාසලට ඇතුලත් වූ ඔහු පළමු ලෝක යුධ සමයේ රාජකීය නාවික හමුදාවේ සහ රාජකීය ගුවන් හමුදාවේ සේවය කළේය. 1920 දී ඔහු යෝක් හි ආදිපාදවරයා බවට පත් විය. 1923 දී ඔහු එලිසබෙත් බොවිස්-ලියොන් ආර්යාව විවාහ කර ගත්තේය. ඔවුන් දෙපළට එළිසබෙත් සහ මාගරට් යනුවෙන් දියණියන් දෙදෙනෙකු විය. 1920 ගණන්වල මැද බාගයේදී ඔහු ගොත ගැසීම සඳහා කථන චිකිත්සාවක් ලබා ගත්තේය. නමුත් එය සම්පූර්ණයෙන් යටපත් කිරීමට ඔහුට නොහැකි විණි. 1936 දී ඔවුන්ගේ පියා මියයාම නිසා ජෝර්ජ් ගේ වැඩිමහල් සොහොයුරා අටවන එඩ්වර්ඩ් නමින් සිහසුනට පත්විය. කෙසේවෙතත් එම වසර අවසානයේ දී එඩ්වර්ඩ්, වොලිස් සිම්ප්සන් නමැති දික්කසාද වූ ඇමෙරිකානු කාන්තාවක විවාහ කර ගැනීමේ සිය කැමැත්ත හෙළිදරව් කළේය. දේශපාලන සහ ආගමික හේතු නිසා දික්කසාද වූ ගැහැණියක විවාහ කරගෙන රජකම දැරීමේ හැකියාවක් නොමැති බවට බ්‍රිතාන්‍ය අග්‍රාමාත්‍ය ස්ටැන්ලි බෝල්ඩ්වින් එඩ්වර්ඩ් ට අවවාද කළේය. සිම්ප්සන් විවාහ කර ගැනීම සඳහා එඩ්වර්ඩ් රජකම අත්හළේය. වින්ඩ්සර් රාජවංශයේ තෙවැන්නා ලෙස ජෝර්ජ් සිහසුනට පත්විය."
    },
    {
      "නම": "II වන එලිසබෙත් රැජිණ",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1952 - 1972",
      "විවාහයන්": "ෆිලිප් කුමාරයා",
      "මරණය": null,
      "රාජවංශය/පක්ෂය": "වින්ඩ්සර් රාජ වංශය",
      "රාජධානිය/අගනගරය": "කොළඹ",
      "පූර්වප්‍රාප්තිකයා": "හයවන ජෝර්ජ් රජ",
      "අනුප්‍රාප්තිකයා": "විලියම් ගොපල්ලව",
      "විස්තර": "දෙවන එළිසබෙත් රැජිණ වූ කලී පොදුරාජ්‍ය මණ්ඩලීය ජනපද දහසයකද, මුහුදෙන් එතෙර යටත් විජිතයන් වලද රාජ්‍ය නායිකාවයි. ඇය වාසය කරනුයේ එක්සත් රාජධානිය තුළයි. ඇය සතුව තිබූ පැරණි රාජධානිය ඇයගේ මුතුන් මිත්තන් විසින් පාලනය කරන ලද, දේශයන් වලින්ද සමන්විත විය. ඇගේ පියාවූ හයවන ජෝර්ජ් රජු 1952 පෙබරවාරි මස මියයාමෙන් පසු ඇය සිහසුනට පත්වුවාය. එක්සත් රාජධානියට අමතරව ඇය කැනඩාව, ඕස්ට්‍රේලියාව, නවසීලන්තය, ජැ‍මෙයිකාව, බර්බඩෝසය, ග්‍රෙනාඩාව, පැපුවා නිව්ගිනියාව, සොලමන් දූපත්, තුවාලූ, ශාන්ත ලුසියා, ශාන්ත වින්ස්ටන් සහ ‍ග්‍රෙනඩ්න්ස්, ඇන්විගුවා සහ බාබුවා, බෙලිසය සහ ශාන්ත කෙට්ස් සහ හෙවිස් යන රටවලද රැජිණ ලෙස කටයුතු කරයි. එම සෑම රටකම අග්‍රාණ්ඩුකාර තනතුර දරනු ලබන්නේ ඇයගේ නියෝජිතයෙකු විසිනි. මෙම රටවල් 16 පොදු රාජ්‍ය මණ්ඩලීය රාජධානි ලෙස හඳුන්වයි. ඔවුන් සමඟ සම්බන්ධ වූ අනෙකුත් රාජ්‍යවල ජනගහනය මිලියන 129 ඉක්මවයි. න්‍යායාත්මකව ඇයගේ බලය අති විශාලය. නමුත් ප්‍රායෝගිකව ඇය දේශපාලනමය කටයුතු සඳහා මැදිහත් වන්නේ කලාතුරකිනි. එක්සත් රාජධානිය තුළදී නම් ඇය තම රජයේ අමාත්‍යවරුන් සමඟ විවිධ සම්බන්ධතා මඟින් රටෙහි අභ්‍යන්තර කටයුතු වලට දායක වෙයි. II වන එළිසබෙත් රැජිණ වෙනත් තනතුරු රැසක් ද දරනු ලබන්නීය. ඒවා නම් පොදුරාජ්‍ය මණ්ඩලයේ ප්‍රධානියා, එංගලන්ත දේවස්ථානවල ප්‍රධානියා, නොමැන්ඩ් හි සිටුවර, මෑන්හි ප්‍රධානියා, ‍ ෆිජිහි ප්‍රධානියා යන ඒවාය. ඇයගේ සුවිශාල රාජ්‍යයේ විශාල වෙනස්කම් අද වනවිට සිදුවෙමින් පවතී. එනම් බොහෝ රාජ්‍යයන් අද බ්‍රිතාන්‍ය පරිපාලනයෙන් අත්මිදී ස්වාධීනව කටයුතු කිරීමට උත්සාහ දරති."
    },
    {
      "නම": "විලියම් ගොපල්ලව",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1960 – 1960",
      "විවාහයන්": "සීලවතී රඹුක්වැල්ල",
      "මරණය": 1981,
      "රාජවංශය/පක්ෂය": null,
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "II වන එලිසබෙත් රැජිණ",
      "අනුප්‍රාප්තිකයා": "ජේ.ආර්. ජයවර්ධන",
      "විස්තර": "විලියම් ගොපල්ලව ලංකාවේ අවසාන අග්‍රාණ්ඩුකාරයා වු අතර, ශ්‍රී ලංකාවේ ප්‍රථම විධායක නොවන ජනාධිපති ද විය. ( නාමික විධායක ) 1972 දි ලංකාව ජනරජයක් වු බවට පත්විමෙන් පසු ජනාධිපති ධුරයට පත් වු ඔහු අපක්ෂපාති හා ගෞරවනීය රාජ්‍ය නායකයෙකු ලෙස ද ප්‍රසිද්ධියට පත්වි ඇත. ක්‍රි.ව. 1926 දී මාතලේ නගර සභා ඡන්දයෙන් ජයගත් ගොපල්ලව වසර 13 ක කලයක් සහ දිගට එහි සේවය ‍කළේය. ඔහු මාතලේ නගර සභාවේ සභාපති ලෙස වසර පහක් සේවය කළ අතර එවකට සිටි ළාබලම සභාපතිද විය. 1936 මාතලේ ඡන්දයේ අසාර්ථක වුවද 1939 ද මහනුවර නගර සභාව ඇති කිරිමෙන් පසු එහි ප්‍රථම නගර සභා කොමසාරිස් වරයා ලෙස විලියම් ගොපල්ලව පත් විය. දෙවෙනි ලෝක යුද්ධය පැවති කාලය පුරාම ඔහු එම පදවිය දැරිය. 1951 දී කොළඹ නගර සභා කොමසාරිස් ලෙස සේවයට පත්වු ගොපල්ලව 1957 දි එම පදවියෙන් ඉල්ලා අස්විය. 1958 ජුනි 18 දා එස්.ඩබ්.ආර්.ඩී බණ්ඩාරනායක රජය, චිනය රජය සම තාතාපති සබදතා ඇති කරගත් අවස්ථාවේ චීන තානාපති ලෙස පත් කර යැවිණි. 1961 සැප් 7 දින සිට යලි කැදවු ඔහු ඇමරිකාවේ තානාපති ලෙස පත් කෙරිණ. 1962 වන තෙක් ඔහු එම තනතුර සිටි අතර එම වසරේ නැවත කැදවුයේ ලංකාවේ අග්රාණ්ඩුකාර ධුරය පිරිනමිනි. මෙම අග්‍රාණ්ඩුකාර ධුරය 1972 වන තෙක් දැරූ අතර ඔහුගේ කාර්ය භාරය වුයේ එංගලන්තයේ රැජිණයේ නියෝජිතයා ලෙස ලංකාවේ රාජ්යරය වෙනුවෙන් පෙනි සිටිමයි. ලංකාවේ දෙවන අග්‍රාණ්ඩුකාරවරයා ද වු ඔහු ප්‍රථම බෞද්ධ අග්‍රාණ්ඩුකරු ද විය. සිරිමාවෝ බණ්ඩාරනායක මැතිනිය විසින් එම පත්විම් සිදු කෙරිණි. 1965 මහ මැතිවරණයෙන් වැඩි පාර්ලිමේන්තු ආසන සංඛ්යා වක් හිමිකරගත් එක්සත් ජාතික පක්ෂයට රජයක් පිහිටුවිමට ආරාධනා කිරිමේ ව්යතවස්ථකාදායක තිරණය ඉතා වැදගත් විය.තමා අග්රාජණ්ඩුකාර ධුරයට පත් කරනු ලැබුවේ ශ්රි ලංකාවේ නිදහස් පක්ෂය මගින් වුවද, ජනතා මතයට ගරු කරන ඔහු ව්යාවස්ථානුකූලව එක්සත් ජාතික පක්ෂයට බලය පැවරිමට ගත් තිරණය අතිශයින් වැදගත් වුයේ නායකත්වය පිළිබදව ඇතිවිය හැකි ව තිබු විශාල ප්‍රශ්නයක්ද මගහරවාලමිනි. 1972 දී ලංකාව ජනරජයක් බවට පත් වු විට එහි ප්‍රථම ජනාදිපති ධුරයට පත් වුයේ ගොපල්ලව මැතිතුමාය. 1978 පෙබරවාරි මාසයේදි ජේ.ආර්. ජයවර්ධන මහතා ප්‍රථම විධායක ජනාධිපති ධුරයට පත්කරවිමෙන් පසු ගොපල්ලව සිය තනතුරින් ඉල්ලා අස්විය."
    },
    {
      "නම": "ඩඩ්ලි සේනානායක",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1960 – 1965",
      "විවාහයන්": null,
      "මරණය": 1973,
      "රාජවංශය/පක්ෂය": "එක්සත් ජාතික පක්ෂය",
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "II වන එලිසබෙත් රැජිණ",
      "අනුප්‍රාප්තිකයා": "සිරිමාවෝ බණ්ඩාරනායක",
      "විස්තර": "ඩඩ්ලි සේනානායක (ඩඩ්ලි ෂෙල්ටන් සේනානායක) (1911 ජුනි 19 - 1973 අප්‍රේල් 13) යනු ශ්‍රී ලංකාවේ දෙවන අග්‍රාමාත්‍යවයායි. (1952 මාර්තු 26 සිට 1953 ඔක්තොම්බර් 12) සහ නැවත දෙවතාවක් පිලිවෙලින් (1960 මාර්තු 21) සහ (1965 මාර්තු 25) ශ්‍රී ලංකාවේ අග්‍රාමාත්‍ය බවට පත් විය."
    },
    {
      "නම": "සිරිමාවෝ බණ්ඩාරනායක",
      "රාජ්‍ය සමය": "ක්‍රි.ව. 1965 – 1971",
      "විවාහයන්": "එස්.ඩබ්.ආර්.ඩී. බණ්ඩාරනායක",
      "මරණය": 2000,
      "රාජවංශය/පක්ෂය": "ශ්‍රී ලංකා නිදහස් පක්ෂය",
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "ඩඩ්ලි සේනානායක",
      "අනුප්‍රාප්තිකයා": "ජේ.ආර්. ජයවර්ධන",
      "විස්තර": "ගරු සිරිමාවෝ රත්වත්ත ඩයස් බණ්ඩාරනායක (මැතිනිය ලෙස සාමාන්‍යයෙන් හඳුන්වයි) ( 1916 අප්‍රේල් 17 - 2000 ඔක්තෝම්බර් 10) නවීන ලෝකයේ ආණ්ඩුවක ප්‍රධානියාවූ ප්‍රථම කාන්තාවයි. ඇය ශ්‍රි ලංකාවේ තෙවරක් අග්‍රාමාත්‍ය පදවියට පත්වුවාය. ඒ 1960 - 1965, 1970 - 1977 සහ 1994 - 2000 යන කාල වකවානු වලදීය. උඩරට රදල පවුලක උපත ලද ඇය, කතෝලික, ඉංග්‍රීසි මාධ්‍ය පාසල් වලින් අද්‍යාපනය ලැබුවද, බුද්ධ ධර්මය අත් නොහැරියාය. ඉංග්‍රීසි මෙන්ම සිංහලද කතා කළාය. පාසලින් නික්ම යාමත් සමග ඇය විවිධ සමාජ වැඩසටහන් කිරීමෙන් අනතුරුව විවාහ වී පවුල් ජීවිතයට සම්බන්ධ විය. ඇගේ ස්වාමියා වූ එස්. ඩබ්ලිව් . ආර්. ඩී. බණ්ඩාරනායක මහතාට සහකාරියක් වූ ඈ, ඔහුගේ විශ්වාසය දිනාගත්තේ ඔහුගේ උපදේශකයක බවට පත් වීමෙනි. ගම් බද පළාත්වල ගහැණු ළමයින්ගේ හා කාන්තාවන්ගේ ජීවන තත්ත්ව දියුණු කිරීම ඇගේ සමාජ සේවයේ අරමුණ් විය. 1959දී ඇගේ ස්වාමිය ඝාතනය වීමත් සමගම ඈ දේශපාලනයට එක් විය. ස්‍රී ලංකා නිදහස් පක්ෂයේ සභාපතිනිය වූවාය. ඇයගේ නායකත්වය යටතේ, එම පක්ෂය 1960 ජූලි පාර්ලිමේන්තුවරණය ජයග්‍රහණය කළේය. බ්‍රිතාන්‍ය යටත් විජිතයක් වූ සෙලෝනය සමාජවාදී ජනරජයක් කිරීමට ඈ උත්සහ කළාය. ඒ සදහා ඇය බැංකු, අධ්‍යාපන, කර්මාන්ත, මාධ්‍ය හා වෙළද ක්ෂේත්‍ර වල ආයතන රැසක් ජනසතු කළාය. පරිපාලන භාෂාව ඉංග්‍රීසියේ සිට සිංහලයට මාරු කළ ඈ ශ්‍රී ලාංකීය දෙමළ ජනතාවගේ උත්සුකයන් බල ගැන්වූවාය. කම්කරු දෙමළ ජනතාවද මෙලෙස කළකිරීමට පත්වුණි. එතුමියගේ මුල් අගමැති ධූර දෙකේදී, මෙරට ඉහළ බදු ප්‍රතිශතයක් හා උද්ධමනයක් පැවැතුණි. ආහාර ආනයනය මත රටේ ආහාර සුරක්ෂිතතාව යැපුණි. තවද, ඇයගේ සිංහල ජාතිකවාදී පිලිවෙත් නිසා සිංහල ජනතාව හා දෙමළ ජනතාව අතර ගැටලු ප්‍රබල විය. 1962දී ඈ රජයට එරෙහිව වූ කුමන්ත්‍රණයකට සා‍ර්ථකව මුහණ දුන්නාය. 1971දී අන්තවාදී තරුණ කුමන්ත්‍රණයක් මැඩපැවැත්වූවාය. 1972දී මෙතුමිය නව ව්‍යවස්ථාවක් සම්පාදනය කිරීම අධීක්ෂණය කළාය, එමගින් මෙරට ප්‍රජාතන්ත්‍රවාදී ජනරජයක් බවට පත් කළේ බ්‍රිතාන්‍ය කිරීටය ඉවත් කිරීමෙනි. 1975දී ඈ කාන්තා හා ළමා කටයුතු නිර්මාණයට අගමැති ලෙස දායක වූවාය. එතුමියගේ පාලන කාලයේ ප්‍රධාන ලක්ෂණයක් වූයේ දේශීය වශයෙන් ප්‍රමාණවත් නොවන ලෙස ආර්ථික දියුණුවකි. මෙතුමිය අන්තර්ජාතික දේශපාලනයට වැදගත් සේවයක් ඉටු කළේ නොබැඳි රටවල් පිලේ නායකත්වය ගනිමිනි. 1977දී බලයෙන් ඉවත් වූ ඇගේ සිවිල් අයිතිවාසිකම් ඉවත් කිරීමට එක්සත් ජාතික පක්ෂ රජය 1980දී යොමු වූවේය. ඇයට රාජ්‍ය සේවයේ යේදීමේ හැකියාවද වසර හතකට විසන්ධි කරන ලදි. ඇයගේ අනුප්‍රාප්තිකයන් මුලින්ම ආර්ථිකය දියුණු කළද, සමාජ ගැටලු වලට විසදුම් නොසැපයූ නිසා මෙරට දීර්ඝ සිවිල් යුද්ධයකට මුහණ පෑවේය. ඇය 1986 පක්ෂ නායකත්වය නැවත ලබාගැනීමත් සමගම මෙරටට ඉන්දියානු සාම සාධක හමුදාව ගෙන්වීමට එරෙහි වූවාය. එමගින් ශ්‍රී ලංකාවේ පරමධිපත්‍ය නැති වන බව ඈ විශ්වාස කළාය. 1989 දී ජනාධිපතිවරණයෙන් පරාජය ලත් ඈ, එකල් සිට 1994 දක්වා ව්‍යවස්ථාදායකයේ විපක්ෂ නායක ධූරය දැරුවාය. ඇගේ දියණිය වූ චන්ද්‍රිකා බණ්ඩාරනායක කුමාරතුංග එම වර්ෂයේ ජනාධිපතිවරණය ජයග්‍රහණයත් සමගම, එතුමිය තෙවන වරට අග්‍රාමාත්‍ය ධූරයට පත්වුණි. ඇය එම ධූරයේ ඇය 2000දී විශ්‍රාම යන තුරු සේවය කළාය. විශ්‍රාම යෑමෙන් මාස දෙකකට පසු ඈ අභාවප්‍රාප්ත විය."
    },
    {
      "නම": "ජේ.ආර්. ජයවර්ධන",
      "රාජ්‍ය සමය": "ක්‍රි.ව.  1978 - 1989",
      "විවාහයන්": "එලිනා ජයවර්ධන",
      "මරණය": 1996,
      "රාජවංශය/පක්ෂය": "එක්සත් ජාතික පක්ෂය",
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "සිරිමාවෝ බණ්ඩාරනායක",
      "අනුප්‍රාප්තිකයා": "රණසිංහ ප්‍රේමදාස",
      "විස්තර": "ජූනියස් රිචඩ් ජයවර්ධන ( ජේ.ආර්. ජයවර්ධන ) ( 1906 සැප්තැම්බර් 17 - 1996 නොවැම්බර් 1 ) සාමාජිකයන් 11 දෙනෙකුගෙන් යුත් පවුලේ වැඩිමලාය.ඔහුගේ පියා ඉයුජින් විල්ෆ්‍රඩ් ජයවර්ධන නම් විනිසුරුවරයායි.කොළඹ රාජකීය විද්‍යාලයේ ඉගෙනුම ලැබූ ඔහු පාසල් ක්‍රිකට් කණ්ඩායමේත්,1925 දී ශාන්ත තෝමස් විද්‍යාලය හා රාජකීය විද්‍යාලය අතර පැවති විවාද කණ්ඩායමේත සිටියේය.තරුණ වියට පත් ඔහු ක්‍රිස්තු ආගම අතහැර බුද්ධාගම වැළඳ ගත්තේය. ජේ.ආර්. ජයවර්ධන වෘත්තියෙන් නීතීඥවරයෙකු වූයේය.1938 දී ලංකා ජාතික කොන්ග්‍රසයෙහි ක්‍රියාකාරයකු ලෙස ද කටයුතු කළේය.වර්ෂ 1940 දී එහි සමලේකම් ධූරයට පත් වූ අතර, 1943 දී රාජ්‍ය සභාවේ කොළනිල් ව්‍යවස්ථාවට තේරිපත් විණි. ඔහු වර්ෂ1946 දී එක්සත් ජාතික පක්ෂයේ ආරම්භ වන විට ඊට එක්වුවේය.1943 රටේ පළමු කැබිනෙට් මණ්ඩලයෙහි මුදල් අමාත්‍යවරයා බවට පත් වූවේය.ඒ අනුව ඩී.එස්.සේනානායක ආණ්ඩුවේ මුදල් අමාත්‍ය ලෙස අයවැය සමතුලිත කිරීමට වෙර දැරූ අතර 1953 දී සහනාධාර කප්පාදුවට යෝජනා ක‍ළේය.මේ හේතුවෙන් හර්තාල් ව්‍යාපාරයක් දියත් වූ බැවින් එය නවතා දැමීමට ඔහුට සිදුවිය. එමෙන්ම මොහු ශ්‍රීමත් එඩ්වින් විජයරත්න ගේ මුලිකත්වයෙන් ජාතික ගීය නිර්මාණය කිරීම සදහා පත්කළ කමිටුවේ සාමාජිකයෙක් විය. 1950 දී ශ්‍රී ලංකා නිදහස් පක්ෂ‍යේ බලපෑම හමුවේ ජේ.ආර්. ජයවර්ධන යූ.එන්.පී.යද ජාතිකත්වයට තල්ලු කළේය.මොහු විසින් සිංහල පමණි පනත ගෙන ඒමෙන් රටේ සුළු ජාතිකයින් ඊට විරුද්ධ විය. 1973 දී ඩඩ්ලි සේනානායක මහතාගේ අභාවයෙන් ඔහු එක්සත් ජාතික පක්ෂ නායකයා බවට පත්විය. 1977 මැතිවරණයෙන් පසු ශ්‍රී ලංකාවේ අගමැතිවරයා බවට පත් වූ අතර ඉන්පසු ජාතික ව්‍යාවස්ථාවක් මඟින් විධායක ජනාධිපති ක්‍රමය ඇති කළේය. 1978, පළමු විධායක ජනාධිපති වූ අතර නීති සම්පාදක අගනුවර වන කොළඹ, ජයවර්ධනපුර‍ට ගෙන යන ලදි. 1977 කෝලාහලයෙන් පසු රජය ප්‍රමිති කරණ පනත මඟින් ද්‍රවිඩයන් හා එකඟ වුයේ සරසවි වරම පිළිබඳවයි.මොහු වර්ධනය වන දෙමළ සටන්කාමී කණ්ඩායම් පිළිබඳව විමසිලිමත් වූ අතර, 1979 ත්‍රස්තවාදය වැළැක්වීම් පනත ගෙන ආවේ ය. 1979 එක්සත් ජාතික පක්ෂයේ ජයග්‍රහණයෙන් පසු 1983 පාර්ලිමේන්තු මැතිවරණය අහෝසි කර, 1977 පාර්ලිමේන්තුව, 1989 තෙක් දීර්ඝ කිරීමේ ඡන්ද විමසීමක් පැවැත්වූවේය. යුද්ධයෙන් උතුරේ ප්‍රදේශ බොහොමයක් එල්.ටී.ටී.ඊ. තුස්තවාදීන් අත්පත් කර ගත්හ. මෙම ගැටුම් හමුවේ ඉන්දියානු රජය හුවමාරු විසඳුමකට තල්ලු කළේය. ජයවර්ධන හා රජිව් ගාන්ධි අතර ඇති වු ඉන්දු ශ්‍රි ලංකා ගිවිසුමෙන් පසු ඉන්දියානු සාම සාධක හමුදාව උතුරේ රැදවා ද්‍රවිඩ පාලන ප්‍රදේශවල බලය ඔවුනට පැවරීය . මෙම ගිවිසුමට එල්.ටී.ටී.ය එකඟ නොවු අතර සිංහල ජාතිකයින් විදේශ හමුදා මෙහි රැදී සිටිනවාට අකමැති වූහ.එ අතර, ජනතා විමුක්ති පෙරමුණ විසින් කැරැල්ලක් නිර්මාණය කළේය. ජේ.ආර්. ජයවර්ධන 1989 වර්ෂයේ දී දේශපාලනයෙන් විශ්‍රාම ගත්තේය."
    },
    {
      "නම": "රණසිංහ ප්‍රේමදාස",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1989 – 1993",
      "විවාහයන්": "හේමා ප්‍රේමදාස",
      "මරණය": 1993,
      "රාජවංශය/පක්ෂය": "එක්සත් ජාතික පක්ෂය",
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "ජේ.ආර්. ජයවර්ධන",
      "අනුප්‍රාප්තිකයා": "ඩී.බී. විජේතුංග",
      "විස්තර": "සිංහල පවුලක උපත ලැබු ප්‍රේමදාස අධ්‍යාපනය ලැබුවේ කොළඹ ශාන්ත ජෝෂප් විදුහලෙනි. කුඩා කළ සිට පුවත්පත් වාර්තාකරුවකු වීමට හීන දුටු ඔහු ඒ සඳහා අඩිතාලම වශයෙන් ජවහර්ලාල් නේරුගේ ස්වයං චරිතාපදානය සිංහලයට නැඟුවේය. ඔහු දේශපාලනය කිරීමට පෙර ඉතා දුප්පත් පුද්ගලයෙක් විය. රණසිංහ ප්‍රේමදාස විවාහ වුයේ හේමා ප්‍රේමදාස සමඟය. ඔහු දරුවන් දෙදෙනකුගේ පියෙක් වූ අතර වර්තමානයේ දී හම්බන්තොට දිස්ත්‍රික් මන්ත්‍රිවරයෙකු වන එක්සත් ජාතික පක්ෂයේ නියෝජ්‍ය නායකයා හා 2020 ජනාධිපති අපේකශකයෙක් වන සජිත් ප්‍රේමදාස මහතා ඔහුගේ පුත‍්‍රයාය."
    },
    {
      "නම": "ඩී.බී. විජේතුංග",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1993-1994",
      "විවාහයන්": null,
      "මරණය": 2008,
      "රාජවංශය/පක්ෂය": "එක්සත් ජාතික පක්ෂය",
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "රණසිංහ ප්‍රේමදාස",
      "අනුප්‍රාප්තිකයා": "චන්ද්‍රිකා කුමාරතුංග",
      "විස්තර": "ශ්‍රී ලංකාභිමාන්‍ය ඩිංගිරි බණ්ඩා විජේතුංග (පෙබරවාරි 15,1916 - සැප්තැම්බර් 21 2008) යනු ශ්‍රී ලංකාවේ තුන්වන විධායක ජනාධිපතිවරයා (මැයි 1,1993 - නොවෙම්බර් 12,1994) සහ ශ්‍රී ලංකාවේ අගමැති (මාර්තු 3,1989 - මැයි 7, 1993) සහ වයඹ පළාත් ආණ්ඩුකාර (1988 - 1989) ලෙස කටයුතු කළ රාජ්‍ය තාන්ත්‍රිකයෙකි. මෙරට තුන්වන ජනාධිපතිවරයා ලෙස වසරක කාලයක් කටයුතු තළ ඩී. බී. විජේතුංග මහතා ඉතා සරල දිවි පෙවෙතත් ගත කළ තැනැත්තෙකි. අව්‍යාජ ජන නායකයෙකු ලෙස ජන හදවත් වල රැඳුණු විජේතුංග මහතා ප්‍රජාතන්ත්‍රවාදී ගතිගුණවලින් සම්පූර්ණ වූවෙකු විය."
    },
    {
      "නම": "චන්ද්‍රිකා කුමාරතුංග",
      "රාජ්‍ය සමය": "ක්‍රි.ව.1994-2005",
      "විවාහයන්": "විජය කුමාරතුංග",
      "මරණය": null,
      "රාජවංශය/පක්ෂය": "ශ්‍රී ලංකා නිදහස් පක්ෂය",
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "ඩී.බී. විජේතුංග",
      "අනුප්‍රාප්තිකයා": "මහින්ද රාජපක්‍ෂ",
      "විස්තර": "චන්ද්‍රිකා බණ්ඩාරනායක කුමාරතුංග ( උපත 1945 ජූනි 29 ) ශ්‍රී ලංකාවේ පස්වන ජනාධිපති සහ හතර වන විධායක ජනාධිපති ( 1994 නොවැම්බර 12 - 2005 නොවැම්බර 19 ) වූවාය. 2005 අග වන තුරුම ඇය ශ්‍රී ලංකා නිදහස් පක්ෂයේ නායිකාව වූවාය. ඇය ශ්‍රී ලංකාවේ ප්‍රථම කාන්තා ජනාධිපති විය. 1945 ජූනි මස 29 දින උපත ලද චන්ද්‍රිකා මැතිණිය ශ්‍රි ලංකාවේ හතර වන විධායක ජනාධිපතිවරයා වේ. ඇය 2005 අවසානය වන තෙක් ශ්‍රි ලංකා නිදහස් පක්ෂයේ නායිකාව ලෙස කටයුතු කල අතර ලංකාවේ පළමු ජනාධිපතිවරිය ද වේ. 1974 දී ඇය ශ්‍රි ලංකා නිදහස් පක්ෂ කාන්තා ලීගයේ විධායක කමිටුවේ සාමාජිකාවක් බවට පත්වූවාය. 1972-1976 දක්වා කාලයේදී ඇය ඉඩම් ප්‍රතිසංස්කරණ කොමිසමේ ප්‍රධාන අධ්‍යක්ෂකවරයකු ලෙස කටයුතු කලාය. 1976-1979 දක්වා කාලයේදී ඇය ආහාර හා කෘෂිකර්ම සංවිධානයේ සභාපති ලෙස කටයුතු කලාය. ශ්‍රි ලංකා නිදහස් පක්ෂය අතහැර දමන ලද ඇය තම සැමියා වන විජය කුමාරතුංගගේ ශ්‍රි ලංකා මහජන පක්ෂයේ ක්‍රියාකාරි ලෙස වැඩකටයුතු කලාය. තම සැමියාව ඝාතනයට ලක්වු පසුව ඇය එක්සත් රාජධානියට ගොස් (එක්සත් ජාතීන්ගේ විශ්වවිද්‍යාලය-ලෝක ආර්ථික සංවර්ධන පරීක්ෂණ ආයතනය) සංවිධානයේ 1991 දක්වා කටයුතු කලාය."
    },
    {
      "නම": "මහින්ද රාජපක්‍ෂ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.2005-2015",
      "විවාහයන්": "ශිරන්ති රාජපක්ෂ",
      "මරණය": null,
      "රාජවංශය/පක්ෂය": "ශ්‍රී ලංකා නිදහස් පක්ෂය",
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "චන්ද්‍රිකා කුමාරතුංග",
      "අනුප්‍රාප්තිකයා": "මෛත්‍රීපාල සිරිසේන",
      "විස්තර": "පර්සි මහේන්ද්‍ර රාජපක්ෂ (මහින්ද රාජපක්ෂ), පා.ම. (උපත 18 නොවැම්බර් 1945) යනු ශ්‍රී ලාංකික දේශපාලනඥයෙක් වන අතර ශ්‍රී ලංකාවෙහි හයවන ජනාධිපතිවරයා ලෙසින් 2005 නොවැම්බර 19 දින සිට 2015 ජනවාරි 9 දින දක්වා තනතුරු දරා ඇත. වෘත්තියෙන් නීතිඥයෙක් වන රාජපක්ෂ මහතා පළමුවෙන් ශ්‍රී ලංකාවෙහි පාර්ලිමේන්තුවට තේරී පත්වුනේ 1970 වසරෙහිදී වන අතර, 2004 අප්‍රේල් 6 දින සිට 2005 ජනාධිපතිවරණයෙහිදී ඔහුගේ ජයග්‍රහණය දක්වා අග්‍රාමාත්‍ය තනතුර හෙබවීය. ජනාධිපතිවරයා ලෙසින් ඔහුගේ පළමු සය-වසර ධූර වාරය සඳහා ඔහු දිවුරුම් දුන්නේ 2005 නොවැම්බර් 19 දිනදීය. දෙවන ධූර කාලය සඳහා ඔහු යළි-තේරී පත්වුණේ 2010 ජනවාරි 27 දිනදීය. තෙවන ධූර කාලයද සඳහා ප්‍රයත්නය දරමින් ඔහු ඉදිරිපත්වූ 2015 ජනාධිපතිවරණයෙහිදී මෛත්‍රීපාල සිරිසේන මහතා වෙතින් පරාජය ලැබ 2015 ජනවාරි 9 දිනදී තනතුරෙන් බැහැර විය. තනතුර හැර ගොස් මාස කිහිපයකට පසුව, අග්‍රාමාත්‍ය ධුරයට පත්වීමට රාජපක්ෂ මහතා විසින් ගත් උත්සාහය අසාර්ථක වූයේ 2015 පාර්ලිමේන්තු මැතිවරණයෙහිදී එක්සත් ජනතා නිදහස් සන්ධානය පරාජයට පත් වීමත් හා සමගිනි. ඔහු කෙසේවෙතත්, කුරුණෑගල දිස්ත්‍රික්කය වෙනුවෙන් පාර්ලිමේන්තු මන්ත්‍රීවරයෙකු ලෙසින් තේරී පත් විය."
    },
    {
      "නම": "මෛත්‍රීපාල සිරිසේන",
      "රාජ්‍ය සමය": "ක්‍රි.ව.2015-2019",
      "විවාහයන්": "ජයන්ති පුෂ්පා කුමාරි",
      "මරණය": null,
      "රාජවංශය/පක්ෂය": "ශ්‍රී ලංකා නිදහස් පක්ෂය, නව ප්‍රජාතන්ත්‍රවාදී පෙරමුණ",
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "මහින්ද රාජපක්‍ෂ",
      "අනුප්‍රාප්තිකයා": "ගෝඨාභය රාජපක්ෂ",
      "විස්තර": "මෛත්‍රීපාල සිරිසේන' (උපත 1951 සැප්තැම්බර් 3) ශ්‍රී ලංකාවේ දේශපාලඥයෙකු වන අතර ශ්‍රී ලංකාවේ හත්වන විධායක ජනධිපතිවරයා වෙයි. ඔහු බස්නාහිර පළාතේ ගම්පහ දිස්ත්‍රික්කයේ යාගොඩ දි උපත ලැබුව ද ජනාධිපතිවරණයට ඉදිරිපත් වූයේ උතුරු මැද පළාතෙන් වන අතර එම පළාතෙන් පත් වූ පළමු ජනාධිපතිවරයා ද ඔහු ය. ඔහු 1989 දී දේශපාලනයට පිවිස 1994 සිට අමාත්‍යංශ කිහිපයක් ද දරා තිබෙන අතර ශ්‍රී ලංකා නිදහස් පක්ෂයේ මහ ලේකම් ධූරය ද සෞඛ්‍යය අමාත්‍යවරයා ධූරය ද 2014 නොවැම්බර් මස විපක්ෂ සන්ධානයේ පොදු අපේක්ෂක ලෙස 2015 ජනාධිපතිවරණය සඳහා ඔහුගේ අපේක්ෂකත්වය නිවේදනය කරන තෙක් දරන ලදී."
    },
    {
      "නම": "ගෝඨාභය රාජපක්ෂ",
      "රාජ්‍ය සමය": "ක්‍රි.ව.2019-වර්තමාන",
      "විවාහයන්": "ලෝමා රාජපක්ෂ",
      "මරණය": null,
      "රාජවංශය/පක්ෂය": "ශ්‍රී ලංකා පොදුජන පෙරමුණ",
      "රාජධානිය/අගනගරය": "ශ්‍රී ජයවර්ධනපුර කෝට්ටේ",
      "පූර්වප්‍රාප්තිකයා": "මෛත්‍රීපාල සිරිසේන",
      "අනුප්‍රාප්තිකයා": null,
      "විස්තර": "ලුතිනන් කර්නල් නන්දසේන ගෝඨාභය රාජපක්ෂ, RWP, RSP, පීඑස්සී, GR (උපත 20 ජූනි 1949) ශ්‍රී ලංකාවෙහි ජනාධිපතිවරයායි. ඔහු ශ්‍රී ලාංකික දේශපාලනඥයෙක්, තාක්ෂණධරයෙක් සහ විශ්‍රාමික හමුදාමය නිලධාරියෙක් වේ. 2005 වර්ෂයේදී, මහින්ද රාජපක්ෂ මහතා ශ්‍රී ලංකාවේ ජනපති ධූරයට පත් වීමත් සමගම, ගෝඨාභය රාජපක්ෂ මහතාට ශ්‍රී ලංකාවෙහි ආරක්ෂක ලේකම් තනතුර හිමිවිය. 2009 වසරේදී දෙමළ කොටි ත්‍රස්ථවාදීන් පරාජය කරමින්, ශ්‍රී ලංකාවේ වසර 26 ක් පැවැති සිවිල් යුද්ධය නිමා කරලීමට, ජනපති මහින්ද රාජපක්ෂ මහතා සමග විශාල කර්තව්‍යය කොටසක්, ආරක්ෂක ලේකම්වරයා වශයෙන් මෙතුමා විසින් ඉටු කරන ලදී. එසේම, 2006 වසරේ දෙසැම්බර් 1 වන දින, දෙමළ කොටි ත්‍රස්ථවාදීන් විසින් කොළඹදී එල්ල කල මරාගෙන මැරෙන බෝම්බ ප්‍රහාරයකින් යංතමින් දිවි බේරා ගැනීමට මෙතුමාට හැකිවිය. වර්ෂ 2019 අගෝස්තු මස 11 වනදා මහින්ද රාජපක්ෂ මහතා විසින් 2019 ශ්‍රී ලංකා ජනාධිපතිවරණයේ ශ්‍රී ලංකා පොදුජන පෙරමුණේ අපේක්ෂකයා ලෙස ගෝඨාභය රාජපක්ෂ මහතා නම් කරන ලදි."
    }
  ]